Repository: WizzerWorks/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/fx_docs/layer_blending/local_transparency.po
Languages: es

source: Local Transparency
es: Local Transparency (Transparencia local)

source: Inputs:
es: Entradas:

source: **Source**, The image that will be affected.
es: **Source (Origen)**, Imagen a la que le será aplicado el efecto.

source: **Reference**, The luminance of the Reference image will control the opacity of the Source.
es: **Reference (Referencia)**, La luminancia de la imagen conectada a *Reference* controlará la opacidad de la imagen conectada a *Source*.

source: The Source will be made transparent where the Reference is light, and opaque where the Reference is dark.
es: La imagen conectada a *Source* se tornará más transparente cuando más clara sea la imagen conectada a *Reference*, y más opaca cuanto más oscura sea.

source: Parameters:
es: Parámetros:

source: **Intensity**, Controls the overall strength of the effect.
es: **Intensity (Intensidad)**, Controla la intensidad global del efecto.

source: A value of 50 will produce a result halfway between the Source image and the full effect.
es: Un valor de 50 producirá un resultado a mitad de camino entre la imagen original y el efecto completo.

source: Usage Example:
es: Ejemplo de uso:

source: We can use a checker pattern to control the opacity of a circle
es: Es posible usar un patrón de damero para controlar la opacidad del círculo

source: This is how the two levels are connected in the FX Schematic; by connecting the checker level to the Reference input, we will use its luminance to mask portions of the circle
es: Así es cómo los dos niveles se encuentran conectados en el Diagrama de efectos; conectando el nivel del damero a la entrada *Reference* es posible usar su luminancia para enmascarar porciones del círculo

source: Here is the result; the red circle is visible within the black areas of the checker pattern and not in the white areas
es: Aquí se muestra el resultado; el círculo rojo es visible en las áreas negras del patrón de damero y no en las blancas
