Repository: WizzerWorks/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/applying_special_fx.po
Languages: ru

source: The Evolution stage of the fractal image can be controlled as well; by setting the variation of this value between two keys, you set how much the fractal image changes during the animation.
ru: Значение Evolution фрактального изображения также может контролироваться; устанавливая изменение этого значения между двумя ключевыми кадрами вы устанавливаете насколько сильно изменяется изображение фрактала во течении анимации.

source: Particles
ru: Particles (Частицы)

source: The Particles effect creates a new level in the selected column/layer containing particles.
ru: Эффект Particles создает новый уровень в выбранном столбце/слое, содержащем частицы.

source: It allows you to simulate a wide range of phenomena, such as rain, snow, sparkles, smoke, and a random configuration of elements, for example a field of shining stars starting from one shining star or the waving grass in a meadow starting from one animated blade of grass.
ru: Он позволяет моделировать широкий спектр явлений, таких как дождь, снег, искры, дым и случайные сочетания элементов, например, поле сияющих звезд, начиная с одной сияющей звезды, или колеблющуюся траву на лугу, начиная с одной анимированной травинки.

source: See :ref:`Using the Particles Effect <using_the_particles_effect>` .
ru: См. :ref:`Применения эффекта частиц <using_the_particles_effect>` .

source: Creates a new column/layer containing editable and animatable text, using the following parameters:
ru: Создает новый столбец/слой, содержащий редактируемый и анимируемый текст, используя следующие параметры:

source: **Source**, specifies the text source. You can choose one from:
ru: **Источник** (Источник), указывает источник текста. Вы можете выбрать один из:

source: **Nearby Note Column**: Get the text from Note Level column put on the directly left side of the Text Iwa effect column, in the Xsheet (for Timeline view, the Note Level layer just under the effect layer is used). If the respective column/layer does not contain a Note Level or the cell is empty, text will not be rendered.
ru: **Nearby Note Column** (Ближайший столбец заметки) : получает текст из столбца Note Level, помещенный непосредственно в левую часть столбца эффекта Text Iwa, в Xsheet (в представлении таймлайна используется слой Note Level непосредственно под слоем эффекта). Если соответствующий столбец/слой не содержит уровень заметки или ячейка пуста, текст не будет отображаться.

source: **Specified Note Column**: It's similar to the **Nearby Note Column** option, but the Note Level column number to use can be specified using the **Column Index** field below.
ru: **Specified Note Column**: аналогичен параметру **Nearby Note Column**, но номер используемого столбца уровня заметок можно указать в помощью поле **Column Index** ниже.

source: **Input Text**: The text typed in the **Text** field below will be used (as shown in the image on top).
ru: **Input Text**: будет использоваться текст, введенный в поле **Text** ниже (как показано на рисунке выше).

source: **Column Index**, specifies the source Note Level column number to use. Only used in **Specified Note Column** Source mode.
ru: **Column Index** указывает номер столбца исходного уровня заметок для использования. Используется только **Specified Note Column** в режиме Source.

source: **Text**, specifies the source text. Only used in **Input Text** Source mode.
ru: **Text**, указывает исходный текст. Используется только в режиме **Input Text** в режиме Source.

source: **Horizontal Align**, specifies the text align. Options are: **Left**, **Right**, **Center**, and **Justify**.
ru: **Horizontal Align**, указывает выравнивание текста. Возможные варианты: **Left** (Слева), **Right** (Справа), **Center** (По центру) и **Justify** (По ширине).

source: **Center X:**, **Y:** specify the position of the text.
ru: **Center X:**, **Y:** задает положение текста.

source: **Width**, **Height**, define the dimension of the text box. Just like in the Text items of the Clapperboard feature, the font size will be automatically adjusted in order to fit the box (see :ref:`Using The Clapperboard <using_the_clapperboard>` ).
ru: **Width**, **Height** определяет размер текстового поля. Как и в параметрах Text функции Хлопушка-нумератор, размер шрифта будет автоматически изменяться, чтобы соответствовать размеру поля (см. :ref:`Использование хлопушки-нумератора <using_the_clapperboard>`).

source: **Font**, specifies the font family to use.
ru: **Font**, указывает семейство шрифтов для использования.

source: **Style:**, specifies the font style to use.
ru: **Style:**, указывает начертание используемого шрифта.

source: **Size:**, specifies the *maximum* font size to use.
ru: **Size:**, указывает *максимальный* размер шрифта для использования.

source: The **Size** value will only take effect if the *automatically-calculated font size* (in order to fit the specified text box) is bigger than the value specified for this parameter.
ru: Значение **Size** вступит в силу только в том случае, если *автоматически рассчитанный размер шрифта* (для размещения в указанном текстовом поле) больше значения, указанного для этого параметра.

source: **Text Color**, specifies the color of the text. This color will also be used for the border line.
ru: **Text Color** указывает цвет текста. Этот цвет также будет использоваться для ограничительной линии.

source: **Box Color**, specifies the background color of the text box.
ru: **Box Color**, определяет цвет фона текстового поля.

source: **Show Border**, when activated, a border line will be rendered around the *text bounding box*. Please note that the *text box* (specified by the user) and the *text bounding box* (automatically computed from the rendered text) may become different, especially when the maximum font **Size** parameter is set to a small value.
ru: Опция **Show Border**, когда активирована, линия границы будет отображаться вокруг *текстовой рамки*. Обратите внимание, что *текстовое поле* (заданное пользователем) и *текстовое ограничивающее поле* (автоматически вычисляемое из визуализированного текста) могут различаться, особенно если для параметра максимальный размер шрифта **Size** установлено небольшое значение.

source: Known Issue: When you are using a Note Level column for the source text, a change in the note text will not automatically trigger the preview regeneration. You will need to manually regenerate the preview using the context menu of the Viewer.
ru: Известная проблема: когда вы используете столбец уровня заметок для исходного текста, изменение текста не будет автоматически запускать регенерацию предварительного просмотра. Вам нужно будет вручную перезапускать предварительный просмотр, используя контекстное меню окна просмотра.

source: Traces the edges of the Source content with a combination of highlights and shadows. You can set the Intensity of the effect, and the Distance and Direction of the light that create the emboss effect. The Radius sets the depth of the embossing.
ru: Обводка краев исходного содержимого с помощью комбинации бликов и теней. Вы можете установить интенсивность (Intensity) эффекта, а также расстояние (Distance) и направление (Direction) света, которые создают эффект тиснения. Радиус (Radius) устанавливает глубину тиснения.

source: By connecting a node to the Controller port, the Source content will be embossed according to the Controller node content.
ru: При подключении узла к порту Controller содержимое Source будет выдавлено в соответствии с содержимым узла Controller.

source: Turns the Source content to grey areas and traces its edges with a combination of highlights and shadows. You can set the Intensity of the effect, and the Distance and Direction of the light that create the emboss effect. The Radius sets the depth of the embossing.
ru: Превращает содержимое узла Source в серые области и обрисовывает его края с помощью комбинации бликов и теней. Вы можете установить интенсивность (Intensity) эффекта, а также расстояние (Distance) и направление света (Direction), которые создают эффект тиснения. Радиус (Radius) устанавливает глубину тиснения.

source: Mosaic
ru: Mosaic (Мозаика)

source: Turns the Source content in a series of tiles according to the specified Size and Distance. The color and transparency of the tiles are sampled from the source content.
ru: Превращает содержимое узла Source в серии плиток в соответствии с указанными размером (Size) и расстоянием (Distance). Цвет и прозрачность плиток берутся из исходного содержимого.

source: A Background Color can be set, and will be visible around the tiles. The tile shape can be chosen between Square and Round.
ru: Цвет фона (Background Color) может быть установлен, и он будет виден вокруг плиток. Форму плитки можно выбрать между квадратной и круглой.

source: Posterize
ru: Posterize (Постеризация)

source: Converts the Source content into a number of shades according to the set number of Levels. The shades depends on the brightness values of the source content and the levels are intended for each channel; for example, two levels produces six colors: two for the red, two for the green, and two for the blue.
ru: Преобразует исходный контент (Source) в несколько оттенков в соответствии с заданным количеством уровней. Оттенки зависят от значений яркости исходного содержимого, и уровни предназначены для каждого канала; например, два уровня дают шесть цветов: два для красный, два для зеленого и два для синего.

source: Blends a negative and a positive version of the Source content, as if exposing a photographic print briefly to light during development. You can set the Intensity of the effect and control the Peak Edge, that is the amount of positive and negative image that is used in the blend.
ru: Смешивает негативную и позитивную версии содержимого Source, как если бы фотографический отпечаток ненадолго подвергался воздействию света во время проявки. Вы можете установить интенсивность эффекта (Intensity) и контролировать Peak Edge, то есть количество используемых позитивных и негативных изображений в производном изображении.

source: Toonz Level type of effects can be applied only to Toonz Vector and Toonz Raster (PLI and TLV files). They usually affect the drawings they are applied to according to Style indexes. Style indexes can be retrieved in the Palette after the # symbol in the Style tooltip, or in the *bottom right corner* of the style in any of the **Thumbnails View** modes.
ru: Эффекты типа Toonz Level могут применяться только к Toonz Vector и Toonz Raster (файлы PLI и TLV). Обычно они влияют на рисунки, к которым они применяются, в соответствии с индексами стилей. Индексы стилей можно узнать в Палитре после символа # в Подсказка стиля или в *нижнем правом углу* стиля в любом из режимов **Просмотра в виде иконок**.

source: Index numbers can be specified in the related text field, separated by a comma. To define a range of indexes, you should type the first and last separated by a dash (e.g. 4-7 will refer to indexes 4, 5, 6 and 7). To select all indexes, type ``all`` ; to select no index, type ``none`` .
ru: Номера индексов можно указать в соответствующем текстовом поле через запятую. Чтобы определить диапазон индексов, вы должны ввести первый и последний индексы, разделенные тире (например, 4-7 будут ссылаться на индексы 4, 5, 6 и 7. Чтобы выбрать все индексы, введите ``all``; чтобы не выбирать индексы, введите ``none``.

source: Toonz Level type of effects have to be always applied first when a series of effects are applied to an animation level, as they work only on Toonz Vector or Toonz Raster levels that have not been transformed by other type of effects. However two or more Toonz Level type of effects can be applied to the same animation level.
ru: Эффекты типа Toonz Level должны всегда применяться первыми, когда серия эффектов применяется к уровню анимации, поскольку они работают только на уровнях Toonz Vector или Toonz Raster, которые не были преобразованы другими типами эффектов. Однако два или более эффекта типа Toonz Level могут быть применены к одному и тому же уровню анимации.

source: Creates in the Source content a pattern, by repeating the Controller node content, along lines painted with styles whose indexes are specified in the Color Indexes text field. It can be used for example to create scattered brush, or hair and fur effects along drawing lines.
ru: Создает в содержимом узла Source узор, повторяя содержимое узла Controller, вдоль линий, окрашенных стилями, индексы которых указаны в текстовом поле Color Indexes. Его можно использовать, например, для создания рассеянной кисти или эффектов волос и меха вдоль линий рисования.

source: The Keep Color option assigns the color of the line to the applied pattern; while the Keep Contour option retains the drawing line that will be visible beneath the pattern.
ru: Параметр Keep Color назначает цвет линии применяемому узору; параметр Keep Contour сохраняет линию рисования, которая будет видна под узором.

source: The way the contents of the Controller node create the pattern depends on the Pattern settings.
ru: То, как содержимое узла Controller создает шаблон, зависит от настроек Pattern.

source: The Density sets the amount of pattern to be applied along the line. By setting the Density to 0, you can specify a Minimum and Maximum Distance between two subsequent images applied as pattern on the line.
ru: Density устанавливает количество рисунка, который будет применяться вдоль линии. Установив для параметра Density значение 0, вы можете указать минимальное и максимальное расстояние между двумя последующими изображениями, применяемыми в качестве рисунка на линии.

source: The Size sets the Minimum and Maximum resizing percentage applied to the images used as the pattern; the value 100 is the original size of the images.
ru: Size устанавливает минимальный и максимальный процент изменения размера, применяемый к изображениям, используемым в качестве шаблона; значение 100 - это исходный размер изображений.

source: The Orientation sets the Minimum and Maximum rotation angle for the images used as the pattern, according to the line direction; the value 0 display the images perpendicular to the line direction. If the Absolute Orientation option is used, the orientation values do not depend on the direction of the lines: the value 0 is the original images orientation.
ru: Orientation устанавливает минимальный и максимальный угол поворота для изображений, используемых в качестве шаблона, в соответствии с направлением линии; значение 0 отображает изображения перпендикулярно направлению линии. Если используется параметр абсолютной ориентации, значения ориентации не зависят от направления линий: значение 0 - это исходная ориентация изображений.

source: You can specify the Thickness increase and how it is applied, as a percentage, to the different line directions Horizontal, Vertical, Up Diagonal, Down Diagonal.
ru: Вы можете указать увеличение толщины Thickness и то, как оно будет применяться в процентах к различным направлениям линий по горизонтали Horizontal, вертикали Vertical, вверх по диагонали Up Diagonal, вниз по диагонали Down Diagonal.

source: The Smoothness sets the smoothness of the passage between sections of the lines affected by the effect, and those not affected; while the Noise sets the regularity of the edge of the line.
ru: Smoothness устанавливает плавность перехода между участками линий, на которые воздействует эффект, и теми, на которые не влияет; в то время как Noise устанавливает регулярность края линии.

source: Blends in the Source content lines and areas painted with styles whose indexes are specified in the Color Indexes text field. It can be used for example to blend shadow and highlight areas with the plain colored area, or to create gradients of colors.
ru: Смешивает строки исходного содержимого Source и области, окрашенные стилями, индексы которых заданы в текстовом поле Color Indexes. Его можно использовать, например, для смешивания теней и выделения областей с обычной цветной областью или для создания градиентов цветов.

source: The Intensity sets how wide the blended area between the selected colors will be; while the Smoothness sets how smooth the dithering between blended colors is.
ru: Intensity определяет, насколько широкой будет область смешивания между выбранными цветами; в то время как Smoothness определяет, насколько плавным будет колебание между смешанными цветами.

source: The No Blending over Other Colors option stops the blending as soon as a line, or an area, whose index is not included in the selection, is detected; if deactivated, the blending between selected colors continues under excluded lines and areas.
ru: Параметр No Blending over Other Colors останавливает смешивание, как только обнаруживается линия или область, индекс которой не включен в выделение; если он отключен, смешивание между выбранными цветами продолжается в разделе исключенные линии и области.

source: Applies to the Source content the palette node connected to the Palette input port; if a column node is connected to the Palette input port, the palette related to its content will be considered.
ru: Применяется к содержимому узла Source палитры, подключенного к входному порту Palette; если узел столбца подключен к входному порту Palette, то будет рассматриваться палитра, связанная с его содержимым.

source: The original styles of the Toonz levels contained in the source node are replaced with those of the levels contained in the palette node according to their style indexes.
ru: Исходные стили уровней Toonz, содержащихся в исходном узле, заменяются стилями уровней, содержащихся в узле палитры, в соответствии с их индексами стилей.

source: Changes in the Source content the thickness of the drawing external outline.
ru: Изменение толщины внешнего контура рисунка, подключенного к Source.

source: The Smoothness sets the smoothness of the passage between sections of the lines affected by the effect, and those not affected; while the Noise sets the regularity of the edge of the outline.
ru: Smoothness задает плавность прохождения между участками линий, затронутых эффектом, и теми, которые не затронуты; в то время как Noise задает регулярность края контура.

source: Filters the styles of the Source content palette according to the indexes specified in the Color Indexes text field.
ru: Фильтрует стили палитры содержимого Source в соответствии с индексами, указанными в текстовом поле Color Indexes.

source: The Apply To option menu lets you choose if you want to affect Lines & Area, only Lines or only Areas, even if painted with the same styles; the Action option menu lets you choose if you want to keep or remove the specified styles.
ru: Меню параметров Apply To позволяет вам выбрать, хотите ли вы повлиять на линии и области (Lines & Area), только на линии (Lines) или только на области (Areas), даже если они нарисованы одними и теми же стилями; меню параметров Action позволяет вам выбрать, хотите ли вы оставить (Keep) или удалить (Delete) указанные стили.

source: Distorts the Texture node content and applies it to the Source content areas that are painted with styles whose indexes are specified in the Color Indexes text field.
ru: Искажает содержимое узла Texture и применяет его к областям узла Source, окрашенным стилями, индексы которых указаны в текстовом поле Color Indexes.

source: The distortion can be done like in the Free Distort effect (see :ref:`Free Distort <free_distort>` ) and the texture can be applied like in the Texture effect (see below).
ru: Искажение может быть сделано как в эффекте Free Distort (см. :ref:`Free Distort <free_distort>`), а текстура может быть применена как в эффекте Texture (см. ниже).

source: Applies the Texture node content to the Source content lines and areas that are painted with styles whose indexes are specified in the Color Indexes text field.
ru: Применяет содержимое узла Texture к линиям и областям узла Source, окрашенным стилями, индексы которых указаны в текстовом поле Color Indexes.

source: As the texture node content can be animated as you like, this effect allows you to generate animated texture as well.
ru: Поскольку содержимое узла Texture можно анимировать по своему усмотрению, этот эффект также позволяет создавать анимированную текстуру.

source: The Action option menu lets you choose if you want to apply the texture to the specified styles (Keep) or to apply it to all styles except for the specified ones (Delete).
ru: Меню параметров Action позволяет вам выбрать, хотите ли вы применить текстуру к указанным стилям (Keep) или применить ее ко всем стилям, кроме указанных (Delete).

source: The Mode option menu lets you set how the texture node content will be applied: Texture uses the texture to replace selected styles; Pattern preserves the original colors but varies them according to the texture brightness; Add, Subtract, Multiply, Lighten and Darken defines the way the texture is applied to the original colors (see :ref:`Layer Blending <layer_blending>` ). In case the Add, Subtract or Multiply mode are selected, you can also set the Value of the effect.
ru: Меню параметров Mode позволяет вам установить, как будет применяться содержимое узла текстуры: Texture использует текстуру для замены выбранных стилей; Pattern сохраняет исходные цвета, но изменяет их в соответствии с яркостью текстуры; Add (Добавить), Subtract (Вычесть), Multiply (Умножить), Lighten (Осветлить) и Darken (Затемнить) определить способ применения текстуры к исходным цветам (см. :ref:`Layer Blending <layer_blending>`). Если выбран режим Add, Subtract или Multiply, вы также можете установить значение (Value) эффекта.

source: To repeat the texture image and tile it to create a larger texture, you can apply the Tile effect to the texture column before linking it to the Texture node (see :ref:`Tile <tile>` ).
ru: Чтобы повторить изображение текстуры и создать мозаику для создания более крупной текстуры, вы можете применить эффект Tile к столбцу текстуры перед тем, как связать его с узлом текстуры (см. :ref:`Tile <tile>`).

source: OpenToonz enables support for effects rendered through hardware-accelereted pixelshaders. Shaders are simple programs compiled by a graphics processing unit that harness the massively parallel architecture of modern graphics devices, to execute with extreme speed. OpenToonz's shader effects are written in the OpenGL Shading Language (GLSL), and are located in ``OpenToonz stuff/library/shaders``. Refer to the readme.txt file there for further details on editing or creating new shader effects.
ru: OpenToonz обеспечивает поддержку эффектов, визуализируемых с помощью пиксельных шейдеров с аппаратным ускорением. Шейдеры - это простые программы, скомпилированные графическим процессором, использующие массивно-параллельную архитектуру современных графических устройств для выполнения с экстремальной скоростью. Эффекты шейдеров OpenToonz написаны на языке шейдеров OpenGL (GLSL) и находятся в папке ``OpenToonz stuff/library/shaders``. Дополнительные сведения о редактировании или создании новых эффектов шейдеров см. в файле readme.txt.

source: Creates a new column/layer containing a simulation of the reflection of light on a water surface. Sets the color of the water defining the RGBA values of the Water Color parameter.
ru: Создает новый столбец/слой, содержащий моделирование отражения света от поверхности воды. Можно задать Water Color (цвет воды), выражаемый значениями RGBA.

source: Creates a new column/layer containing a ball of flames erupting from a point.
ru: Создает новый столбец/слой, содержащий огненный шар, вырывающийся из точки.
