Repository: WizzerWorks/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/applying_special_fx.po
Languages: ru

source: Some gadgets have a handle for reference; however any point along the gadget shape can be clicked and dragged.
ru: Некоторые гаджеты имеют указатели для справки; однако любую точку вдоль формы гаджета можно щелкнуть и перетащить.

source: Defining Colors and Color Spectrums
ru: Определение цветов и цветовых спектров

source: Some effects may require the definition of a color, or a color spectrum.
ru: Некоторые эффекты могут потребовать определения цвета или цветового спектра.

source: Colors can be defined by editing the related Red, Green, Blue and Alpha values, or by using the Style Editor.
ru: Цвета могут быть определены путем редактирования соответствующих значений красного, зеленого, синего и альфа-канала или с помощью редактора стилей.

source: Color spectrums, i.e. a series of colors defining a continuous gradient, can be defined by adding any color you need, and editing each color separately. The color in the spectrum can be moved to set the distance between two colors and the related gradient.
ru: Цветовые спектры, то есть серия цветов, определяющих непрерывный градиент, могут быть определены путем добавления любого нужного цвета и редактирования каждого цвета отдельно. Цвет в спектре может быть перемещен, чтобы установить расстояние между двумя цветами и соответствующим градиентом.

source: **To define a color:**
ru: **Чтобы определить цвет:**

source: Set the Red, Green, Blue and Alpha values.
ru: Установите значения красного, зеленого, синего и альфа каналов.

source: Click the color thumbnail and use the Style Editor to edit it (see :ref:`Plain Colors <plain_colors>` ).
ru: Нажмите на миниатюру цвета и используйте Редактор стилей, чтобы отредактировать его (см. :ref:`Простые цвета <plain_colors>`).

source: **To set a color of the spectrum:**
ru: **Чтобы установить цвет спектра:**

source: Select the arrow below the spectrum identifying the color, and edit the related color.
ru: Перемещайте стрелку под спектром, определяющую цвет, и отредактируйте связанный цвет.

source: **To add a color to the spectrum:**
ru: **Чтобы добавить цвет к спектру:**

source: Click the spectrum where you want to add the new color.
ru: Нажмите на спектр, где вы хотите добавить новый цвет.

source: **To move a color in the spectrum:**
ru: **Чтобы переместить цвет в спектре:**

source: Click and drag the arrow identifying the color to a new position.
ru: Нажмите и перетащите стрелку, обозначающую цвет, на новую позицию.

source: **To remove a color from the spectrum:**
ru: **Чтобы удалить цвет из спектра:**

source: Click and drag the arrow identifying the color *down*.
ru: Нажмите и перетащите стрелку, обозначающую цвет *вниз*.

source: Creating Presets
ru: Создание предустановок

source: A particular configuration and animation of an effect parameters can be saved as a **Preset** to be available later on, both in the FX Browser and the drop-down menus that open when right-clicking nodes or in the Schematic area.
ru: Конкретную конфигурацию и анимацию параметров эффекта можно сохранить в виде **Пресета**, который будет доступен позже, как в обозревателе эффектов, так и в раскрывающихся меню, которые открываются при щелчке правой кнопкой мыши по узлам или в области схемы.

source: When a preset for a particular effect is saved, in the FX Browser the effect icon turns into a folder containing the saved preset, with the folder icon still selectable to insert the effect with its default values; in the drop-down menus the effect has an additional drop down menu where the first item can be selected to insert the effect with its default values.
ru: При сохранении пресета для определенного эффекта в браузере эффектов значок эффекта превращается в папку, содержащую сохраненный пресет, при этом значок папки по-прежнему можно выбрать для вставки эффекта со значениями по умолчанию; в раскрывающихся меню эффект имеет дополнительное раскрывающееся меню, в котором можно выбрать первый элемент, чтобы вставить эффект со значениями по умолчанию.

source: Presets are saved in the ``<projectroot>\fxs\preset`` folder. This allow the presets to be available on all the computers sharing the same *Projectroot* (see :ref:`Setting the Projectroot <setting_the_projectroot>` ).
ru: Пресеты сохраняются в папке ``<projectroot>\fxs\preset``. Это позволяет пресетам быть доступными на всех компьютерах, использующих один и тот же *Projectroot* (см. :ref:`Настройка Projectroot <setting_the_projectroot>`).

source: Currently the statement above if not true, as by default presets are being saved in ``OpenToonz stuff\fxs\presets``. On Windows it can be changed to any other path by going to the registry and changing the ``System\HKEY_LOCAL_MACHINE\SOFTWARE\OpenToonz\OpenToonz\TOONZFXPRESETS`` key to the desired location.
ru: В настоящее время приведенное выше утверждение не соответствует действительности так как по умолчанию пресеты сохраняются в ``OpenToonz stuff\fxs\presets``. В Windows его можно изменить на любой другой путь, перейдя в реестр и изменив значение ``System\HKEY_LOCAL_MACHINE\SOFTWARE\OpenToonz\OpenToonz\TOONZFXPRESETS`` на нужное место.

source: Once a preset is applied there is no link between the *saved preset* and the *applied preset*: the applied preset can be edited without affecting the saved one.
ru: После применения пресета связь между *сохраненным пресетом* и *применяемым пресетом* отсутствует: примененный пресет можно редактировать, не затрагивая сохраненный.

source: When you save a preset with a name already used, a confirmation dialog will open, asking you whether you want to overwrite the previously saved preset.
ru: Когда вы сохраняете пресет с уже использованным именем, откроется диалоговое окно подтверждения, в котором вас спросят, хотите ли вы перезаписать ранее сохраненный пресет.

source: **To save a preset:**
ru: **Чтобы сохранить пресет:**

source: Right-click the effect node you want to save as a preset and choose **Save As Preset** from the menu that opens.
ru: Щелкните правой кнопкой мыши узел эффекта, который вы хотите сохранить в качестве пресета, и выберите **Сохранить как пресет** в открывшемся меню.

source: Assign a name to the preset and click the **Save** button.
ru: Присвойте имя пресету и нажмите кнопку **Сохранить**.

source: **To retrieve a saved preset:**
ru: **Чтобы извлечь сохраненный пресет:**

source: Open the **FX Browser** and open the folder related to the effect for which you saved the preset.
ru: Откройте **Браузер FX** и откройте папку, относящуюся к эффекту, для которого вы сохранили пресет.

source: In the right-click menus **Insert FX**, **Add FX** or **Replace FX**, choose the sub-menu related to the effect for which you saved the preset.
ru: В меню правой кнопки мыши **Вставить FX**, **Добавить FX** или **Заменить FX** выберите подменю, относящееся к эффекту, для которого вы сохранили пресет.

source: **To remove a preset from the FX Browser:**
ru: **Чтобы удалить пресет из браузера FX:**

source: Right-click the preset in the FX Browser and choose **Remove Preset** from the menu that opens.
ru: Щелкните правой кнопкой мыши по пресету в Браузере FX и выберите **Удалить пресет** в открывшемся меню.

source: Creating Macro FX
ru: Создание Macro FX

source: Effects can be combined to create a *macro effect* that can be saved and retrieved when needed.
ru: Эффекты можно комбинировать для создания *макроэффекта*, который можно сохранять и извлекать при необходимости.

source: When a macro effect is defined, you can edit its settings either in the standard way with the FX Settings window that contains a tab for each effect combined to define the macro, or by opening it and editing one effect at a time.
ru: Когда определен макроэффект, вы можете редактировать его настройки либо стандартным способом в окне настроек FX, содержащем вкладку для каждого эффекта, объединенного для определения макроэффекта, либо открывая его и редактируя один эффект за раз.

source: A macro effect can be opened also to check how the effect nodes are connected, and can be exploded to dissolve it and put its effect nodes back in the Schematic.
ru: Макроэффект может быть открыт также для проверки того, как узлы эффекта связаны, и может быть распущен, а его узлы эффектов вернутся обратно в схему.

source: When saved, the macro effect will be available in the FX Browser and in the drop-down menus that open when right-clicking nodes or in the Schematic area, inside the **Macro** folder, at the bottom of the list.
ru: После сохранения макроэффект будет доступен в Браузере FX и в раскрывающихся меню, которые открываются при щелчке правой кнопкой мыши по узлам или в области схемы внутри папки **Macro** в нижней части списка.

source: **To create a macro effect:**
ru: **Для создания макроэффекта:**

source: Select the effect nodes you want to combine to create the macro effect.
ru: Выберите узлы эффекта, которые вы хотите объединить для создания макроэффекта.

source: Right-click the selection and select **Make Macro FX** from the menu that opens.
ru: Щелкните правой кнопкой мыши на выделении и выберите **Cделать Macro FX** в открывшемся меню.

source: **To open a macro effect:**
ru: **Чтобы открыть макроэффект:**

source: Right-click the macro node and choose **Open Macro FX** from the menu that opens: the macro nodes are displayed in a box, with the right links to the rest of the schematic.
ru: Щелкните правой кнопкой мыши узел макроэффекта и выберите **Открыть Makro FX** в открывшемся меню: узлы макроэффекта отображаются в поле с правыми ссылками на остальную часть схемы.

source: When the content of a macro is displayed *it is not* possible to edit the links between macro nodes and links with nodes outside the macro.
ru: Когда отображается содержимое макроэффекта *невозможно* редактировать ссылки между узлами макроэффекта и ссылки с узлами вне макроэффекта.

source: **To close a macro effect:**
ru: **Чтобы закрыть макроэффект:**

source: Click the **Close** button on the right of the macro box bar.
ru: Нажмите кнопку **Закрыть** справа от панели макроэффекта.

source: **To release a macro effect:**
ru: **Чтобы распустить макроэффект:**

source: Right-click the macro node and choose **Explode Macro FX** from the menu that opens.
ru: Щелкните правой кнопкой мыши узел макроэффекта и выберите **Разбить Makro FX** в открывшемся меню.

source: **To edit a macro effect:**
ru: **Чтобы отредактировать макроэффект:**

source: Right-click the macro node and choose **Edit FX...** from the menu that opens.
ru: Щелкните правой кнопкой мыши узел макроэффекта и выберите **Редактировать FX...** в открывшемся меню.

source: Right-click the macro node and choose **Open Macro FX** from the menu that opens, then edit the macro effect nodes.
ru: Щелкните правой кнопкой мыши узел макроэффекта и выберите **Открыть Makro FX** в открывшемся меню, затем отредактируйте узлы макроэффекта.

source: **To save a macro effect:**
ru: **Чтобы сохранить макроэффект:**

source: Right click the macro effect node you want to save and choose **Save As Preset** from the menu that opens.
ru: Щелкните правой кнопкой мыши узел эффекта макроэффета, который вы хотите сохранить, и выберите **Сохранить как пресет...** в открывшемся меню.

source: Assign a name to the macro effect and click the **Save** button.
ru: Присвойте имя макроэффекту и нажмите кнопку **Сохранить**.

source: **To remove a macro effect from the FX Browser:**
ru: **Чтобы удалить макроэффект из Браузера FX:**

source: Right-click the macro effect in the FX Browser and choose **Remove Macro FX** from the menu that opens.
ru: Щелкните правой кнопкой мыши макроэффект в Браузере FX и выберите **Удалить Macro FX** в открывшемся меню.

source: Effects List
ru: Список эффектов

source: Creates a new column/layer containing a checkerboard defined by two Colors, and a grid Size.
ru: Создает новый столбец/слой, содержащий шахматную доску, заданную двумя цветами (Color) , и размером (Size) сетки.

source: The grid size can also be set by using a square gadget with a handle in the Viewer (see :ref:`Using FX Gadgets <using_fx_gadgets>` ).
ru: Размер сетки также можно установить с помощью квадратного указателя в ​​окне просмотра (см. :ref:`Использование FX Gadgets <using_fx_gadgets>`).

source: Creates a new column/layer containing the set Color. It can be used, for example, as a background color or to create a colorize effect by applying it combined with a multiply effect.
ru: Создает новый столбец/слой, содержащий заданный цвет (Color). Его можно использовать, например, в качестве цвета фона или для создания эффекта раскрашивания, применяя его в сочетании с эффектом умножения.

source: Kaleido
ru: Kaleido (Калейдоскоп)

source: Repeats the Source generating a kaleidoscopic effect.
ru: Повторяет источник, генерирующий калейдоскопический эффект.

source: The center of the effect can be defined interactively, moving the small red cross widget in the preview area, or writing the desired values in the X and Y text fields.
ru: Центр эффекта можно определить интерактивно, перемещая маленький виджет красного креста в области предварительного просмотра или записывая нужные значения в текстовые поля X и Y.

source: The angle of reflection, and the number of iterations can be set in the appropriate input text fields (Angle and Count).
ru: Угол отражения и количество итераций можно задать в соответствующих полях ввода текста (Angle и Count).

source: Repeats the Source content in order to define a larger image: the Tile mode forms a pattern that completely fills the camera shot, the Tile Horizontally repeats the source content horizontally; the Tile Vertically repeats the source content vertically.
ru: Эффект повторяет исходное изображение для создания большего изображения: режим Tile формирует шаблон, который полностью заполняет снимок с камеры, Tile Horizontally повторяет исходное содержимое по горизонтали; Tile Vertically повторяет исходное содержимое по вертикали.

source: The Mirror Horizontally and Mirror Vertically options repeat the tiles by flipping them respectively in the horizontal and vertical directions; If both the options are activated, tiles will be mirrored in both directions.
ru: Параметры Mirror Horizontally и Mirror Vertically повторяют плитки, переворачивая их соответственно в горизонтальном и вертикальном направлениях; если обе опции активированы, плитки будут отражаться в обоих направлениях.

source: The Margin value sets the size of a margin around each tile, with positive values adding some space around the tiles, and negative values collapsing them.
ru: Значение Margin устанавливает размер поля вокруг каждой плитки, при этом положительные значения добавляют пространство вокруг плиток, а отрицательные значения сжимают их.

source: Blur
ru: Blur (Размытие)

source: Softens the Source content, creating an out of focus effect, according to a specific Intensity.
ru: Смягчает содержимое источника, создавая эффект расфокусировки, в соответствии с определенной интенсивностью.

source: Blurs the Source content according to a specific Intensity along a specific direction defined by the Angle.
ru: Размытие исходного содержимого в соответствии с определенной интенсивностью (Intensity) в определенном направлении, определенном углом (Angle).

source: The Bidirectional option applies the blur also on the other side of the direction.
ru: Параметр Bidirectional применяет размытие также на другой стороне направления.

source: The intensity and the angle can also be set by using an arrow gadget with a handle in the Viewer (see :ref:`Using FX Gadgets <using_fx_gadgets>` ).
ru: Интенсивность и угол можно также установить с помощью гаджета со стрелкой с ручкой в ​​окне просмотра (см. :ref:`Использование FX Gadgets <using_fx_gadgets>`).

source: The directional blur does not depend on the movement and the speed of the column to which it is applied.
ru: Направленное размытие не зависит от движения и скорости столбца, к которому оно применяется.

source: Blurs the Source content according to the brightness value of the node content connected to the Reference input handle. The Intensity value amplifies uniformly the blur given by the Reference node content.
ru: Размытие исходного содержимого в соответствии со значением яркости содержимого узла, подключенного к референсному вводу с другого узла. Значение интенсивности (Intensity) равномерно усиливает размытие, данное содержание опорного узла.

source: Motion Blur
ru: Motion Blur (Размытие в движении)

source: Creates a motion-blur effect, according to the movement of the Source content in the previous and current frame. The movement has to be defined by an animated column, pegbar or table: the higher the speed, the more visible the effect.
ru: Создает эффект размытия движения в соответствии с движением исходного содержимого в предыдущем и текущем кадре. Движение должно определяться анимированным столбцом, штифтами или таблицей: чем выше скорость, тем более заметен эффект.

source: If the movement is constant between consecutive frames, you can increase or decrease the Intensity to have a more or less visible effect. If there is no movement between the previous and the current frame, no motion blur will be visible even though you may have set a high Intensity.
ru: Если движение между последовательными кадрами является постоянным, вы можете увеличить или уменьшить интенсивность (Intensity), чтобы получить более или менее видимый эффект. Если нет движения между предыдущим и текущим кадрами, размытие движения не будет видно, даже если вы установили высокую интенсивность.

source: No result will be visible if the motion blur is applied to a column that always stands in the same position while the content is a level where the movement is drawn.
ru: Никакого результата не будет видно, если размытие в движении применяется к столбцу, который всегда находится в одной и той же позиции, в то время как содержимое является уровнем, на котором нарисовано движение.

source: Blurs along radial lines whose origin is the set Center, defined by horizontal (X) and vertical (Y) coordinates, starting from an unaffected inner area defined by the Radius.
ru: Размытие вдоль радиальных линий, источником которых является заданный центр (Center), определяемый горизонтальными (X) и вертикальными (Y) координатами, начиная с незатронутой внутренней области, определенной радиусом (Radius).

source: The center and the radius can be also set by using a point and a circle gadget with a handle in the Viewer (see :ref:`Using FX Gadgets <using_fx_gadgets>` ); the center can be set in the FX Settings preview as well.
ru: Центр и радиус также можно установить с помощью точечного и кругового гаджета с указателем в окне просмотра (см. :ref:`Использование FX Gadgets <using_fx_gadgets>`); центр также можно установить в предварительном просмотре настроек FX.

source: Blurs along concentric circular lines as if the Source content turns around the set Center, defined by horizontal (X) and vertical (Y) coordinates, starting from an unaffected inner area defined by the Radius.
ru: Размытие по концентрическим круговым линиям, как будто содержимое источника поворачивается вокруг установленного центра (Center), определенного горизонтальными (X) и вертикальными (Y) координатами, начиная с незатронутой внутренней области, определенной радиусом (Radius).

source: Distorts the Source content according to the position of four points, defined by horizontal (X) and vertical (Y) coordinates. For each point you can set the actual position and its origin, to determine which feature of the image will be distorted to the new position.
ru: Искажает исходный контент в соответствии с положением четырех точек, определенных горизонтальными (X) и вертикальными (Y) координатами. Для каждой точки вы можете установить фактическую позицию и ее происхождение, чтобы определить, какая особенность изображения будет искажена в новой позиции.

source: The Mode option menu lets you set the way the distortion is applied: Bilinear distorts the images according to the four points end positions, and Perspective forces the distortion to fit a perspective projection plane.
ru: Параметр Режим (Mode) позволяет вам установить способ применения искажения: Bilinear искажает изображения в соответствии с конечными положениями четырех точек, и Perspective заставляет искажение соответствовать плоскости проекции перспективы.

source: To better set the origin position for each point, you can use the Deactivate option that lets you see the image without distortion.
ru: Чтобы лучше установить исходную позицию для каждой точки, вы можете использовать опцию Деактивировать (Deactivate), которая позволяет вам видеть изображение без искажений.

source: The position of the four points and their origins can be also set by using arrow gadgets with handles at the ends in the Viewer (see :ref:`Using FX Gadgets <using_fx_gadgets>` ) and in the FX Settings preview as well.
ru: Положение четырех точек и их начало также можно задать с помощью гаджетов со стрелками с ручками на концах в окне просмотра (см. :ref:`Использование FX Gadgets <using_fx_gadgets>`) и в предварительном просмотре настроек FX также.

source: Distorts the Source content creating a wave effect that uses an automatically generated displacement map image. The Quantity value sets the number of waves; the Period sets the distance between waves; the Phase shifts distortion in the wave direction.
ru: Искажает исходный контент, создавая волновой эффект, который использует автоматически сгенерированное изображение карты смещения. Значение Количество (Quantity) устанавливает количество волн; Период (Period) устанавливает расстояние между волнами; Фаза (Phase) сдвигает искажения в направлении волны.

source: You can also add a Transverse Wave on the main linear waves: the Amplitude sets the intensity of the distortion; the Frequency sets the number of waves creating the distortion; the Cycle shifts the distorting waves.
ru: Вы также можете добавить поперечную волну к основным линейным волнам: амплитуда (Amplitude) устанавливает интенсивность искажения; Частота (Frequency) устанавливает количество волн, создающих искажение; Цикл (Cycle) сдвигает искажающие волны.

source: A rotation for the whole wave effect can be set by using the Angle value.
ru: Вращение для всего волнового эффекта может быть установлено с помощью значения угла (Angle).

source: The amount of distortion is controlled by the Intensity value; the detail of the distortion, by the Sensitivity parameter; the Sharpen option allows you to decrease the blur on the final result.
ru: Количество искажений контролируется значением интенсивности (Intensity); детали искажения, параметром чувствительности (Sensitivity); Параметр Резкость (Sharpen) позволяет уменьшить размытость конечного результата.

source: Distorts the Source content by using a computer-generated displacement map image whose type can be chosen between Clouds and Marble/Wood.
ru: Искажает исходный контент, используя сгенерированное компьютером изображение карты смещения, тип которого можно выбрать между Clouds и Marble/Wood.
