Repository: WizzerWorks/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/applying_special_fx.po
Languages: ru

source: Click and drag the output port of the node to the input port of the effect node.
ru: Нажмите и перетащите выходной порт узла на входной порт узла эффекта.

source: **To select nodes and links:**
ru: **Чтобы выделить узлы и ссылки:**

source: Click to select a node or a link.
ru: Нажмите, чтобы выделить узел или ссылку.

source: Click and drag to select a group of nodes and links.
ru: Нажмите и перетащите, чтобы выбрать группу узлов и ссылок.

source: Ctrl-click (PC) or Cmd-click (macOS) to add a node or a link to, or remove it from the selection.
ru: Кликните с зажатой клавишей Ctrl (PC) или Cmd (macOS), чтобы добавить узел или ссылку, или удалить его из выбора.

source: **To delete links between nodes:**
ru: **Чтобы удалить ссылки между узлами:**

source: Select the links you want to delete and do one of the following:
ru: Выберите ссылки, которые вы хотите удалить, и выполните одно из следующих действий:

source: Choose Edit → **Delete**.
ru: Выберите пункт меню Правка → **Удалить**.

source: Right-click any selected link and choose **Delete** from the menu that opens.
ru: Щелкните правой кнопкой мыши любую выбранную ссылку и выберите **Удалить** в открывшемся меню.

source: **To connect a node to the Xsheet node:**
ru: **Чтобы подключить узел к узлу Xsheet:**

source: Click and drag the output port of the node to the input port of the **Xsheet** node.
ru: Щелкните и перетащите порт вывода узла на порт ввода узла **Xsheet**.

source: Right-click the node you want to connect to the Xsheet node, and choose **Connect to Xsheet** from the menu that opens.
ru: Щелкните правой кнопкой мыши узел, который вы хотите подключить к узлу Xsheet, и выберите **Присоединить к Xsheet** в открывшемся меню.

source: **To disconnect a flow from the Xsheet node:**
ru: **Чтобы отключить поток от узла Xsheet:**

source: Delete the link from the node to the Xsheet node.
ru: Удалить ссылку с узла на узел Xsheet.

source: Right-click the node you want to disconnect from the Xsheet node, and choose **Disconnect from Xsheet** from the menu that opens.
ru: Щелкните правой кнопкой мыши узел, который вы хотите отключить от узла Xsheet, и выберите **Отсоединить от Xsheet** в открывшемся меню.

source: **To insert an effect node into a link:**
ru: **Чтобы вставить узел эффекта в ссылку:**

source: **Alt-click and drag** it onto the link.
ru: **Кликните, удерживая клавишу Alt и перенесите** на ссылку.

source: **To extract an effect node from a link:**
ru: **Чтобы извлечь узел эффекта из ссылки:**

source: **Alt-click and drag** it away from the link.
ru: **Кликните, с зажатой клавишей Alt и перетащите** его из ссылки.

source: **To edit an effect nodes selection:**
ru: **Чтобы отредактировать выделение узлов эффекта:**

source: Use the **Copy** command to keep the selection in memory for further operations.
ru: Используйте команду **Копировать**, чтобы сохранить выбор в памяти для дальнейших операций.

source: Use the **Cut** command to eliminate the selection from the schematic and keep it in memory for further operations.
ru: Используйте команду **Вырезать**, чтобы исключить выделение из схемы и сохранить его в памяти для дальнейших операций.

source: Use the **Paste** command to paste the selection kept in memory in the FX Schematic.
ru: Используйте команду **Вставить**, чтобы вставить выделение, сохраненный в памяти в схеме FX.

source: Right-click a link and use the **Paste Insert** command to insert the selection kept in memory into the *selected link*.
ru: Щелкните правой кнопкой мыши ссылку и используйте команду **Вставить вставку**, чтобы вставить выделенный в памяти выбор в *выбранную ссылку*.

source: Right-click any node and use the **Paste Add** command to add the selection kept in memory from the *selected nodes* at the end of the new links.
ru: Щелкните правой кнопкой мыши любой узел и используйте команду **Вставить Добавить**, чтобы добавить выделение, сохраненное в памяти, из *выбранных узлов* в конце новых ссылок.

source: Right-click an effect node and use the **Paste Replace** command to replace the *selected effect nodes* with the selection kept in memory.
ru: Щелкните правой кнопкой мыши узел эффекта и используйте команду **Вставить Заменить**, чтобы заменить *выбранные узлы эффекта* выделением, сохраненным в памяти.

source: Use the **Delete** command to delete the selection.
ru: Используйте команду **Удалить**, чтобы удалить выделеное.

source: All these commands are available in the menu that opens when right-clicking nodes and links.
ru: Все эти команды доступны в меню, которое открывается при щелчке правой кнопкой мыши узлов и ссылок.

source: **To create a linked effect:**
ru: **Чтобы создать связанный эффект:**

source: Select the effect nodes you want to duplicate.
ru: Выберите узлы эффектов, которые вы хотите дублировать.

source: Right-click any of the selected nodes and choose **Create Linked FX** from the menu that opens.
ru: Щелкните правой кнопкой мыши любой из выбранных узлов и выберите **Создать связанный FX** в открывшемся меню.

source: **To break linked effects:**
ru: **Чтобы сломать связанные эффекты:**

source: Select the effect nodes you want to unlink.
ru: Выберите узлы эффектов, которые вы хотите разъединить.

source: Right-click any of the selected nodes and choose **Unlink** from the menu that opens.
ru: Щелкните правой кнопкой мыши любой из выбранных узлов и выберите **Разъединить** в открывшемся меню.

source: Using Multiple Output Nodes
ru: Использование нескольких выходных узлов

source: In the FX Schematic by default the Xsheet node is connected to an Output node: this means that all the nodes connected to the Xsheet node will be rendered both in the preview and in the final rendering.
ru: В схеме FX по умолчанию узел Xsheet подключен к узлу Output: это означает, что все узлы, подключенные к узлу Xsheet, будут отображаться как в режиме предварительного просмотра, так и при окончательном отображении.

source: The scene rendering can be limited to a specific node of the schematic by creating additional Output nodes, connected to the node where you want to limit the rendering.
ru: Рендеринг сцены может быть ограничен конкретным узлом схемы путем создания дополнительных выходных узлов, связанных с узлом, где вы хотите ограничить рендер.

source: When more than one Output node is defined, you can set which is the *active* one (the one that will be considered for previewing or rendering the scene); the active output node is displayed in *blue*, while the others in *grey*.
ru: Когда определено более одного выходного узла, вы можете установить, какой из них *активный* (тот, который будет рассматриваться для предварительного просмотра или рендера сцены); активный выходной узел отображается *синим*, а остальные *серым*.

source: **To limit the output to a specific node:**
ru: **Чтобы ограничить вывод определенным узлом:**

source: Select the node to which you want to limit the output.
ru: Выберите узел, для которого вы хотите ограничить вывод.

source: Click the **New Output** button (|output|) in the bottom bar of the schematic window.
ru: Нажмите кнопку **Новый вывод** (|output|) в нижней панели окна схемы.

source: Right-click the node and choose **New Output** from the menu that opens.
ru: Щелкните правой кнопкой мыши узел и выберите **Новый вывод** в открывшемся меню.

source: **To add an Output node:**
ru: **Чтобы добавить выходной узел:**

source: Right-click in the schematic and choose **New Output** from the menu that opens.
ru: Щелкните правой кнопкой мыши по схеме и выберите **Новый вывод** в открывшемся меню.

source: **To connect a node to an Output node:**
ru: **Чтобы подключить узел к выходному узлу:**

source: Click and drag the output port of the node to the input port of the Output node.
ru: Нажмите и перетащите выходной порт узла на входной порт выходного узла.

source: **To set the current Output node:**
ru: Чтобы установить текущий узел вывода:

source: Right-click the Output you want to set as current and choose **Activate** from the menu that opens.
ru: Щелкните правой кнопкой мыши по выводному узлу, который вы хотите установить в качестве текущего, и выберите **Активировать** в открывшемся меню.

source: **To remove an Output node:**
ru: **Чтобы удалить узел вывода:**

source: Select it and choose Edit → **Delete**.
ru: Выделите его и выберите пункт меню Правка → **Удалить**.

source: Right-click it and choose **Delete** from the menu that opens.
ru: Щелкните правой кнопкой мыши и выберите **Удалить** в открывшемся меню.

source: The last Output node remaining cannot be removed from the Schematic.
ru: Последний оставшийся узел вывода не может быть удален из схемы.

source: Editing Effects Settings
ru: Изменение настроек эффектов

source: Effects parameters and their animation can be controlled in the **FX Settings** window. According to the selected effect, it displays a different layout of sliders, check boxes, text fields, etc.
ru: Параметрами эффектов и их анимацией можно управлять в окне **Настройки эффектов**. В соответствии с выбранным эффектом, он отображает различные макеты ползунков, флажков, полей ввода текста и т.д.

source: At the bottom of the window a *preview area* is available to check the result of the applied effect: you can expand it or contract it, activate it or deactivate it, navigate its content, set its size, its background color, and limit it to the camera shot. The preview area can be expanded or contracted by clicking on the **+**/**-** symbol to the left of the **Swatch Viewer** text, at the bottom left of the FX Settings window.
ru: В нижней части окна доступна *область предварительного просмотра*, чтобы проверить результат примененного эффекта: вы можете расширить его или свернуть его, активировать или деактивировать, перемещаться по его содержимому, устанавливать его размер, цвет фона или ограничить его снимком камеры. Область предварительного просмотра может быть расширена или сокращена нажатием на символ **+**/**-** слева от надписи **Просмотр образцов**, в левом нижнем углу окна настроек эффектов.

source: Parameters can be animated by setting keyframes at specific frames. A **Set Key** button (|key|) is available in the preview area, at the bottom bar of the window, to set keyframes for *all* of the parameters. For each of the parameters that can be animated there is also a specific **Set Key** button (|key|) to the right of the parameter name, in order to set keyframes for each parameter independently.
ru: Параметры могут быть анимированы путем установки ключевых кадров в определенных кадрах. Кнопка **Установить ключ** (|key|) доступна в области предварительного просмотра в нижней панели окна, чтобы установить ключевые кадры для *всех* параметров. Для каждого из параметров, которые можно анимировать, есть также специальная кнопка **Установить ключ** (|key|) справа от имени параметра, чтобы установить ключевые кадры для каждого параметра независимо.

source: The **Set Key** button (|key|) may have the following colors:
ru: Кнопка **Установить ключ** (|key|) может иметь следующие цвета:

source: It is **grey** when no keyframes for any parameter is defined at the current frame.
ru: **Cерый**, когда для текущего параметра не определены ключевые кадры для какого-либо параметра.

source: It is **blue-striped** when keyframes are defined at least for one parameter.
ru: **В синюю полосу**, когда ключевые кадры определены хотя бы для одного параметра.

source: It is **blue** when keyframes are defined for all the parameters.
ru: **Синий**, когда ключевые кадры определены для всех параметров.

source: The parameter specific **Set Key** button (|key|) may have the following colors:
ru: Кнопка конкретного параметра **Установить ключ** (|key|) может иметь следующие цвета:

source: It is **grey** if no key value is defined for the parameter at the current frame.
ru: **Серый**, если для параметра в текущем кадре не определено значение ключа.

source: It is **orange** when a key value is defined for the parameter at the current frame.
ru: **Оранжевый**, когда значение ключа определено для параметра в текущем кадре.

source: It is **pale yellow** if the parameter is animated but no key value is defined at the current frame.
ru: **Светло-желтый**, если параметр анимирован, но значение ключа в текущем кадре не определено.

source: It is **yellow** if you changed the parameter value and the current frame does not have a key for the parameter.
ru: **Желтый**, если вы изменили значение параметра, и у текущего кадра нет ключа для параметра.

source: Frames and keyframes can be navigated by using the related buttons in the bottom bar of the window. The **Next Key** (|next_key|) and **Previous Key** buttons (|prevkey|) are available only if more than one keyframe is defined.
ru: Кадры и ключевые кадры можно перемещать с помощью соответствующих кнопок в нижней панели окна. Кнопки **Следущий ключ** (|next_key|) и **Предыдущий ключ** (|prevkey|) доступны, только если определено более одного ключевого кадра.

source: If no keyframes are defined, parameters you set will be used throughout the scene.
ru: Если ключевые кадры не определены, установленные вами параметры будут использоваться по всей сцене.

source: **To open the FX Settings window:**
ru: **Чтобы открыть окно настроек эффектов:**

source: Right-click the effect node, and choose **Edit FX...** from the menu that opens.
ru: Щелкните правой кнопкой мыши узел эффекта и выберите **Редактировать ...** в открывшемся меню.

source: Double-click the effect node.
ru: Дважды щелкните узел эффекта.

source: **To define values for the effect:**
ru: **Чтобы определить значения для эффекта:**

source: Use the available sliders, check boxes, text fields, etc., to configure the effect the way you prefer.
ru: Используйте доступные ползунки, флажки, текстовые поля и т.д., чтобы настроить эффект так, как вы предпочитаете.

source: **To set the current frame:**
ru: **Чтобы установить текущий кадр:**

source: Type the frame number or use the **Next Frame** and **Previous Frame** buttons available in the bottom bar of the window.
ru: Введите номер кадра или используйте кнопки **Следующий кадр** и **Предыдущий кадр**, доступные в нижней панели окна.

source: Move the current frame cursor in the Xsheet/Timeline or in the Function Editor.
ru: Переместите курсор текущего кадра в Xsheet/Timeline или в редакторе функций.

source: Use the frame bar or the playback buttons in the bottom bar of the Viewer.
ru: Используйте панель кадров или кнопки воспроизведения в нижней панели просмотра.

source: **To set keyframes for all the effect parameters at the current frame:**
ru: **Чтобы установить ключевые кадры для всех параметров эффекта в текущем кадре:**

source: If the current frame is not a key, click the **Set Key** button (|key|) in the bottom bar of the window: it turns from *grey* to *blue* and current values become keyframes for all the parameters at the current frame.
ru: Если текущий кадр не является ключом, нажмите кнопку **Установить ключ** (|key|) в нижней панели окна: цвет изменится с *серого* на *синий* и текущие значения станут ключевыми кадрами для всех параметров в текущем кадре.

source: If the current frame is a keyframe for some parameters only, click the **Set Key** button (|key|): it turns from *blue-striped* to *blue* and current values become keyframes for all the parameters at the current frame.
ru: Если текущий кадр является ключевым кадром только для некоторых параметров, нажмите кнопку **Установить ключ** (|key|): цвет изменится с *полосатого* на *синий*, а текущие значения станут ключевыми кадрами для всех параметров текущего кадра.

source: Define the values for the parameters.
ru: Определите значения для параметров.

source: **To set keyframes for a specific parameter at the current frame:**
ru: **Чтобы установить ключевые кадры для определенного параметра в текущем кадре:**

source: If the current frame does not have a keyframe for the parameter, click the squared **Set Key** button (|key|) to the right of the parameter: it turns from *grey* to *orange*, and the current value becomes a keyframe for the parameter at the current frame.
ru: Если в текущем кадре нет ключевого кадра для параметра, нажмите квадратную кнопку **Установить ключ** (|key|) справа от параметра: цвет изменится с *серого* на *оранжевый*, и текущее значение становится ключевым кадром для параметра в текущем кадре.

source: Define the value for the parameter.
ru: Задайте значение для параметра.

source: If the current frame is not a keyframe for the parameter, and you changed it, the **Set Key** button (|key|) to the right of the parameter turns *yellow*. Click it to set the key.
ru: Если текущий кадр не является ключевым кадром для параметра, и вы изменили его, кнопка **Установить ключ** (|key|) справа от параметра становится *желтой*. Нажмите на нее, чтобы установить ключ.

source: **To remove all keyframes for the effect parameters at the current frame:**
ru: **Чтобы удалить все ключевые кадры для параметров эффекта в текущем кадре:**

source: If the keyframes are set for all the parameters, click the **Set Key** button (|key|) in the bottom bar of the window: it turns from *blue* to *grey*.
ru: Если ключевые кадры установлены для всех параметров, нажмите кнопку **Установить ключ** (|key| в нижней панели окна: цвет сменится с *синего* на *серый*.

source: If the keyframes are set for some parameters only, click twice the **Set Key** button (|key|) in the bottom bar of the window: with the first click it turns from *blue-striped* to *blue* (as you set keys for all the parameters); with the second click, it turns from *blue* to *grey*.
ru: Если ключевые кадры установлены только для некоторых параметров, дважды нажмите кнопку **Установить ключ** (|key|) в нижней панели окна: при первом щелчке она меняется с *в синюю полоску* на *синюю* (так как вы устанавливаете ключи для всех параметров); со вторым щелчком он превращается из *синего* в *серый*.

source: **To remove a keyframe for a specific parameter at the current frame:**
ru: **Чтобы удалить ключевой кадр для определенного параметра в текущем кадре:**

source: Click the **Set Key** button (|key|) to the right of the parameter: it turns from *grey* to *orange*.
ru: Нажмите кнопку **Установить ключ** (|key|) справа от параметра: цвет сменится с *серого* на *оранжевый*.

source: **To navigate frames where keyframes are defined:**
ru: **Для навигации по кадрам, в которых определены ключевые кадры:**

source: Use the **Next Key** (|next_key|) and **Previous Key** buttons (|prevkey|) available at the side of the **Set Key** button.
ru: Используйте кнопки **Следующий ключ** (|next_key|) и **Предыдущий ключ** (|prevkey|), расположенные по бокам от кнопки **Установить ключ Set Key**.

source: **To activate/deactivate the preview:**
ru: **Чтобы активировать/деактивировать предварительный просмотр:**

source: Do any of the following:
ru: Выполните любое из следующих действий:

source: Click the **Camera Preview** button (|camera|) in the bottom bar of the FX Settings window to limit the preview to the camera shot.
ru: Нажмите кнопку **Вид с камеры** (|camera|) в нижней панели окна настроек эффектов, чтобы ограничить предварительный просмотр видом с камеры.

source: Click the **Preview** button (|preview|) in the bottom bar of the FX Settings window to preview the results regardless of the camera shot.
ru: Нажмите кнопку **Предпросмотр** (|preview|) в нижней панели окна настроек эффектов, чтобы просмотреть результаты независимо от снимка камеры.

source: **To resize the preview area:**
ru: **Чтобы изменить размер области предварительного просмотра:**

source: Click and drag the horizontal separator.
ru: Нажмите и перетащите горизонтальный разделитель.

source: Click and drag the separator toward the window border to hide the preview area.
ru: Нажмите и перетащите разделитель к границе окна, чтобы скрыть область предварительного просмотра.

source: Click and drag the separator collapsed to the window border toward the window center to display again the preview area.
ru: Нажмите и перетащите разделитель, свернутый к границе окна, к центру окна, чтобы снова отобразить область предварительного просмотра.

source: The A/R of the preview area depends on the A/R of the current camera.
ru: Соотношения сторон области предварительного просмотра зависит от соотношений сторон текущей камеры.

source: **To change the background color of the preview area:**
ru: **Чтобы изменить цвет фона области предварительного просмотра:**

source: Use the buttons in the bottom bar of the FX Settings window to choose a **White** (|preview_white|), **Black** (|preview_black|) or **Transparent** (|preview_checkbox|) background.
ru: Используйте кнопки в нижней панели окна настроек эффектов, чтобы выбрать **Белый** (|preview_white|), **Черный** (|preview_black|) или **Клетчатый** (|preview_checkbox|) фон.

source: **To navigate the preview area:**
ru: **Для навигации по области предварительного просмотра:**

source: Use the Reset View shortcut (by default the **Alt + 0** key) to display preview at its actual size.
ru: Используйте сочетание клавиш Вид по умолчанию (по умолчанию клавиша **Alt + 0**) чтобы отобразить предварительный просмотр в его реальном размере.

source: Using Effects Gadgets
ru: Использование гаджетов эффектов

source: Some effects parameters related to positions or dimensions have some gadgets available in the Viewer in order to be set by using the camera box and the scene elements as a reference. For example the Radial Gradient effect has two circular gadgets that can be edited to set the inner size and the outer size of the gradient.
ru: Некоторые параметры эффектов, связанные с позициями или размерами, имеют некоторые гаджеты, доступные в окне просмотра, чтобы их можно было установить, используя поле камеры и элементы сцены в качестве ссылки. Например, эффект Radial Gradient имеет два круговых гаджета, которые можно редактировать, чтобы установить внутренний размер и внешний размер градиента.

source: As soon as an effect node is selected in the schematic, the **Animate** tool becomes the current tool and the related effect gadgets, if available, are shown. The Animate tool settings will refer to the column the effect is applied to, but in case the effect creates a computer generated image (e.g. a radial gradient or a light spot) the settings will refer to the effect column itself (see :ref:`Animating Objects <animating_objects>` ).
ru: Как только узел эффекта выбран на схеме, инструмент **Анимирования** становится текущим инструментом, и отображаются связанные гаджеты эффектов, если они доступны. Настройки инструмента Анимирования будут ссылаться на столбец, к которому применяется эффект, но в случае, если эффект создает изображение, сгенерированное компьютером (например, радиальный градиент или пятно света), настройки будут ссылаться на сам столбец эффекта (см. :ref:`Анимирование объектов <animating_objects>`).

source: **To visualize effects gadgets in the Viewer:**
ru: **Для визуализации гаджетов эффектов в окне просмотра:**

source: Select the effect node in the FX Schematic.
ru: Выберите узел эффекта в схеме эффектов.

source: **To edit effects gadgets:**
ru: **Для редактирования гаджетов эффектов:**

source: Click and drag the effects gadgets visible in the Viewer. As you roll over the gadget and the related handles, the cursor changes shape to indicate you are editing an effect gadget.
ru: Нажмите и перетащите гаджеты эффектов, видимые в средстве просмотра. При наведении курсора на гаджет и связанные с ним маркеры курсор меняет форму, указывая на то, что вы редактируете гаджет эффекта.
