Repository: WizzerWorks/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/applying_special_fx.po
Languages: ru

source: The amount of distortion is controlled by the Intensity value; the , by the Size of the displacement map grid. The Horizontal and Vertical Offset, and the Evolution stage of the displacement map image can be controlled as well; by setting the variation of these values between two keys, you can set how much the displacement map moves and changes during the animation.
ru: Количество искажений контролируется значением интенсивности (Intensity); размер сетки карты смещения - параметром Размер (Size) . Также можно управлять горизонтальным (Horizontal Offset) и вертикальным (Vertical Offset) смещением и стадией эволюции (Evolurion) изображения карты смещения; установив изменение этих значений между двумя ключами, вы можете установить, насколько карта смещения перемещается и изменяется во время анимации.

source: The Alpha option adds also a transparency displacement to fully-opaque images.
ru: Параметр Альфа (Alpha) также добавляет смещение прозрачности к полностью непрозрачным изображениям.

source: The horizontal and vertical offset can also be set by using a point gadget in the Viewer (see :ref:`Using FX Gadgets <using_fx_gadgets>` ).
ru: Горизонтальное и вертикальное смещение также можно установить с помощью точечного гаджета в окне просмотра (см. :ref:`Использование FX Gadgets <using_fx_gadgets>`).

source: Distorts the Source content creating a random wave effect that uses an automatically generated displacement map image. It can be used, for instance, to create a reflection on a water surface, or an underwater view.
ru: Искажает исходный контент, создавая эффект случайной волны, который использует автоматически сгенерированное изображение карты смещения. Его можно использовать, например, для создания отражения на поверхности воды или вида под водой.

source: The stage of the displacement map image can be controlled by using the Evolution value; by setting the variation of this value between two keys, you set how much the displacement map image changes during the animation.
ru: Этап изображения карты смещения можно контролировать с помощью значения Evolution; устанавливая изменение этого значения между двумя клавишами, вы устанавливаете, насколько изображение карты смещения изменяется во время анимации.

source: The position of the displacement map image can be shifted along the Horizontal and the Vertical axis. By setting the variation of this value between two keys, the distortion effect can be animated in any direction.
ru: Положение изображения карты смещения может быть смещено по горизонтальной X и вертикальной Y осям. Устанавливая изменение этого значения между двумя клавишами, эффект искажения можно анимировать в любом направлении.

source: The position along the horizontal and vertical axis can also be set by using a point gadget in the Viewer (see :ref:`Using FX Gadgets <using_fx_gadgets>` ).
ru: Положение вдоль горизонтальной и вертикальной оси также можно задать с помощью точечного гаджета в окне просмотра (см. :ref:`Использование FX Gadgets <using_fx_gadgets>`).

source: Distorts the Source content creating a circular wave effect that uses an automatically generated displacement map image. The Quantity value sets the number of ripples; the Period value sets the distance between ripples; the Cycle shifts the ripple distortion, with increasing values expanding the ripples, and decreasing values collapsing them.
ru: Искажает исходный контент, создавая эффект круговой волны, который использует автоматически сгенерированное изображение карты смещения. Значение Количество (Quantity) устанавливает количество пульсаций; значение Период (Period) устанавливает расстояние между пульсациями; Цикл (Cycle) смещает искажение пульсации, с увеличением значений, расширяющим пульсации, и уменьшением значений, сжимающих их.

source: The Center of the circular waves can be set with a Horizontal and Vertical value; circular waves can be scaled in the Horizontal and Vertical directions, and rotated according to a set Angle.
ru: Центр (Center) круговых волн может быть установлен с горизонтальным X и вертикальным Y значением; круговые волны можно масштабировать (Scale) в горизонтальном и вертикальном направлениях и поворачивать в соответствии с заданным углом (Angle).

source: The center and the period can be also set by using a point and a circle gadget with a handle in the Viewer (see :ref:`Using FX Gadgets <using_fx_gadgets>` ); the center can be set in the FX Settings preview as well.
ru: Центр и период также можно установить с помощью точечного и кругового гаджета с ручкой в ​​окне просмотра (см. :ref:`Использование FX Gadgets <using_fx_gadgets>`); центр также может быть установлен в предварительном просмотре настроек FX.

source: Distorts the Source content according to the brightness variation of the node content connected to the Warper input handle, that is used as a displacement map image affecting the Source content.
ru: Искажает содержимое источника в соответствии с изменением яркости содержимого узла, подключенного к дескриптору ввода Warper, которое используется в качестве изображения карты смещения, влияющего на содержимое источника.

source: The amount of distortion is controlled by the Intensity value; the detail of the warp, by the Size of the displacement map grid; the Sharpen option allows you to decrease the blur on the final result.
ru: Количество искажений контролируется значением интенсивности (Intensity); детали деформации по размеру (Size) сетки карты смещения; параметр Резкость (Sharpen) позволяет уменьшить размытость конечного результата.

source: Gradients
ru: Градиенты (Gradients)

source: Creates a new column/layer containing a gradient, that goes hyperbolically from the center to the four corners, defined by a color spectrum (see :ref:`Defining Colors and Color Spectrums <defining_colors_and_color_spectrums>` ) and a Size value.
ru: Создает новый столбец/слой, содержащий градиент, который проходит гиперболически от центра к четырем углам, определяемым цветовым спектром (см. :ref:`Определение цветов и цветовых спектров <defining_colors_and_color_spectrums>`) и значением размера (Size).

source: The size can also be set by using a circle gadget with a handle in the Viewer (see :ref:`Using FX Gadgets <using_fx_gadgets>` ).
ru: Размер также можно установить с помощью кругового гаджета с ручкой в ​​окне просмотра (см. :ref:`Использование FX Gadgets <using_fx_gadgets>`).

source: Creates a new column/layer containing a gradient defined by four Colors, defined by Red, Green, Blue and Alpha values, whose source Points can be placed where needed defining horizontal (X) and vertical (Y) coordinates.
ru: Создает новый столбец/слой, содержащий градиент, определяемый четырьмя цветами (Color), определяемыми значениями красного R, зеленого G, синего B и альфа-канала A, исходные точки которых можно размещать, где это необходимо, определяя горизонтальные (X) и вертикальные (Y) координаты.

source: The source points can also be set by using point gadgets in the Viewer (see :ref:`Using FX Gadgets <using_fx_gadgets>` ) and in the FX Settings preview as well.
ru: Исходные точки также можно установить с помощью точечных гаджетов в окне просмотра (см. :ref:`Использование FX Gadgets <using_fx_gadgets>`), а также в предварительном просмотре настроек FX.

source: Linear Gradient
ru: Линейный градиент (Linear Gradient)

source: Creates a new column/layer containing a gradual blend between two Colors defined by Red, Green, Blue and Alpha values. The Size controls the area of the gradient between the two colors.
ru: Создает новый столбец / слой, содержащий постепенное смешение двух цветов (Color), определяемых значениями красного (R), зеленого (G), синего (B) и альфа (A) каналов. Размер (Size) контролирует область градиента между двумя цветами.

source: You can also add a Distortion Wave on the linear gradient: the Amplitude sets the intensity of the distortion; the Frequency sets the number of waves creating the distortion; the Phase shifts the distorting waves.
ru: Вы также можете добавить Distortion Wave на линейный градиент: амплитуда (Amplitude) устанавливает интенсивность искажения; частота (Frequency) устанавливает количество волн, создающих искажение; фаза (Phase) сдвигает искажающие волны.

source: The size can also be set by using a gadget with two handles at the ends in the Viewer (see :ref:`Using FX Gadgets <using_fx_gadgets>` ).
ru: Размер также можно установить с помощью гаджета с двумя ручками на концах в окне просмотра (см. :ref:`Использование FX Gadgets <using_fx_gadgets>`).

source: Creates a new column/layer containing a multi linear gradient defined by a color spectrum (see :ref:`Defining Colors and Color Spectrums <defining_colors_and_color_spectrums>` ). The Period value sets the size of a spectrum gradient; the Quantity is the number of times the spectrum is repeated; the Phase shifts the gradient colors.
ru: Создает новый столбец/слой, содержащий мультилинейный градиент, определенный цветовым спектром (см. :ref:`Определение цветов и цветовых спектров <defining_colors_and_color_spectrums>`). Значение Period устанавливает размер градиента спектра; Количество (Quantity) - это количество повторений спектра; Фаза (Phase) сдвигает градиент цветов.

source: You can also add a Wave distortion on the multi linear gradient: the Amplitude sets the intensity of the distortion; the Frequency sets the number of waves creating the distortion; the Phase shifts the distorting waves.
ru: Вы также можете добавить Wave distortion к мультилинейному градиенту: амплитуда (Amplitude) устанавливает интенсивность искажения; частота (Frequency) устанавливает количество волн, создающих искажение; фаза (Phase) сдвигает искажающие волны.

source: The period can also be set by using a gadget with two handles at the ends in the Viewer (see :ref:`Using FX Gadgets <using_fx_gadgets>` )
ru: Период также можно установить с помощью гаджета с двумя ручками на концах в окне просмотра (см. :ref:`Использование FX Gadgets <using_fx_gadgets>`)

source: Creates a new column/layer containing a multi radial gradient defined by a color spectrum (see :ref:`Defining Colors and Color Spectrums <defining_colors_and_color_spectrums>` ). The Period value sets the size of a spectrum gradient; the Quantity is the number of times the spectrum is repeated; the Phase shifts the gradient colors.
ru: Создает новый столбец/слой, содержащий многорадиальный градиент, определенный цветовым спектром (см. :ref:`Определение цветов и цветовых спектров <defining_colors_and_color_spectrums>`). Значение Period устанавливает размер градиента спектра; Количество (Quantity) - это количество повторений спектра; Фаза (Phase) сдвигает градиент цветов.

source: The period can be also set by using a circle gadget with a handle in the Viewer (see :ref:`Using FX Gadgets <using_fx_gadgets>` ).
ru: Период также можно установить с помощью кругового гаджета с ручкой в ​​окне просмотра (см. :ref:`Использование FX Gadgets <using_fx_gadgets>`).

source: Radial Gradient
ru: Радиальный градиент (Radial Gradient)

source: Creates a new column/layer containing a gradual blend between two colors, defined by Red, Green, Blue and Alpha values, shading them in a circular pattern. The Inner Size controls the area where the gradient between the two colors begins; the Outer Size where it ends.
ru: Создает новый столбец/слой, содержащий постепенное смешение двух цветов (Color), определяемых значениями красного R, зеленого G, синего B и альфа-канала A, затеняя их по кругу. Inner Size контролирует область, где начинается градиент между двумя цветами; Outer Size, где это заканчивается.

source: The inner and outer sizes can be also set by using circle gadgets with a handle in the Viewer (see :ref:`Using FX Gadgets <using_fx_gadgets>` ).
ru: Inner size и outer size также можно установить с помощью круговых гаджетов с ручкой в ​​окне просмотра (см. :ref:`Использование FX Gadgets <using_fx_gadgets>`).

source: Spiral
ru: Спиральный градиент (Spiral)

source: Creates a new column/layer containing a spiral pattern gradient defined by a color spectrum (see :ref:`Defining Colors and Color Spectrums <defining_colors_and_color_spectrums>` ). The Frequency sets the size and number of the spires; the Phase shifts the gradient colors.
ru: Создает новый столбец/слой, содержащий градиент спиральной структуры, определенный цветовым спектром (см. :ref:`Определение цветов и цветовых спектров <defining_colors_and_color_spectrums>`). Частота (Frequency) устанавливает размер и количество витков; Фаза (Phase) сдвигает градиент цветов.

source: Creates a new column/layer containing a square gradient, that goes linearly from the center to the four corners, defined by a color spectrum (see :ref:`Defining Colors and Color Spectrums <defining_colors_and_color_spectrums>` ) and a Size value.
ru: Создает новый столбец/слой, содержащий квадратный градиент, который идет линейно от центра к четырем углам, определяемым цветовым спектром (см. :ref:`Определение цветов и цветовых спектров <defining_colors_and_color_spectrums>`) и значением размера (Size).

source: The size can also be set by using a rotated square gadget with handles in the Viewer (see :ref:`Using FX Gadgets <using_fx_gadgets>` ).
ru: Размер также можно установить с помощью повернутого квадратного гаджета с ручками в окне просмотра (см. :ref:`Использование FX Gadgets <using_fx_gadgets>`).

source: Adjusts the highlights and shadows of the Source content by remapping pixels intensity according to the Input and Output levels values for the RGB, Red, Green, Blue and Alpha channels; it also controls the Gamma value for each channel separately.
ru: Регулирует блики и тени содержимого источника путем переназначения интенсивности пикселей в соответствии со значениями уровней входного (Input) и выходного (Output) сигналов для каналов RGB, красный (Red), зеленый (Green), синий (Blue) и альфа (Alpha); он также контролирует значение гаммы для каждого канала отдельно.

source: For each channel the Input values remaps pixel intensity whose value is equal or lower than the Minimum value, to 0, and those whose value is equal or higher than the Maximum value, to 255. This may be helpful to increase the contrast of an image.
ru: Для каждого канала входные значения повторно отображают интенсивность пикселей, значение которой равно или ниже, чем Минимальное значение, до 0, а те, чье значение равно или превышает Максимальное значение, до 255. Это может быть полезно для повышения контрастности изображения.

source: For each channel the Output values remaps pixel intensity whose value is lower than the Minimum value, to the Minimum value, and those whose value is higher than the Maximum value, to the Maximum value. This may be helpful to decrease the contrast of an image.
ru: Для каждого канала выходные значения преобразуют интенсивность пикселей, значение которой меньше минимального значения, в минимальное значение, а значения, значение которых выше максимального значения, - в максимальное значение. Это может быть полезно для уменьшения контрастности изображения.

source: Brightness & Contrast
ru: Яркость и контраст (Brightness & Contrast)

source: Increases or decreases the brightness and contrast of the Source content.
ru: Увеличивает или уменьшает яркость (Brightness) и контрастность (Contrast) содержимого источника.

source: Swaps the channels of the Source content. For each channel you can set if it remains as it is, or if you want it to have another channel mixed. For example to leave the red channel as it is, Red to Red is 1, the other channels to Red are 0; by setting Green to Red to 0.5 adds half intensity of the green channel to the red one.
ru: Меняет местами каналы исходного контента. Для каждого канала вы можете установить, останется ли он как есть, или хотите, чтобы другой канал был смешанным. Например, чтобы оставить красный канал как есть, красный на красный равен 1, остальные каналы на красный равны 0; установив Green на Red на 0.5, вы добавите половину интенсивности зеленого канала к красному.

source: It can be used for example to create a black and white key for an image with the alpha channel, by setting all the values to 0 but the Alpha to Red, Green, Blue and Alpha to 1.
ru: Его можно использовать, например, для создания черно-белой клавиши для изображения с альфа-каналом, установив для всех значений значение 0, а для альфы - красный, зеленый, синий и альфа 1.

source: Adjusts the tonal range of the *Source* content by remapping pixels intensity according to a tonal curve for the RGB, Red, Green, Blue and Alpha channels.
ru: Регулирует тональный диапазон *источника*, переназначая интенсивность пикселей в соответствии с тональной кривой для каналов RGB, Red, Green, Blue и Alpha.

source: The horizontal axis of the graph represents the original brightness levels of the pixels (*Input* levels); the vertical axis represents the new brightness levels (*Output* levels).
ru: Горизонтальная ось графика представляет исходные уровни яркости пикселей (входной *Input* уровень); вертикальная ось представляет новые уровни яркости (выходной *Output* уровень).

source: The default diagonal line indicates that no pixels are mapped to new values, so all pixels have the same Input and Output values.
ru: Диагональная линия по умолчанию указывает, что ни один пиксель не сопоставлен с новыми значениями, поэтому все пиксели имеют одинаковые входные и выходные значения.

source: It is possible to use many adjustment points to correct the curve: to *add* a point, click the curve; to change the curvature, use the point tangent handles; to *delete* a point, select it and use the delete shortcut (by default the Delete key).
ru: Для корректировки кривой можно использовать множество точек регулировки: чтобы *добавить* точку, щелкните по кривой; чтобы изменить кривизну, используйте ручки касательной к точке; чтобы *удалить* точку, выберите ее и используйте сочетание клавиш удаления (по умолчанию клавиша Delete).

source: The **Linear** option constrains the curve to a series of straight segments.
ru: Параметр **Linear** ограничивает кривую серией прямых сегментов.

source: Elimantes small imperfections (dirt, scratches, stains and similar) of the drawing. The size in pixels of the details that will be retouched can be defined in the Size input text field. The background of the images can be Transparent or White, the choice is available in the Detect On menu.
ru: Устраняет мелкие дефекты (грязь, царапины, пятна и т.п.) рисунка. Размер в пикселях деталей, которые будут отретушированы, можно определить в текстовом поле ввода Размер (Size). Фон изображений может быть прозрачным или белым, выбор доступен в меню (Detect On).

source: In the preview area is possible to check the results to avoid erasing details relevant for the drawing.
ru: В области предварительного просмотра можно проверить результаты, чтобы избежать стирания деталей, относящихся к рисунку.

source: Gamma
ru: Гамма (Gamma)

source: Changes the gamma value of the Source content.
ru: Изменяет значение гаммы исходного контента.

source: Shifts the Hue, Saturation and Value values of the Source content. Hue ranges from -180 to 180; Saturation and Value from -100 to 100. All the three settings preserve their original value at 0.
ru: Изменяет значение тона (Hue), насыщенности (Saturation) и значения (Value) исходного контента. Тон меняется от -180 до 180; насыщенность и значение от -100 до 100. Все три параметра сохраняют свое первоначальное значение на 0.

source: Inverts the color values of the Source content, e.g. makes a positive black and white image negative, or a positive one from a scanned black and white negative.
ru: Инвертирует цветовые значения исходного контента, например, делает позитивное черно-белое изображение негативным или позитивное из отсканированного черно-белого негатива.

source: Applies to the Source content the colors defined by a color spectrum (see :ref:`Defining Colors and Color Spectrums <defining_colors_and_color_spectrums>` ) according to the image brightness. The original image is turned into black and white and the color on the far left of the spectrum will be use for black pixels, the color on the far right for white pixels, and in-between colors for in-between grey pixels.
ru: Применяет к исходному содержимому цвета, определенные цветовым спектром (см. :ref:`Определение цветов и цветовых спектров <defining_colors_and_color_spectrums>`) в соответствии с яркостью изображения. Исходное изображение превращается в черно-белое, и цвет в дальнем левом углу спектра будет использоваться для черных пикселей, цвет в крайнем правом углу для белых пикселей и промежуточные цвета для промежуточных серых пикселей.

source: Delimits the Minimum and the Maximum values of the Red, Green, Blue and Alpha components of the Source content. The maximum can be decreased from 255, the original value, to 0, when no red, green, blue or alpha component will be visible. The minimum can be increased from 0, the original value, to 255, when the red, green, blue components will be saturated, and alpha will be fully opaque.
ru: Разграничивает минимальные и максимальные значения красного (Red), зеленого (Green), синего (Blue) и альфа (Alpha) компонентов исходного содержимого. Максимум может быть уменьшен с 255 (исходное значение) до 0, когда красный, зеленый, синий или альфа-компонент не будут видны. Минимум может быть увеличен с 0, первоначальное значение, до 255, когда красный, зеленый, синий компоненты будут насыщены, а альфа будет полностью непрозрачным.

source: Fades the Source content toward a color defined by Red, Green and Blue values. The Intensity, expressed as a percentage, ranges from 0 (no fade) to 100 (fade to full color).
ru: Затухает содержимое источника до цвета, определяемого значениями красного (Red), зеленого (Green) и синего (Blue). Интенсивность (Intensity), выраженная в процентах, колеблется от 0 (без затухания) до 100 (от затухания до полного цвета).

source: Changes the percentage of the Red, Green, Blue and Alpha components of the Source content. At 0 there is no red, green, blue or alpha component; at 100 the components have their original value.
ru: Изменяет процентное содержание красного (Red), зеленого (Green), синего (Blue) и альфа (Alpha) компонентов исходного содержимого. На 0 нет красного, зеленого, синего или альфа-компонента; на 100 компоненты имеют свое первоначальное значение.

source: Sharpen
ru: Резкость (Sharpen)

source: Increases the sharpness of the Source content according to a specific Intensity.
ru: Увеличивает резкость (Sharpness) исходного контента в соответствии с определенной интенсивностью (Intensity).

source: Adds the red, green and blue values of the Up node content to the Down one, pixel by pixel.
ru: Добавляет красное, зеленое и синее значения содержимого узла Source1 к значению Source2, пиксель за пикселем.

source: If no Down node is defined, the adding operation is applied to all the images underlaying the Up node content according to the Xsheet/Timeline layering order.
ru: Если нисходящий узел не определен, операция добавления применяется ко всем изображениям, лежащим в основе содержимого восходящего узла, в соответствии с порядком слоев в Xsheet/Timeline.

source: The Intensity value expresses the percentage of values used in the addition; a negative value defines a subtraction instead of an addition.
ru: Интенсивность (Intensity) выражает процент значений, используемых в добавлении; отрицательное значение определяет вычитание вместо добавления.
