Repository: WizzerWorks/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/applying_special_fx.po
Languages: ru

source: Darkens the pixel colors of the Down node content in order to reflect the color of the Up node content. The white in the Up node content does not affect the result.
ru: Затемняет цвета пикселей содержимого ниже подключенного узла чтобы отразить цвет содержимого верхнего узла. Белый цвет в содержимом верхне подключенного узла не влияет на результат.

source: If no Down node is defined, the color burning operation is applied to all the images underlaying the Up node content according to the Xsheet/Timeline layering order.
ru: Если ниже подключенный узел не определен, операция затемнения цвета применяется ко всем изображениям, лежащим в основе содержимого выше подключенного узла в соответствии с порядком перекрытия слоев в Xsheet/Timeline.

source: Brightens the pixel colors of the Down node content in order to reflect the color of the Up node content. The black in the up node content does not affect the result.
ru: Увеличивает яркость цвета пикселов содержимого нижерасположенного узла чтобы отобразить цвет содержимого выше подключенного. Черный цвет в верхнем содержимом узла не влияет на результат.

source: If no Down node is defined, the color dodging operation is applied to all the images underlaying the Up node content according to the Xsheet/Timeline layering order.
ru: Если ниже подключенный узел не задан, операция осветления применяется ко всем изображениям, расположенным ниже содержимого выше подключенного узла в соответствии с порядком расположения слоев Xsheet/Timeline.

source: Creates a cross-dissolve between the Up and Down node content. When the Intensity value is 0, only the Down node content is visible; when it is 100, only the Up one.
ru: Создает перекрестное растворение между содержимым выше и ниже подключенных узлов. Когда значение Intensity (Интенсивность) равно 0, отображается только содержимое верхнего узла; когда это 100 только нижнего.

source: Compares the pixels color of the Up and Down node content and selects the darker one as the result color. The white in the Up node content does not affect the result; the black gives a black result.
ru: Сравнивает цвета пикселей содержимого подключенных узлов и выбирает более темный в качестве цвета результата. Белый цвет в содержимом выше подключенного узла не влияет на результат; черный дает черный результат.

source: If only one node is defined, the darkening operation is applied to all the images underlaying its content according to the Xsheet/Timeline layering order.
ru: Если определен только один узел, операция затемнения применяется ко всем изображениям, лежащим в основе его содержимого, в соответствии с порядком слоев Xsheet/Timeline.

source: Compares the pixels color of the Up and Down node content and selects the lighter one as the result color. The black in the Up node content does not affect the result; the white gives a white result.
ru: Сравнивает цвет пикселей содержимого подключенных узлов и выбирает более светлый в качестве цвета результата. Черный цвет в содержимом вышерасположенного узла не влияет на результат; белый дает белый результат.

source: If only one node is defined, the lightening operation is applied to all the images underlaying the connected node according to the Xsheet/Timeline layering order.
ru: Если подключен только один узел операция осветления применяется ко всем изображениям, лежащим в основе подключенного узла в соответствии с порядком наложения Xsheet/Timeline.

source: Applies a transparency to the Source content according to the brightness value of the node content connected to the Reference input port.
ru: Применяет прозрачность к содержимого источника (Source) в соответствии со значением яркости содержимого узла, подключенного к эталонному входному порту (Reference).

source: The Intensity value amplifies uniformly the transparency given by the Reference node content.
ru: Значение интенсивности (Intensity) равномерно усиливает прозрачность, данное содержание эталонного узла.

source: Multiplies the red, green, blue and alpha values of the connected noded content.
ru: Умножает красные, зеленые, синие и значения альфа-канала контента подключенного узла.

source: The Intensity value expresses the percentage of values used in the multiplication. By activating the Alpha option, also the alpha information is considered.
ru: Значение интенсивности (Intensity) выражает процент значений, используемых при умножении. При активации опции Alpha также учитывается информация о альфа-канале.

source: If only one node is defined, the multiplying operation is applied to all the images underlaying theupper node content according to the Xsheet/Timeline layering order.
ru: Если определен только один узел, операция умножения применяется ко всем изображениям, лежащим в основе содержимого верхнего узла в соответствии с порядком слоев Xsheet/Timeline.

source: Puts the connected nodes one over the other. Each time a node is connected a new port will be added, this way the overlap of columns can be defined regardless from the Xsheet columns (or Timeline layers) order. The contents order is up to bottom, where the node connected on the upper port will be over the other ones. This can be used when you need to combine several nodes in a single one, for example to mask several columns with the same mask.
ru: Размещает подключенные узлы один над другим. Каждый раз, когда подключается узел, добавляется новый порт, таким образом, перекрытие столбцов может быть определено независимо от порядка столбцов Xsheet (или слоев Timeline). Порядок содержимого сверху вниз, где узел, подключенный к верхнему порту, будет поверх остальных. Это можно использовать, когда вам нужно объединить несколько узлов в один, например, чтобы замаскировать несколько столбцов с одинаковой маской.

source: Premultiplies the alpha channel of the Source node content.
ru: Умножает альфа-канал содержимого узла источника.

source: Full-color images which have a meaningful alpha channel come in two types: premultiplied or not. A non-premultiplied image can be recognized when it is loaded in OpenToonz because its edge, where there is a complete transparence on one side and opacity on the other, is not smooth, but displays a solid halo. With the premultiply effect it is possible to transform the image alpha-channel so that it is correctly read by OpenToonz.
ru: Полноцветные изображения, которые имеют значимый альфа-канал, бывают двух типов: предварительно умноженные или нет. Не предварительно умноженное изображение может быть распознано, когда оно загружено в OpenToonz, потому что его край, где имеется полная прозрачность с одной стороны и непрозрачность с другой, не является гладким, но отображает сплошной ореол. С эффектом предварительного умножения можно преобразовать альфа-канал изображения, чтобы он был правильно прочитан OpenToonz.

source: Full-color images can also be premultiplied by using a Level Settings option, or processed permanently in the browser, so that there is no need to apply the effect in the schematic (see :ref:`Editing Level Settings <editing_level_settings>` and :ref:`Using the File Browser <using_the_file_browser>` ).
ru: Полноцветные изображения также можно умножить с помощью параметра Умножения в окне Уровень -> Параметры уровня или обработать в обозревателе на постоянной основе, так что нет необходимости применять эффект в схеме (см. :ref:`Редактирование настроек уровня <editing_level_settings>` и :ref:`Использование браузера файлов<using_the_file_browser>` ).

source: Combines by multiplying the inverse of the pixels color of the Up and Down node content, giving a result color that is lighter than both Up and Down node pixels, except when one of them equals 0. The black in the Up node content does not affect the result; the white gives a white result.
ru: Комбинируется путем умножения цвета, обратного пикселям, для содержимого узлов Source1 и Source2, в результате чего результирующий цвет светлее, чем пиксели узлов Source1 и Source2 за исключением случаев, когда один из них равен 0. Черный цвет в содержимом узла Source1 не влияет результат; белый дает белый результат.

source: If no Down node is defined, the screening operation is applied to all the images underlaying the Up node content according to the Xsheet/Timeline layering order.
ru: Если Source2 не задан, , операция экранирования применяется ко всем изображениям, лежащим в основе содержимого Source1, в соответствии с порядком наслоения Xsheet/Timeline.

source: Subtracts the red, green and blue values of the Up node content from the Down one, pixel by pixel. By activating the Alpha option, also the alpha information is considered.
ru: Вычитает значения красного, зеленого и синего каналов содержимого узла Source1 из значения Source2, пиксел за пикселoм. При активации опции Аlpha также учитывается информация о альфа-канале.

source: If only one node is defined, the subtraction operation is applied to all the images underlaying connected node content according to the Xsheet/Timeline layering order.
ru: Если подключен только один узел, операция вычитания применяется ко всем изображениям, лежащим в основе содержимого подключенного узла, в соответствии с порядком слоев Xsheet/Timeline.

source: Sets the transparency of the Source content. The Intensity, expressed as a percentage, ranges from 0, fully opaque, to 100, fully transparent.
ru: Устанавливает прозрачность исходного контента. Интенсивность прозрачности (Intensity), выраженная в процентах, варьируется от 0, полностью непрозрачная, до 100, полностью прозрачная.

source: Light
ru: Light (Свет)

source: Creates a backlit effect, using the Light node content as a light source affecting the Source node content by the set Intensity. The light node content can be also faded to a Color defined by Red, Green and Blue values, according to the set Fade.
ru: Создает эффект подсветки, используя содержимое узла Light в качестве источника света, влияющего на содержимое узла Source с помощью установленной интенсивности (Intensity). Содержимое узла Light также может быть затенено до цвета, определяемого значениями каналов красного Red, зеленого Green и синего Blue, в соответствии с установленным затуханием Fade.

source: Creates a highlighted area for the Source node content, according to its alpha channel. You can set the Color of the highlight, as well as a Transparency and a Blur value to be applied.
ru: Создает выделенную область для содержимого узла Source в соответствии с его альфа-каналом. Вы можете установить цвет подсветки Color, а также значения прозрачности Transparensy и размытия Blur, которые будут применяться.

source: The shifting of the highlighted area is defined by horizontal (X) and vertical (Y) Offset values, that can also be interactively set in the preview of the FX Settings window, where the offset center is displayed with a cross.
ru: Смещение выделенной области определяется значениями смещения по горизонтали (X) и по вертикали (Y), которые также можно установить в интерактивном режиме в окне предварительного просмотра окна настроек эффектов, где центр смещения отображается с крестиком.

source: Enabling the Invert option the effected areas will be toggled.
ru: Включив опцию Invert, затронутые области будут переключаться.

source: The effect can be used to create a body shadow as well, by defining a black color for the highlight.
ru: Эффект также можно использовать для создания тени тела, определив черный цвет для подсветки.

source: Cast Shadow
ru: Превращает исходный контент в тень, которая может быть искажена и затемнена до цвета с переменной прозрачностью и размытостью.

source: Turns the Source content into a shadow that can be distorted and faded to a color with a variable transparency and blur.
ru: Превращает исходный контент узла Source в тень, которая может быть искажена и затемнена до цвета с переменной прозрачностью и размытостью.

source: The distortion can be done like in the Free Distort effect (see :ref:`Free Distort <free_distort>` ). The fade Color can be defined by Red, Green and Blue values and a Fade intensity can be set. A different Blur and Transparency value can be set for the top and the bottom part of the Source content, in order to have a more realistic shadow.
ru: Искажение (Distortion) может быть сделано как в эффекте Free Distort (см. :ref:`Free Distort <free_distort>`). Цвет затухания может быть определен значениями красного Red, зеленого Green и синего Blue каналов, а также может быть установлена ​​интенсивность затухания Fade. Для более реалистичной тени можно установить другое значение размытия Blur и прозрачности Transparency для верхней и нижней части исходного содержимого.

source: Creates a glowing effect, using the Light node content as a light glowing on the node content connected to the Source input port. The Blur and Brightness of the glowing can be set; the Light node content can be also faded to a color defined by Red, Green and Blue values, according to the set Intensity.
ru: Создает эффект свечения, используя содержимое узла Light в качестве источника света, который светится на содержимом узла Source, подключенного к входному порту Source. Размытие Blur и Яркость Brightness светящегося можно настроить; содержимое узла Light также может быть затемнено до цвета, определенного значениями красного Red, зеленого Green и синего Blue каналов, в соответствии с установленной интенсивностью Intensity.

source: If no Source node is defined, the glowing is applied to all the images underlaying the Light node content according to the Xsheet/Timeline layering order.
ru: Если узел источника не определен, свечение применяется ко всем изображениям, лежащим в основе содержимого узла Light, в соответствии с порядком слоев Xsheet/Timeline.

source: Creates a new column/layer containing a light spot whose size and color can be set respectively with the Width and Height values, and the Reg, Green, Blue and Alpha values. The Softness sets the light diffusion in the area outside the spot.
ru: Создает новый столбец/слой, содержащий световое пятно, размер и цвет которого можно установить соответственно с помощью значений ширины и высоты, а также значений красного Red, зеленого Green, синего Blue и альфа Alpha каналов. Softness устанавливает рассеивание света в области за пределами пятна.

source: The width and height can be also set by using a box gadget with handles in the Viewer (see :ref:`Using FX Gadgets <using_fx_gadgets>` ).
ru: Ширина и высота также могут быть заданы с помощью гаджета-бокса с ручками в окне просмотра (see :ref:`Использование гаджетов эффектов <using_fx_gadgets>` ).

source: Places a source of light behind the Source node content, casting rays of light outside or inside the image outline.
ru: Размещает источник света за содержимым узла Source, отбрасывая лучи света снаружи или внутри контура изображения.

source: The light source position is defined by horizontal (X) and vertical (Y) coordinates. By changing the light source position you change the way rays are cast along the image outline; by changing the Distance value you can make the light source approach to or go away from the image.
ru: Положение источника света определяется горизонтальными (X) и вертикальными (Y) координатами. Изменяя положение источника света, вы изменяете способ направления лучей вдоль контура изображения; изменяя значение расстояния, вы можете сделать так, чтобы источник света приближался или удалялся от изображения.

source: Properties of the light can be set by defining the Intensity, the Color, that is set by Red, Green, Blue and Alpha values, the Decay, that is the decrease of the light intensity according to its distance from the image, and the Smoothness, that determines how sharp the rays are along the image outline.
ru: Свойства света могут быть установлены путем определения интенсивности Intensity, цвета Color, который устанавливается значениями красного Red, зеленого Green, синего Blue и альфа Alpha каналов, затухания Decay, то есть уменьшения интенсивности света в зависимости от его расстояния от изображения, и гладкости Smoothness, который определяет, насколько четкими являются лучи вдоль контура изображения.

source: The Invert option switches the casting of rays of light from the outside of the image to the inside.
ru: Опция Invert переключает излучение световых лучей с внешней стороны изображения на внутреннюю.

source: The Keep Image check-box determines if the original drawing is rendered in the output or not.
ru: Флажок Keep image определяет, отображается ли исходный рисунок на выходе или нет.

source: The center can be also set by using a point gadget in the Viewer (see :ref:`Using FX Gadgets <using_fx_gadgets>` ) and in the FX Settings preview.
ru: Центр также можно установить с помощью точечного гаджета в окне просмотра (см. :ref:`Использование гаджетов эффектов <using_fx_gadgets>`) и в предварительном просмотре настроек эффектов.

source: The Source node content needs to have a significant alpha channel in order to have an effective result.
ru: Содержимое узла Source должно иметь значительный альфа-канал, чтобы иметь эффективный результат.

source: Places a source of light behind the Source node content, casting rays of light outside the image outline.
ru: Размещает источник света за содержимым узла Source, отбрасывая лучи света за пределы контура изображения.

source: The colours of the rays are calculated from the original drawing colours.
ru: Цвета лучей рассчитываются по оригинальным цветам рисунка.

source: Properties of the light can be set by defining the Intensity, the Decay, that is the decrease of the light intensity according to its distance from the image, and the Smoothness, that determines how sharp the rays are along the image outline.
ru: Свойства света можно установить, задав интенсивность Intensity, затухание Decay, то есть уменьшение интенсивности света в соответствии с его расстоянием от изображения, и плавность Smoothness, которая определяет, насколько резкими будут лучи по контуру изображения.

source: Creates a new column/layer containing a light spot whose size and color can be set respectively with the Width and Height values, and the Red, Green, Blue and Alpha values. The direction of the spot can be set by defining the Distance of the light from the table and the Angle between the light spot direction and the table. The Decay, that is the decrease of the light intensity according to the distance from table, can be controlled as well.
ru: Создает новый столбец / слой, содержащий световое пятно, размер и цвет которого можно установить соответственно с помощью значений ширины и высоты, а также значений красного, зеленого, синего и альфа-канала. Направление пятна может быть установлено путем определения расстояния света от стола и угла между направлением пятна света и столом. Распад, то есть уменьшение интенсивности света в соответствии с расстоянием от стола, также можно контролировать.

source: Morphologically erodes or dilates the alpha channel of the connected node by the specified value, where positive values correspond to dilations and negative ones to erosion.
ru: Морфологически размывает или расширяет альфа-канал подключенного узла на указанное значение, где положительные значения соответствуют расширениям, а отрицательные - эрозии.

source: The Type parameter defines the shape of the corners of the frame, applied around the image, when the Radius value is positive.
ru: Параметр Type определяет форму углов рамки, применяемых вокруг изображения, когда значение радиуса Radius положительное.

source: Defines a chroma key for the Source content using the set Hue, Saturation and Value values. You can set the range for each value by using the related Range slider. The selection can be inverted using the Invert button.
ru: Определяет хромакей содержимого Source с использованием установленных значений Hue, Saturation и Value. Вы можете установить диапазон для каждого значения с помощью соответствующего ползунка Range. Выбор можно инвертировать с помощью кнопки Invert.

source: Makes the Source content visible only inside the opaque areas of the node content connected to the Matte input port.
ru: Делает контент узла Source видимым только внутри непрозрачных областей содержимого узла, подключенного к входному порту Matte.

source: Makes the source content visible only outside the opaque areas of the node content connected to the Matte input port.
ru: Делает контент узла Source видимым только за пределами непрозрачных областей содержимого узла, подключенного к входному порту Matte.

source: Defines a chroma key for the Source content using the set Red, Green and Blue values. You can set the range for each value by using the related Range slider. The selection can be inverted using the Invert button.
ru: Определяет хромакей для содержимого узла Source с использованием установленных значений красного R, зеленого G и синего B цветов. Вы можете установить диапазон для каждого значения с помощью соответствующего ползунка Range. Выделение можно инвертировать с помощью кнопки Invert.

source: Makes the Up node content visible only inside the opaque areas of the node content connected to the Down input port, keeping the Down node still visible.
ru: Делает содержимое узла Up видимым только внутри непрозрачных областей содержимого узла, подключенного к входному порту Down, оставляя узел Down все еще видимым.

source: Noise
ru: Шум (Noise)

source: Eliminates randomly pixels from the Source content according to the set Intensity.
ru: Устраняет случайным образом пикселы из контента узла Source в соответствии с установленной интенсивностью Intensity.

source: Adds a noise effect to the Source content according to the set Intensity. You can decide which noise component among Red, Green and Blue you want to activate, and if the result has to be in Black and White.
ru: Добавляет эффект шума к содержимому узла Source в соответствии с установленной интенсивностью Intensity. Вы можете решить, какой компонент шума из красного Red, зеленого Green и синего Blue вы хотите активировать, и если результат должен быть черно-белым (Black & White).

source: Adds a black and white noise effect to the Source content according to the set Intensity.
ru: Добавляет эффект черно-белого шума к содержимому узла Source в соответствии с установленной интенсивностью Intensity.

source: Creates a new column/layer containing a fractal image whose type can be chosen between Clouds and Marble/Wood. The Size affect the grid used for generating the fractal image; a color spectrum defines the used colors (see :ref:`Defining Colors and Color Spectrums <defining_colors_and_color_spectrums>` ).
ru: Создает новый столбец/слой, содержащий фрактальное изображение, тип которого можно выбрать между Clouds (Облака) и Marble (Мрамор)/Wood(Дерево). Размер влияет на сетку, используемую для генерации фрактального изображения; цветовой спектр определяет используемые цвета (см. :ref:`Определение цветов и цветовых спектров <defining_colors_and_color_spectrums>`).

source: Increasing the Minimum value shifts the color spectrum to the right, and consequently more pixels will be colored as the color defined at the far left of the spectrum. Decreasing the Maximum value shifts the color spectrum to the left, and consequently more pixels will be colored as the color defined at the far right of the spectrum.
ru: При увеличении минимального значения цветовой спектр сдвигается вправо, и, следовательно, большее количество пикселей будет окрашено в цвет, определенный в дальнем левом углу спектра. При уменьшении максимального значения цветовой спектр сдвигается влево, и, следовательно, большее количество пикселей будет окрашено в цвет, определенный в дальнем правом углу спектра.
