Repository: WizzerWorks/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/applying_special_fx.po
Languages: ru

source: A range of colors can be defined setting the RGBA values of color 1 and color 2. The stage of the displacement map image can be controlled by using the Evolution value; by setting the variation of this value between two keys, you set how much the displacement map image changes during the animation.
ru: Диапазон цветов может быть определен установкой значений RGBA для цветов Color 1 и Color 2. Стадия изображения карты смещения может контролироваться с помощью значения Evolution; устанавливая вариацию этого значения между двумя ключами, вы устанавливаете, как во время анимации изображение карты смещения меняется.

source: Adds cross-shaped light rays extending from the brightest part of an image.
ru: Добавляет крестообразные световые лучи, выходящие из самой яркой части изображения.

source: Use Threshold to specify the cut-out on the input image's brightest part. Higher values will make the fx add lights also to darker image parts, producing more lights. The Brightness specifies the brightness of added light rays; the Radius specify how much the light rays will extend from bright input pixels; the Angle specify the angle of light crosses. A value 0 means that produced light crosses will be axis-aligned. Halo is the amount of light disperion orthogonal to the direction of light rays. Higher values will produce broader rays.
ru: Используйте Threshold (порог), чтобы указать вырез в самой яркой части входного изображения. Более высокие значения заставят эффект добавлять свет также к более темным частям изображения, производя больше света. Brightness указывает яркость добавленных световых лучей; Radius указывает, сколько световые лучи будут выходить из ярких входных пикселей; Angle указывает угол пересечения света. Значение 0 означает, что создаваемые световые кресты будут выровнены по оси. Halo - это количество световой дисперсии, перпендикулярной направлению световых лучей. Более высокие значения будут производить более широкие лучи.

source: Creates a new column/layer containing a simple star field with variable brightness with overlayed clouds. Sets the color of the overlayed clouds defining the RGBA values of the Cloud Color parameter.
ru: Создает новый столбец/слой, содержащий простое звездное небо с регулируемой яркостью Brightness с наложенными облаками. Можно установить цвет наложенных облаков Cloud Color задав значения RGBA.

source: The stage of the stars displacement can be controlled by using the Evolution value; by setting the variation of this value between two keys, you set how much the displacement map image changes during the animation.
ru: Стадию движения звезд можно контролировать с помощью значения Evolution; задав изменение этого значения между двумя ключевыми кадрами, вы устанавливаете, насколько изображение карты смещения изменяется во время анимации.

source: Use the Brightness parameters to define the brightness of the stars.
ru: Используйте параметр Brightness, чтобы регулировать яркость звезд.

source: Creates a new column/layer containing rays of colored light extending from a radial gradient at the center. Sets the color of the sun rays defining the RGBA values of the Color parameter. The number of rays is defined by the Rays parameter while their brightness is set by the Intensity one. The angle parameter sets the direction of the rays and the Bias parameter define the size of the rays. Use the Sharpness parameter to make the rays sharper or smoother.
ru: Создает новый столбец/слой, содержащий лучи цветного света, выходящие из радиального градиента в центре. Устанавливает цвет солнечных лучей, определяемых значениями RGBA параметра Color. Количество лучей определяется параметром Rays, а их яркость задается параметром Intensity. Параметр Angle отвечает за направление лучей, а параметр Bias определяет размер лучей. Параметр Sharpness позволяет сделать лучи более резкими или плавными.

source: Creates a new column/layer containing a simple gradient with a colored 'wavy' pattern. The waves colors are definied by setting the RGBA values of the Color 1 and Color 2 parameters. The stage of the displacement map image can be controlled by using the Evolution value; by setting the variation of this value between two keys, you set how much the displacement map image changes during the animation.
ru: Создает новый столбец/слой, содержащий простой градиент с цветным «волнистым» узором. Цвет волн определяется путем установки значений RGBA для параметров Color 1 и Color 2. Стадия изображения карты смещения может контролироваться с помощью используя значение Evolution; устанавливая вариацию этого значения между двумя ключами, вы устанавливаете, насколько изображение карты смещения изменяется во время анимации.

source: Blurs along radial lines whose origin is the set Center, defined by horizontal (X) and vertical (Y) coordinates, starting from an unaffected inner area defined by the Safe Radius. The Blur Factor parameter sets the amount of blur.
ru: Размытие по радиальным линиям, начало которых находится в центре, определяемом горизонтальными (X) и вертикальными (Y) координатами, начиная с незатронутой внутренней области, определенной безопасным радиусом Safe Radius. Параметр Blur Factor устанавливает степень размытия.

source: Blurs along concentric circular lines as if the Source content turns around the set Center, defined by horizontal (X) and vertical (Y) coordinates, starting from an unaffected inner area defined by the Safe Radius. The Blur parameter sets the amount of blur.
ru: Размывает по концентрическим круговым линиям, как если бы исходный контент вращался вокруг установленного центра, определяемого горизонтальными (X) и вертикальными (Y) координатами, начиная с незатронутой внутренней области, определенной безопасным радиусом Safe Radius. Параметр Blur устанавливает степень размытия.
