Repository: WizzerWorks/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/applying_special_fx.po
Languages: ru

source: Applying Effects
ru: Применение эффектов

source: Effects can be applied to animation levels, images and clips exposed in Xsheet columns (or Timeline layers) in the **FX Schematic**, where each element is represented as a node.
ru: Эффекты можно применять к уровням анимации, изображениям и клипам, отображаемым в столбцах Xsheet (или слоях Timeline) в **FX Schematic**, где каждый элемент представлен в виде узла.

source: The relationship between the contents of columns/layers and effects can be managed by connecting or disconnecting links between nodes.
ru: Связь между содержимым столбцов/слоев и эффектами может управляться путем соединения или разъединения связей между узлами.

source: Using the FX Schematic
ru: Использование FX Schematic

source: In the FX schematic all columns/layers are displayed as nodes having an output port connected to the Xsheet node: this means that their content is part of the scene and is rendered as it is.
ru: В FX Schematic все столбцы/слои отображаются как узлы, имеющие выходной порт, подключенный к узлу Xsheet: это означает, что их содержимое является частью сцены и отображается как есть.

source: When effects are added, they are displayed as nodes as well, with ports to create links that let you set the way the effect modify the scene contents.
ru: Когда эффекты добавляются, они также отображаются как узлы с портами для создания ссылок, которые позволяют вам задавать способ изменения содержимого сцены.

source: Column/layer nodes have the **Camera Stand** (|camera_stand|) and the **Render** (|preview|) toggles on the top right: these toggles are the same as the toggles available in the Xsheet column (or Timeline layer) headers (see :ref:`Working with Xsheet Columns <working_with_xsheet_columns>` ). Effects nodes only have the **Render** toggle (|preview|) allowing you to include or exclude temporarily the effect in the rendering.
ru: Узлы столбца/слоя имеют переключатели **Переключатель видимости камеры** (|camera_stand|) и **Переключение видимости** (|preview|) в правом верхнем углу: эти переключатели совпадают с переключателями, доступными в столбце Xsheet (или заголовке слоя Timeline) (см. :ref:`Работа со столбцами Xsheet <working_with_xsheet_columns>`). Узлы эффектов имеют только переключатель **Видимости** (|preview|), позволяющий вам включать или временно исключать эффект при рендере.

source: Nodes can be easily selected and arranged. When selected, nodes are highlighted in *white*; the *current* node has its label in *yellow*.
ru: Узлы могут быть легко выбраны и расположены. Когда выделены, узлы подсвечиваются *белым* цветом; *текущий* узел имеет свое название в *желтом*.

source: **To access the FX Schematic:**
ru: **Для доступа к FX Схеме:**

source: Click the Schematic toggle button (|schematic|) at the right of the bottom bar of the Schematic window until the title bar displays **FX Schematic**.
ru: Нажимайте кнопку Переключения Схемы Fx (|schematic|) в правой части нижней панели окна Stage Schematic, пока в строке заголовка не отобразится **FX Schematic**.

source: **To navigate the FX Schematic:**
ru: **Для навигации по FX Schematic:**

source: Do one of the following:
ru: Выполните одно из следующих действий:

source: Use the mouse wheel, or the zoom shortcut keys (by default **+** and **-** keys) to zoom in and zoom out.
ru: Используйте колесико мыши или сочетания клавиш увеличения (по умолчанию клавиши **+** и **-**) для увеличения или уменьшения масштаба.

source: Middle-click and drag to scroll in any direction.
ru: Нажмите среднюю кнопку мыши и перетащите, чтобы прокрутить в любом направлении.

source: Use the **Fit to Window** button (|fit_to_window|) in the bottom bar of the Schematic window to display all of the nodes in the current window.
ru: Используйте кнопку **По размеру окна** (|fit_to_window|) в нижней панели окна Schematic, чтобы отобразить все узлы в текущем окне.

source: Use the **Focus on Current** button (|focus_on_current|) in the bottom bar of the Schematic window to center the Schematic on the current node.
ru: Используйте кнопку **Фокус на текущем** (|focus_on_current|) в нижней панели окна схемы, чтобы центрировать схему на текущем узле.

source: Use the **Reorder Nodes** button (|reorder_nodes|) in the bottom bar of the Schematic window to reorder all the nodes.
ru: Используйте кнопку **Изменение порядка узлов** (|reorder_nodes|) в нижней панели окна Schematic, чтобы изменить порядок всех узлов.

source: Use the **Reset Size** button (|reset|) in the bottom bar of the Schematic window, or use the **Reset View** shortcut (by default the **Alt + 0** key) to display all of the nodes at the default size.
ru: Используйте кнопку **Сбросить размер** (|reset|) в нижней панели окна Schematic или используйте комбинацию **Вид по умолчанию** (по умолчанию клавиши **Alt + 0**), чтобы отобразить все узлы в размере по умолчанию.

source: **To rename a node:**
ru: **Чтобы переименовать узел:**

source: Ctrl + double-click the node name and type a new name.
ru: Дважды кликните по имени узла с нажатой клавишей Ctrl и введите новое имя.

source: **To minimize or maximize the column/layer and effect nodes:**
ru: **Чтобы минимизировать или развернуть столбец/слой и узлы эффектов:**

source: Click the arrowhead to the left of the node name to minimize/maximize columns selectively.
ru: Нажмите стрелку слева от имени узла, чтобы выборочно свернуть/развернуть столбцы.

source: Click the **Minimize/Maximize** (|minimize|/|maximize|) button in the bottom bar of the Schematic window to minimize/maximize all the column nodes.
ru: Нажмите кнопку **Минимизировать/Максимизировать** узлы (|minimize|/|maximize|) в нижней панели окна Schematic, чтобы свернуть/развернуть все узлы столбцов.

source: **To select nodes:**
ru: **Чтобы выделить узлы:**

source: Click to select a node.
ru: Нажмите, чтобы выделить узел.

source: Click and drag to select a group of nodes.
ru: Нажмите и перетащите, чтобы выбрать группу узлов.

source: Ctrl-click (PC) or Cmd-click (macOS) to add a node to, or remove it from the selection.
ru: Кликните по узлу с нажатой клавишей Ctrl (PC) или Cmd (macOS), чтобы добавить узел или удалить его из выделения.

source: *Links* can be selected together with nodes (see :ref:`Editing the FX Schematic <editing_the_fx_schematic>` ).
ru: *Links* могут быть выбраны вместе с узлами (см. :ref:`Редактирование схемы FX <editing_the_fx_schematic>`).

source: **To move the selection:**
ru: **Чтобы переместить выделение:**

source: Click and drag any node of the selection.
ru: Нажмите и перетащите любой выделенный узел.

source: **To include or exclude temporally an effect from the rendering:**
ru: **Чтобы включить или временно исключить эффект из рендера:**

source: Click the **Render** toggle (|preview|) on the upper right corner of the effect node.
ru: Нажмите на переключатель **Видимости** (|preview|) в правом верхнем углу узла эффекта.

source: Grouping Nodes
ru: Группировка узлов

source: It's possible to group several nodes into one single node, in order to better manage the whole FX Schematic. Groups can be opened to be examined and edited, and its components can be selected for further operations, like editing effect settings, or creating new groups.
ru: Можно сгруппировать несколько узлов в один узел, чтобы лучше управлять всей схемой FX. Группы можно открывать для просмотра и редактирования, а их компоненты можно выбирать для дальнейших операций, таких как редактирование настроек эффектов или создание новых групп.

source: **To Group selected nodes:**
ru: **Для группировки выделенных узлов:**

source: Right-click any selected node and choose **Group** from the menu that opens.
ru: Щелкните правой кнопкой мыши любой выбранный узел и выберите **Сгруппировать** в открывшемся меню.

source: Press the **Ctrl-G** (PC) or **Cmd-G** (macOS) shortcut.
ru: Нажмите сочетание клавиш **Ctrl-G** (PC) или **Cmd-G** (macOS).

source: **To open a Group:**
ru: **Чтобы открыть группу:**

source: Right-click the group and choose **Open Group** from the menu that opens: the group nodes are displayed in a box, showing links between group nodes, and links with nodes outside of the group.
ru: Щелкните правой кнопкой мыши группу и выберите **Открыть группу** в открывшемся меню: узлы группы отображаются в окне, показывая ссылки между узлами группы и ссылки с узлами вне группы.

source: In the FX Schematic, when the content of a group is displayed, it's possible to edit the links between Group nodes and links with nodes outside of the group.
ru: В FX схеме, когда отображается содержимое группы, можно редактировать ссылки между узлами группы и ссылки с узлами вне группы.

source: **To close a Group:**
ru: **Чтобы закрыть группу:**

source: Click the **Close** button on the right of the group box title bar.
ru: Нажмите кнопку **Закрыть** справа от строки заголовка группы.

source: **To release a Group:**
ru: **Чтобы разгруппировать группу:**

source: Right-click the Group and choose **Ungroup** from the menu that opens, or press the shortcut **Ctrl-Shift-G** (PC) or **Cmd-Shift-G** (macOS).
ru: Щелкните правой кнопкой мыши группу и выберите **Разгруппировать** в открывшемся меню или нажмите сочетание клавиш **Ctrl-Shift-G** (PC) или **Cmd-Shift-G** (macOS).

source: Inserting Effects
ru: Добавление эффектов

source: You can **Insert** effects to selected nodes, **Add** effects to the Schematic, or **Replace** previously added effect nodes. This can be done from the **FX Browser** window or by using the drop-down menu that opens when right-clicking nodes or an empty area of the FX Schematic. Both are organized in folders/submenus containing sets of effects; if some *Presets* are defined for an effect, an additional folder/submenu is available (see :ref:`Creating Presets <creating_presets>` ).
ru: Вы можете **Вставить** эффекты к выбранным узлам, **Добавить** эффекты к Схеме или **Заменить** ранее добавленные узлы эффектов. Это можно сделать из окна **Браузер FX** или с помощью раскрывающегося меню, которое открывается при щелчке правой кнопкой мыши по узлам или в пустой области схемы эффектов. Оба организованы в папки/подменю, содержащие наборы эффектов; если для эффекта определены некоторые *Предустановки*, доступна дополнительная папка/подменю (см. :ref:`Создание предустановок <creating_presets>`).

source: When *inserting* effects, they will be placed along the link that starts from the selected node output port; when *adding* effects, they will be placed at the end of a new link that will start from the selected node output port.
ru: При *вставке* эффектов они будут размещены вдоль ссылки, которая начинается с выходного порта выбранного узла; при *добавлении* эффектов они будут помещены в конец новой ссылки, которая будет начинаться с выходного порта выбранного узла.

source: In case several nodes are selected, the effect will be added/inserted for *each* selected node, but all the added/inserted effects will be *Linked*, and connected visually by a *green* line. This means that every time the effect is edited, all the linked nodes will be edited as well, unless you break the link to start editing them separately.
ru: Если выбрано несколько узлов, эффект будет добавлен/вставлен для *каждого* выбранного узла, но все добавленные/вставленные эффекты будут *Связаны* и связаны визуально *зеленой* линией. Это означает, что каждый раз, когда редактируется эффект, также будут редактироваться все связанные узлы, если только вы не разорвете ссылку, чтобы начать редактировать их отдельно.

source: To globally apply effects it's possible to use the **Xsheet** node as if it were a standard column node (representing the whole content of the scene) and inserting effects from there.
ru: Для глобального применения эффектов можно использовать узел **Xsheet**, как если бы это был стандартный узел столбца (представляющий все содержимое сцены), и вставлять эффекты оттуда.

source: Three different types of effects can be used in the Schematic, each with a different type of node:
ru: В схеме могут использоваться три различных типа эффектов, каждый с различным типом узла:

source: **Basic effects**, such as the Blur effect, that simply modify the contents of a column; they are displayed as a yellow node with an input port on the left, labelled *Source*, and an output port on the right.
ru: **Основные эффекты**, такие как эффект размытия, которые просто изменяют содержимое столбца; они отображаются в виде желтого узла с портом ввода слева, помеченным *Source*, и портом вывода справа.

source: To affect a column/layer, they have to be inserted in the link from the column/layer node to the Xsheet node, so that the column/layer node is connected to the effect input port, and the effect node output port is connected to the Xsheet node.
ru: Чтобы повлиять на столбец/слой, их необходимо вставить в ссылку от узла столбца/слоя к узлу Xsheet, чтобы узел столбца/слоя был подключен к входному порту эффекта, а выходной порт узла эффекта - к узлу Xsheet.

source: If several effects are applied in a chain, they will be applied one after the other, following the order from the column/layer node to the Xsheet node.
ru: Если в цепочке применяется несколько эффектов, они будут применяться один за другим, следуя порядку от узла столбца/слоя к узлу Xsheet.

source: **Combined effects**, such as the Matte In effect, that modify the column/layer contents according to the contents other columns/layers; they are displayed with a yellow node with two or more input ports on the left, and one output port on the right.
ru: **Комбинированные эффекты**, такие как эффект Matte In, которые изменяют содержимое столбца/слоя в соответствии с содержимым других столбцов/слоев; они отображаются с желтым узлом с двумя или более входными портами слева и одним выходным портом справа.

source: To affect a column/layer, they have to be inserted into the link from the column/layer node to the Xsheet node, so that the column/layer node is connected to the first effect input port labelled *Source*, while the other columns/layers are connected to the other input ports, whose labels depend on the effect; the effect node output port has to be connected to the Xsheet node.
ru: Чтобы повлиять на столбец/слой, их необходимо вставить в ссылку от узла столбца/слоя к узлу Xsheet, чтобы узел столбца/слоя был подключен к первому входному порту эффекта, помеченному *Source*, тогда как другие столбцы/слои подключены к другим входным портам, чьи метки зависят от эффекта; порт вывода узла эффекта должен быть подключен к узлу Xsheet.

source: For example in case of a Matte In effect, the column to be matted has to be linked to the *Source* input port, the matte column has to be linked to the *Matte* input port, and the output port has to be connected to the Xsheet node.
ru: Например, в случае эффекта Matte In столбец, который нужно объединить, должен быть связан с входным портом *Source*, столбец matte должен быть связан с входным портом *Matte*, а выходной порт должен быть подключен к узлу Xsheet.

source: **Effects that create computer generated images**, such as the Radial Gradient, that are exposed in Xsheet columns (and Timeline layers) and therefore are similar to columns; they are displayed with an orange node with only an output port on the right. These effect nodes have to be connected to the Xsheet node to be rendered, or can be connected to other effect nodes.
ru: **Эффекты, которые создают сгенерированные компьютером изображения**, такие как радиальный градиент, которые отображаются в столбцах Xsheet (и слоях Timeline) и, следовательно, аналогичны столбцам; они отображаются с оранжевым узлом только с выходным портом справа. Эти узлы эффектов должны быть связаны с узлом Xsheet для визуализации или могут быть связаны с другими узлами эффектов.

source: **To open the FX Browser:**
ru: **Чтобы открыть Браузер FX:**

source: Choose Xsheet → **New FX...**
ru: Выберите Xsheet → **Новый FX...**

source: Click the **New FX** button (|fx|) in the bottom bar of the FX Schematic window.
ru: Нажмите кнопку **Новый FX** (|fx|) в нижней панели окна схемы FX.

source: **To Insert an effect:**
ru: **Чтобы вставить эффект:**

source: Select the nodes for which you want to insert a new effect, select the effect you want to insert in the **FX Browser** and click the **Insert** button.
ru: Выберите узлы, для которых вы хотите вставить новый эффект, выберите эффект, который вы хотите вставить в **Браузер FX**, и нажмите кнопку **Вставить**.

source: Select the nodes for which you want to insert a new effect, right-click any of them and choose **Insert FX** from the menu that opens, then select the effect you want to insert from the available submenus.
ru: Выберите узлы, для которых вы хотите вставить новый эффект, щелкните правой кнопкой мыши любой из них и выберите **Вставить FX** в открывшемся меню, затем выберите эффект, который вы хотите вставить, из доступных подменю.

source: Select the *links* where you want to insert a new effect, right-click any of them and choose **Insert FX** from the menu that opens, then select the effect you want to insert from the available submenus (see :ref:`Editing the FX Schematic <editing_the_fx_schematic>` ).
ru: Выберите *ссылки*, куда вы хотите вставить новый эффект, щелкните правой кнопкой мыши по любой из них и выберите **Вставить FX ** в открывшемся меню, затем выберите эффект, который вы хотите вставить, из доступных подменю (см. :ref:`Редактирование схемы FX <editing_the_fx_schematic>`).

source: **To Add an effect:**
ru: **Чтобы добавить эффект:**

source: Select the nodes for which you want to add a new effect at the end of a new link.
ru: Выберите узлы, для которых вы хотите добавить новый эффект в конце новой ссылки.

source: Select the effect you want to add in the **FX Browser** and click the **Add** button.
ru: Выберите эффект, который вы хотите добавить, в **Браузере FX** и нажмите кнопку **Добавить**.

source: Right-click any of the selected nodes and choose **Add FX** from the menu that opens, then select the effect you want to add from the available submenus.
ru: Щелкните правой кнопкой мыши любой из выбранных узлов и выберите **Добавить FX** в открывшемся меню, затем выберите эффект, который вы хотите добавить, из доступных подменю.

source: **To Replace an effect:**
ru: **Чтобы заменить эффект:**

source: Select the effect nodes you want to replace with a new effect.
ru: Выберите узлы эффекта, которые вы хотите заменить новым эффектом.

source: Select the effect you want to add in the **FX Browser** and click the **Replace** button.
ru: Выберите эффект, который вы хотите добавить, в **Браузер FX** и нажмите кнопку **Заменить**.

source: Right-click any of the selected nodes and choose **Replace FX** from the menu that opens, then select the new effect from the available submenus.
ru: Щелкните правой кнопкой мыши любой из выбранных узлов и выберите **Заменить FX** в открывшемся меню, затем выберите новый эффект из доступных подменю.

source: **To Insert/Add effects globally:**
ru: **Чтобы вставить/добавить эффекты глобально:**

source: Select the **Xsheet** node.
ru: Выделите узел **Xsheet**.

source: Select the effect you want to insert/add in the **FX Browser** and click the **Insert** or **Add** buttons.
ru: Выберите эффект, который вы хотите вставить/добавить, в **Браузере FX** и нажмите кнопки **Вставить** или **Добавить**.

source: Right-click any of the selected nodes and choose **Insert FX** or **Add FX** from the menu that opens, then select the effect you want to a insert/add from the available submenus.
ru: Щелкните правой кнопкой мыши любой из выбранных узлов и выберите **Вставить FX** или **Добавить FX** в открывшемся меню, затем выберите эффект, который вы хотите вставить/добавить, из доступных подменю.

source: **Ctrl + double-click** (PC) or **Cmd + double-click** (macOS) the node name and type a new name.
ru: Кликните два раза с зажатой клавишей **Ctrl** (PC) или **Cmd** (macOS) по имени узла и введите новое имя.

source: Editing the FX Schematic
ru: Редактирование схемы FX

source: Links between nodes have to be considered like flows going to the right, from the column/layer nodes to the *Output* node, via the Xsheet node. If along the way there is one or several effects, the column content will be consequently processed before becoming part of the output.
ru: Связи между узлами следует рассматривать как потоки, идущие направо, от узлов столбца/слоя к узлу *Вывод* через узел Xsheet. Если по пути есть один или несколько эффектов, содержимое столбца будет соответственно обработано, прежде чем станет частью вывода.

source: From the nodes output port several links can start at the same time, thus allowing, for example, a column/layer to be rendered as it is, and to be also used as a mask for another column/layer. It is also possible to determine permanently whether columns/layers will be rendered or not, by leaving or deleting the link to the Xsheet node.
ru: С выходного порта узлов может одновременно запускаться несколько ссылок, что позволяет, например, визуализировать столбец/слой как есть, а также использовать в качестве маски для другого столбца/слоя. Также можно постоянно определять, будут ли отображаться столбцы/слои, оставив или удалив ссылку на узел Xsheet.

source: By editing the links between nodes, or by creating new ones, you can control how column/layer nodes will interact with each other and with effects before being rendered.
ru: Редактируя связи между узлами или создавая новые, вы можете управлять тем, как узлы столбцов/слоев будут взаимодействовать друг с другом и с эффектами перед их визуализацией.

source: In the effects that accept multiple input nodes it is possible to change the stacking order of the input nodes by clicking and dragging in the *ports* area.
ru: В эффектах, которые принимают несколько входных узлов, можно изменить порядок наложения входных узлов, щелкнув и перетащив в область *портов*.

source: Effect nodes and links can be selected in order to be cut, copied, pasted or deleted. When selected, nodes and links are highlighted in white; the current node has its label in yellow; when at least one object is selected, the related links are displayed in blue.
ru: Узлы эффектов и ссылки могут быть выбраны для того, чтобы их можно было вырезать, скопировать, вставить или удалить. Когда выбрано, узлы и ссылки выделены белым; текущий узел имеет свою метку желтого цвета; когда выбран хотя бы один объект, связанные ссылки отображаются синим цветом.

source: When pasting a copied/cut selection, several options are available:
ru: При вставке скопированного/вырезанного выделения доступно несколько параметров:

source: Use **Paste** to paste the copied/cut selection into the FX Schematic.
ru: Используйте **Вставить**, чтобы вставить скопированное/вырезанное выделение в схему FX.

source: Use **Paste Insert** to insert the pasted selection into the *selected links*.
ru: Используйте **Вставить вставку**, чтобы вставить выделенное в *выбранные ссылки*.

source: Use **Paste Add** to add the pasted selection from the *selected nodes* at the end of new links.
ru: Используйте **Вставить Добавить**, чтобы добавить вставленный выбор из *выбранных узлов* в конце новых ссылок.

source: Use **Paste Replace** to replace *selected effects nodes* with the pasted selection.
ru: Используйте **Вставить Заменить**, чтобы заменить *выбранные узлы эффектов* вставленным выделением.

source: Links have to be selected together with nodes when copying/cutting a selection if you want to preserve the links among them when pasting.
ru: Ссылки должны выбираться вместе с узлами при копировании/вырезании выделения, если вы хотите сохранить ссылки между ними при вставке.

source: **To create links between nodes:**
ru: **Чтобы создать ссылки между узлами:**
