Repository: WizzerWorks/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/cleaning-up_scanned_drawings.po
Languages: es

source: Cleaning-up Scanned Drawings
es: Limpieza de dibujos escaneados

source: In order to be painted and edited with OpenToonz, scanned drawings have to undergo the cleanup process. The process involves autocentering, to align each drawing according to the pegbar holes; line processing, to recognize the drawing outline; image cropping and re-sizing, to make the drawings fit properly the camera.
es: Para poder ser pintados y editados en OpenToonz, los dibujos escaneados deberán pasar por el proceso de limpieza. Este proceso abarca el centrado automático, para alinear cada dibujo según la posición de los huecos de registro de la hoja; el procesamiento de las líneas, para reconocer los contornos de los dibujos; así como el recorte y escalado de la imagen, para lograr que los dibujos se ajusten a la cámara como corresponda.

source: The process generates a Toonz raster level (TLV format) and the related default palette (TPL format), where the styles used to paint the level will be stored.
es: El proceso generará un nivel de Imagen de Toonz (TLV) y su paleta predefinida correspondiente (TPL), donde los estilos usados para pintar el nivel serán almacenados.

source: If the computer performance slows down during the cleanup process of very high resolution images, try activating the **Minimize Raster Memory Fragmentation** option in the Files → Preferences → General dialog (see :ref:`Optimizing the Memory Usage <optimizing_the_memory_usage>` ).
es: Si el rendimiento del sistema se viera enlentecido durante el proceso de limpieza de imágenes de muy alta resolución, se recomienda activar la opción **Minimizar fragmentación de imágenes en memoria** en el diálogo Archivos → Preferencias → General (ver :ref:`Optimización del uso de memoria <optimizing_the_memory_usage>` ).

source: The Cleanup Settings
es: Opciones de limpieza

source: |cleanup_settings|
es: |cleanup_settings_es|

source: The cleanup process can be controlled by using the Cleanup Settings that include Cleanup, Processing and Camera parameters.
es: El proceso de limpieza podrá ser controlado mediante el uso del panel Opciones de limpieza que incluye parámetros de Limpieza, Procesamiento y Cámara.

source: Usually settings are defined and checked for one of the level drawings, then applied to the whole animation level. If all of the drawings in the scene have the same characteristics, it is very likely that the same settings can be used for every drawing throughout all of the animation levels.
es: Usualmente las opciones serán definidas y revisadas en uno de los dibujos del nivel, para luego ser aplicadas a todo el nivel de animación. Si todos los dibujos en la escena tuvieran las mismas características, será muy probable que sea posible utilizar las mismas opciones para todos los dibujos de cada uno de sus niveles de animación.

source: **To define cleanup settings:**
es: **Para definir las opciones de limpieza:**

source: Choose Scan & Cleanup → **Cleanup Settings...** and use the dialog to control the cleanup process parameters and options.
es: Elegir Escaneo y limpieza → **Opciones de limpieza...** y usar el panel para controlar las opciones y parámetros del proceso de limpieza.

source: Defining Cleanup Parameters
es: Definición de parámetros de limpieza

source: The Cleanup parameters set the autocentering information and some geometric transformations.
es: Los parámetros de Limpieza permiten definir la información de centrado automático, así como algunas transformaciones geométricas.

source: Autocentering
es: Centrado automático

source: |autocentering|
es: |autocentering_es|

source: The **Autocenter** option aligns lineart drawings and full-color images according to the shape and position of the pegbar holes, in order to set the correct registration for them, once they are used in an animation scene.
es: La opción **Centrado automático** permite alinear los dibujos de acuerdo a la forma y posición de los huecos de la barra se sujeción, para que puedan ser registrados correctamente al usarlos en la escena.

source: Pegbar holes have to be included properly during the scanning process in order to be recognized during the process (see :ref:`Scanning Guidelines for Autocentering <scanning_guidelines_for_autocentering>` ).
es: Será necesario que los huecos de registro sean escaneados de forma apropiada, para que puedan ser reconocidos durante el proceso de centrado (ver :ref:`Guía de escaneo para usar el centrado automático <scanning_guidelines_for_autocentering>` ).

source: In case the autocenter fails because it's not possible to recognize properly the pegbar holes, an error message is displayed; yet the drawings and images are processed according to the other set parameters.
es: En caso de que el centrado automático fallara, al no poder reconocer los huecos de registro, se mostrará un mensaje de error; aún así los dibujos e imágenes podrán ser procesados de acuerdo con los restantes parámetros del panel de limpieza.

source: Autocenter parameters are the following:
es: Los parámetros del Centrado automático son los siguientes:

source: **Autocenter**, when activated, triggers the autocenter process.
es: **Centrado automático**, permite activar el proceso de centrado automático.

source: **Pegbar Holes**, sets the side of the drawing along which holes should be detected.
es: **Huecos de barra de sujeción**, permite definir el lado del dibujo donde deberán ser detectados los huecos de registro de la hoja.

source: **Field Guide**, specifies the size of the reference field guide that has to be used to set the center of the processed drawings and images, and the type of pegbar holes that have to be detected (such as Acme or Oxbry).
es: **Guía de campos**, permite especificar el tamaño de la guía de campos que se usará como referencia para definir el centro de los dibujos a ser procesados, así como el tipo de huecos de registro que se buscará detectar (p.ej: Acme o Oxbry).

source: **To check the autocenter on a selected drawing:**
es: **Para comprobar el centrado automático en el dibujo seleccionado:**

source: Activate the **Autocenter** option.
es: Activar la opción **Centrado automático**.

source: Set the side where **Pegbar Holes** have to be detected.
es: Definir el lado donde se deberá buscar los **Huecos de barra de sujeción**.

source: Set the **Field Guide** to be used as reference to set the center in the correct place, and to match the shape of the pegbar holes.
es: Definir la **Guía de campos** a ser usada como referencia para definir la ubicación correcta del centro de la hoja y el tipo de huecos de registro a buscar.

source: Choose Scan & Cleanup → **Preview Cleanup** to preview the process in the Viewer.
es: Elegir Escaneo y limpieza → **Previsualizar limpieza** para previsualizar en el Visor el proceso de limpieza.

source: Other Cleanup Parameters
es: Otros parámetros de limpieza

source: The Cleanup pane contains also other parameters that can be activated regardless of the autocenter, as they will affect processed images even if the Autocenter option is not activated. Parameters are the following:
es: El panel de Opciones de limpieza también contiene otros parámetros que podrán ser activados independientemente al centrado automático, debido a que afectarán a las imágenes procesadas, aunque el centrado automático no estuviera activado. Los parámetros son los siguientes:

source: |rotate|
es: |rotate_es|

source: **Rotate**, rotates the image by 90° steps clockwise. It can be used to set the right orientation for images scanned with a different direction in order to fit the scanner bed.
es: **Rotar**, permite rotar la imagen en pasos de 90° en sentido horario. Permite orientar correctamente imágenes que hubieran tenido que ser escaneadas en otro sentido, para acomodarlas dentro del escáner.

source: **Flip**, mirrors the image horizontally, vertically or both, according to the activated options. It can be used, for example, when processing a shadow level drawn on the other side of the paper where the character level is drawn, in order to match the two animation levels later.
es: **Dar vuelta**, permite invertir los dibujos de forma horizontal, vertical o ambas, de acuerdo a las opciones activadas. Podrá ser usado, por ejemplo, al procesar un nivel de sombras dibujado del lado de atrás de una hoja donde haya sido dibujado un personaje, para hacerlo coincidir con el dibujo principal del mismo.

source: |savein|
es: |savein_es|

source: **Save In**, lets you define the folder where the cleaned up drawings are saved. By default it is set to the *+drawings* default folder of the current project (see :ref:`Project Default Folders <project_default_folders>` ).
es: **Guardar en**, permite definir la carpeta donde deberán ser guardados los dibujos, una vez limpiados. De forma predefinida, éstos se guardarán en la carpeta *+drawings* del proyecto activo (ver :ref:`Carpetas predefinidas de un proyecto <project_default_folders>` ).

source: Defining Line Processing Parameters
es: Definición de parámetros de procesamiento de líneas

source: The Processing parameters set the line processing options in order to prepare drawings for the painting process, recognizing *black lines* (in black and white or grayscale lineart drawings), or *colored lines* (in colored lineart drawings).
es: Los parámetros de Procesamiento permiten definir las opciones de procesamiento de líneas para preparar los dibujos para el proceso de pintura, reconociendo *líneas negras* (en dibujos en blanco y negro o escala de grises) o *líneas de color* (en dibujos que contengan color).

source: **To set the type of line processing:**
es: **Para establecer el tipo de procesamiento de línea:**

source: Set the **Line Processing** option to **None**, if no line processing is required, **Greyscale**, if lines have to be recognized as black, or **Color**, if lines have to be recognized as colored ones.
es: Definir la opción **Procesamiento de línea:** en: **No** si no se requiriera procesamiento de líneas, **Escala de grises**, para reconocer líneas negras o **Color**, para reconocer líneas de color.

source: Processing Black and White or Greyscale Lineart Drawings
es: Procesamiento de dibujos en blanco y negro o escala de grises

source: |greyscale|
es: |greyscale_es|

source: For black and white or greyscale lineart drawings, a set of parameters are available to calibrate the black line recognition process.
es: Para dibujos en blanco y negro o escala de grises, existe un conjunto de parámetros para calibrar el proceso de reconocimiento de líneas negras.

source: The result of the process can be previewed in the OpenToonz main Viewer (see :ref:`Previewing the Cleanup Process <previewing_the_cleanup_process>` ).
es: Es posible previsualizar el resultado de ese proceso en el Visor principal de OpenToonz (ver :ref:`Previsualización de proceso de limpieza <previewing_the_cleanup_process>` ).

source: Parameters are the following:
es: Los parámetros son los siguientes:

source: **Antialias:**, can be set to **Standard**, **None** or **Morphological**. Use **Standard** to keep the antialias resulting from current camera and defined settings. Use **None** to eliminate the antialiasing from the processed line, so that the resulting line will be fully solid with no semi-transparent pixels that smooths its edges. Use **Morphological** to replace the standard antialias with one obtained by analyzing the image edges.
es: **Suavizado de bordes:**, es posible establecerlo en **Estándar**, **no**, **Morfológico**. Usar **Estándar** para mantener el suavizado de bordes resultante de las opciones de cámara y procesamiento definidas. Usar **no** para eliminar el suavizado de bordes de las líneas procesadas, para que las mismas sean completamente sólidas, sin píxeles semitransparentes que hagan a sus bordes lucir más suaves. Usar **Morfológico** para reemplazar el suavizado de bordes estándar con uno obtenido mediante el análisis de los bordes de la imagen.

source: **Autoadjust**, corrects the levels of grey in the drawings in order to avoid darker and lighter drawings in a sequence (see :ref:`Autoadjusting Greyscale Lineart Drawings <autoadjusting_greyscale_lineart_drawings>` ). (NOTE: This feature is currently not available in OpenToonz).
es: **Ajuste automático**, permite corregir los niveles de gris en los dibujos para evitar que haya algunos dibujos más claros u oscuros que otros, en una secuencia (ver :ref:`Ajuste automático de dibujos en escala de grises <autoadjusting_greyscale_lineart_drawings>` ). (NOTA: Actualmente esta característica no está disponible en OpenToonz).

source: **Sharpness:**, defines how sharp the processed lines will be. Higher values produce sharper, harder lines, and lower values create smoother lines.
es: **Nitidez**, permite definir que tan nítidas serán las líneas resultantes. Valores más altos producirán líneas más definidas y duras, mientras que valores más bajos producirán líneas más suaves.

source: **Despeckling:**, removes small spots or marks from the processed images. Its value expresses the size in pixels of the side of the maximum area that has to be removed. The spots and marks removed by this option can also be checked by activating the Opacity Check (see :ref:`Using the Opacity Check <using_the_opacity_check>` ).
es: **Desmanchado:** permite remover pequeñas manchas o marcas de las imágenes procesadas. Su valor expresa el tamaño máximo en píxeles de los lados del área que podrá ser removida. También es posible comprobar las manchas y marcas a ser removidas con esta opción, activando la opción Comprobación de opacidad (ver :ref:`Uso de la Comprobación de opacidad <using_the_opacity_check>` ).

source: **MLAA Intensity:**, sets the intensity of the *morphological antialias*. The higher the value the more blurred the line. (It is available only when **Morphological** is selected).
es: **Intensidad:**, permite definir la intensidad del *suavizado de bordes morfológico*. Cuanto más alto sea el valor, más desenfocadas serán las líneas producidas. (Se encuentra disponible sólo cuando la opción **Morfológico** se encuentra seleccionada).

source: **Brightness:**, controls the thickness of the recognized line: the lower the value, the thicker the line.
es: **Brillo:**, permite controlar el grosor de las líneas detectadas: cuanto más bajo sea el valor, más gruesa será la línea.

source: **Contrast:**, controls the antialiasing of the recognized line: a higher value produces more solid pixels, a lower value lines with more antialiased pixels. The amount of antialiasing can also be checked by activating the **Opacity Check** (see :ref:`Using the Opacity Check <using_the_opacity_check>` ).
es: **Contraste:**, permite controlar el suavizado de bordes de las líneas detectadas: valores más altos producirán píxeles más sólidos, valores más bajos producirán líneas con píxeles más suavizados. También es posible comprobar la cantidad de suavizado de bordes con esta opción, activando la opción **Comprobación de opacidad** (ver :ref:`Uso de la Comprobación de opacidad <using_the_opacity_check>` ).

source: If the Antialias is set on **None** or **Morphological**, the **Contrast:** parameter will become deactivated.
es: Si el Suavizado de bordes estuviera establecido en **no** o en **Morfológico**, el parámetro **Contraste** quedará desactivado.

source: **To set the line processing for black and white or greyscale lineart drawings:**
es: **Para definir el procesamiento de líneas para dibujos en blanco y negro o escala de grises:**

source: Activate the Line Processing → **Greyscale** option.
es: Activar la opción Procesamiento de línea → **Escala de grises**.

source: Define the parameters according to your needs.
es: Definir los parámetros de acuerdo a las necesidades.

source: Preview the result of the cleanup process (see :ref:`Previewing the Cleanup Process <previewing_the_cleanup_process>` ).
es: Previsualizar el resultado del proceso de limpieza (ver :ref:`Previsualización del proceso de limpieza <previewing_the_cleanup_process>` ).

source: Autoadjusting Greyscale Lineart Drawings
es: Ajuste automático de dibujos en escala de grises

source: The **Autoadjust** clean-up options explained here are currently unavailable in OpenToonz. There is no certainty about its reinclusion at a later version or not. If you judge them to be useful for your workflow, you could file an *Issue* about that in the OpenToonz' GitHub repository or in the various OpenToonz forums.
es: Actualmente, las opciones de **Ajuste automático** explicadas aquí, no se encuentran disponibles en OpenToonz y no existe certeza acerca de su reinclusión en una versión posterior. Si fueran necesarias para resolver tareas en un determinado flujo de trabajo, por favor ingresar un *Issue* al respecto en el repositorio de OpenToonz en GitHub o en alguno de los varios foros públicos existentes.

source: The **Autoadjust** option available among the Cleanup parameters allows you to even the differences between drawings made by key animators and those made by in-betweeners by adjusting the line darkness of all of the level drawings.
es: La opción **Ajuste automático** disponible en los parámetros de Limpieza, permite igualar las diferencias entre varios dibujos realizados por los animadores principales y los intermediadores en un mismo nivel, ajustando la intensidad de sus líneas.

source: The **Autoadjust** option has effect only on drawings scanned in greyscale mode, while it has no effect on drawings scanned in black and white.
es: La opción **Ajuste automático** tiene efecto sólo en dibujos escaneados en modo escala de grises, y no se aplicará a aquellos escaneados en modo blando y negro.

source: Three different autoadjust algorithms are available:
es: Se encuentran disponibles tres algoritmos distintos de ajuste automático:

source: **Black Eq**, computes the average of the darkest grey tone found in drawing lines below a certain threshold and sets this value to the conventional black level, so that grey levels of each image are automatically adjusted.
es: **Ecualización de negro**, calcula el valor promedio del tono más oscuro encontrado en las líneas del dibujo, que se encuentren por debajo de un cierto umbral y establece ese valor como el nivel de negro de la imagen, para que los niveles de gris de cada imagen se ajusten automáticamente a partir de allí.

source: **Histogram**, makes a histogram of the grey levels of the first image and equalizes the histograms of the following images according to it. It works well when the content of the images (apart from line darkness) does not vary too much across the level.
es: **Histograma**, realiza un histograma de los niveles de gris de la primera imagen y ecualiza los histogramas de las imágenes siguientes de acuerdo a eso. Funciona mejor cuando el resto del contenido de las imágenes (sin considerar la oscuridad de sus líneas) no varía en demasía a lo largo del nivel.

source: **Histo-L**, takes into account the number of lines in each image to normalize the histogram of grey levels, before the histogram equalization is performed. This is useful for example when a character becomes bigger or smaller in an animated level, or when parts of the character are animated independently in some frames.
es: **Histograma-L**, toma en cuenta la cantidad de líneas en cada imagen para normalizar el histograma de los niveles de gris, antes de realizar la ecualización del histograma. Esto resulta útil, por ejemplo, cuando un personaje se agranda o achica en un nivel de animación, o cuando partes de un personaje son animadas de forma independiente en algunos fotogramas.

source: The advantage of the **Histo-L** mode over the others is that it adjusts the grey levels of each image independently, while the other algorithms equalize each image to make it look like the first one of the level.
es: La ventaja del modo **Histograma-L** sobre los otros es que ajusta los niveles de gris de cada imagen de forma independiente, mientras que los otros algoritmos ecualizan cada imagen para que se parezca a la primera del nivel.

source: Only the effects of the **Black Eq** process can be checked using the Scan & Cleanup → **Cleanup Preview** command; the effects of **Histogram** and **Histo-L** are only visible selecting a sequence of at least two frames (i.e. one as reference frame and the others to be auto-adjusted) and processing them using the Scan & Cleanup → Cleanup command. You may need to make a few trials using different algorithms before obtaining the desired results.
es: Sólo los efectos del procesamiento con **Ecualización de negro** podrán ser revisados usando el comando Escaneo y limpieza → **Previsualizar limpieza**; los efectos de los modos **Histograma** e **Histograma-L** sólo serán visibles al seleccionar una secuencia de al menos dos fotogramas (el primero como fotograma de referencia y los restantes para ser ajustados automáticamente) y procesarla usando el comando Escaneo y limpieza → Limpiar. Es posible que sea necesario realizar varias pruebas usando diferentes algoritmos antes de obtener los resultados deseados.

source: These algorithms work on the area of the drawing specified in the Field text boxes, excluding a 5 mm boundary edge. In this way any line might be drawn to delimit the camera shot on paper, and the pegbar holes, do not affect the result.
es: Estos algoritmos trabajarán dentro del área del dibujo especificada en los parámetros de la cámara, excluyendo un margen de 5 mm desde su borde. De esta manera será posible evitar que ciertos elementos, como cualquier línea usada sobre el papel para delimitar el encuadre de la cámara o los propios huecos de registro de la hoja, afecten el resultado del ajuste automático.

source: Processing Colored Lineart Drawings
es: Procesamiento de dibujos en color

source: |color|
es: |color_es|

source: For colored lineart drawings, a set of parameters are available to calibrate the line recognition process, and to set which and how colors have to be detected in the drawings (see :ref:`Defining Colors for the Color Line Processing <defining_colors_for_the_color_line_processing>` ).
es: Para dibujos con líneas de color, se encuentra disponible un conjunto de parámetros para calibrar el proceso de reconocimiento de líneas, así como para definir cuáles y cómo deberán ser detectados los coloress (ver :ref:`Definición de colores para el procesamiento de líneas de color <defining_colors_for_the_color_line_processing>` ).

source: For all the cleanup colors you can define a color to be assigned automatically to the lines after the processing, with no need to paint them. The two colors, the one used for the recognition and the one to be assigned to the recognized lines, are available at the bottom area of the Style Editor pane.
es: Es posible definir para cada color de limpieza, un color a ser asignado automáticamente a las líneas luego de ser detectadas, sin necesidad de pintarlas manualmente. Tanto el color usado para la detección, como el que será asignado a las líneas detectadas, se encuentran disponibles en la sección inferior del Editor de estilos.

source: Different parameters are available for the black color, that usually defines the main outline in lineart drawings, and for the additional colors, that usually defines special outlines for areas such as shadows and highlights.
es: Se mostrarán diferentes parámetros para el color negro (que normalmente define los contornos principales de los dibujos) y los restantes colores a ser detectados (que normalmente definen contornos especiales para áreas, tales como sombras e iluminaciones).

source: General parameters are the following:
es: Los parámetros generales son los siguientes:
