Repository: WizzerWorks/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/cleaning-up_scanned_drawings.po
Languages: es

source: The **Camera Test** can be used to check the cleanup process as concerning the Cleanup and the Camera parameters. It displays the drawing selected in the Xsheet/Timeline directly in the Viewer without line processing but with the position modified according to the Cleanup parameters (Autocenter, Rotate and Flip), and the size modified according to the Camera parameters. In particular a *red* box displays how the cleanup camera will crop the drawing, and a *blue* box displays the camera **Closest Field**.
es: La **Prueba de cámara** puede ser usada para revisar el proceso de limpieza, con respecto a los parámetros Centrado automático, Rotación, Dar vuelta y Cámara. Mostrará el dibujo seleccionado en la Planilla/Línea de tiempo directamente en el Visor, sin el Procesamiento de líneas, pero con su posición modificada de acuerdo a los parámetros Centrado automático, Rotación, Dar vuelta, y su tamaño modificado de acuerdo a los parámetros de Cámara. En particular, un marco *rojo* permitirá visualizar la manera en que la Cámara de limpieza recortará el dibujo, y uno *azul* el tamaño del **Campo de acercamiento** máximo.

source: It is possible to modify the camera box directly in the Viewer thus updating the cleanup camera information visible in the Cleanup Settings dialog (see :ref:`Defining Camera <defining_camera>` ).
es: Será posible modificar directamente el marco de la cámara en el Visor, actualizando así la información de los parámetros correspondientes en el panel de Opciones de limpieza (ver :ref:`Definición de la cámara <defining_camera>` ).

source: If you change any of the Cleanup or Camera parameters, the camera test automatically updates to display how the changes affect the process.
es: Si se cambiara cualquiera de los parámetros arriba mencionados, la prueba de cámara se actualizará automáticamente para reflejar dichos cambios en el Visor.

source: **To activate the camera test:**
es: **Para activar la prueba de cámara:**

source: In the Xsheet/Timeline select the drawing you want to preview, and choose Scan & Cleanup → **Camera Test**.
es: En la Planilla/Línea de tiempo seleccionar el dibujo que se desee previsualizar, luego elegir Escaneo y limpieza → **Prueba de cámara**.

source: **To deactivate the camera test:**
es: **Para desactivar la prueba de cámara:**

source: Choose Scan & Cleanup → **Camera Test**.
es: Elegir Escaneo y limpieza → **Prueba de cámara**.

source: **To modify the cleanup camera directly in the Viewer:**
es: **Para modificar la cámara de limpieza directamente en el Visor:**

source: Do any of the following:
es: Realizar alguna de las siguientes acciones:

source: Operate the handles on the top and right edges to scale the camera size horizontally or vertically, thus changing the camera **A/R** as well.
es: Manipular las asas en el centro de los lados del marco para redimensionar el tamaño de la cámara horizontal o verticalmente, cambiando también así la **Proporción** de la cámara.

source: Operate the handle on the top right corner to scale the camera size while keeping the A/R.
es: Manipular las asas en las esquinas del marco para redimensionar el tamaño de la cámara, manteniendo su Proporción.

source: Activate the DPI Lock in the cleanup camera parameters, and operate the handles to scale also the camera resolution (NOT AVAILABLE in OpenToonz).
es: Activar el bloqueo de PPP en los parámetros de limpieza, para que al manipular las asas también se modifique la resolución de la cámara (NO DISPONIBLE en OpenToonz).

source: Move the camera box to modify the cleanup camera E/W and N/S offset.
es: Mover el marco de la cámara para modificar el desplazamiento horizontal (X) o vertical (Y) de la cámara.

source: **To perform the camera test on a different drawing:**
es: **Para realizar la prueba de cámara en otro dibujo:**

source: **To exit the camera test mode:**
es: **Para salir del modo de prueba de cámara:**

source: Choose Scan & Cleanup → **Camera Test** to deactivate it.
es: Elegir Escaneo y limpieza → **Prueba de cámara** para desactivarlo.

source: Cleaning up Drawings
es: Limpieza de dibujos

source: Once the cleanup settings are defined and the process is checked, it is possible to cleanup all of the drawings of the scene, or a selection of them.
es: Una vez que las opciones de limpieza hayan sido definidas y el proceso haya sido revisado, será posible limpiar todos los dibujos de la escena o una selección de los mismos.

source: Drawings can be processed directly inside the scene after performing a selection, or they can be processed automatically in batch mode.
es: Será posible procesar los dibujos directamente dentro de la escena, luego de seleccionarlos, o de manera automática por lotes.

source: In both cases they will be cleaned up according to the Cleanup Settings defined for the scene, unless a specific CLN file was saved for any of the animation levels in the scene.
es: En ambos casos los dibujos se limpiarán de acuerdo a las Opciones de limpieza definidas en la escena, a menos que se haya guardado un archivo CLN específico para alguno de los niveles de animación de la escena.

source: By default cleaned up drawings are saved in the *+drawings* directory of the current project (see :ref:`Project Default Folders <project_default_folders>` ), but you can change the location by using the **Save In** option available in the cleanup settings dialog.
es: De forma predefinida los dibujos serán guardados en la carpeta *+drawings* del proyecto activo (ver :ref:`Carpetas predefinidas de un proyecto <project_default_folders>` ), sin embargo será posible cambiar la ubicación mediante el campo **Guardar en** del panel Opciones de limpieza.

source: Cleaned up animation levels are saved as TLV files; the related palettes are saved in the same location and with the same name of the animation levels as TPL files.
es: Los niveles de animación limpiados serán guardados como archivos TLV; sus paletas correspondientes serán guardadas en la misma ubicación y con el mismo nombre del nivel en archivos TPL.

source: It is also possible to automatically create a backup copy of the cleaned up drawings that will be stored in a subfolder named **nopaint** inside the same location where the cleaned up drawings are saved. In this way it will be possible to retrieve the original drawing in case some mistakes (e.g. a deletion of a drawing section) are made during the painting process.
es: También será posible crear automáticamente una copia de respaldo de los dibujos limpiados, en una subcarpeta llamada **nopaint** en la misma ubicación donde se guarden éstos. De esta forma será posible recuperar el dibujo original, en caso de que se cometiera algún error (p.ej: la eliminación involuntaria de una sección del dibujo), durante el proceso de pintura.

source: **To automatically create a backup copy of the cleaned up drawings:**
es: **Para crear automáticamente una copia de respaldo de los dibujos limpiados:**

source: Choose File → Preferences → Drawing.
es: Elegir Archivo → Preferencias → Dibujo.

source: Activate the **Keep Original Cleaned Up Drawings As Backup** option.
es: Activar la opción **Mantener respaldos de los dibujos limpios**.

source: **To revert to the original cleaned up drawings:**
es: **Para revertir un dibujo a su versión limpia:**

source: In the Level Strip select the drawings you want to revert (see :ref:`Using the Level Strip <using_the_level_strip>` ).
es: En la Cinta de nivel, seleccionar los dibujos que se desee revertir (ver :ref:`Uso de la Cinta de nivel <using_the_level_strip>` ).

source: Do one of the following:
es: Realizar una de las siguientes acciones:

source: Choose Level → **Revert to Cleaned Up**.
es: Elegir Nivel → **Revertir a versión limpia**.

source: Right click the selection and choose Replace level → **Revert to Cleaned Up** from the menu that opens.
es: Hacer clic derecho sobre la selección y elegir Reemplazar nivel → **Revertir a versión limpia** en el menú.

source: Cleaning up Drawings Directly in the Scene
es: Limpieza de dibujos en la propia escena

source: When cleaning up drawings directly in the scene it is possible to perform a selection of drawings and process them with the current cleanup settings. In this case you can also manage the process frame by frame, as you are prompted to choose an action for each drawing of the selection.
es: Al limpiar dibujos directamente en la escena, será posible realizar una selección de dibujos y procesarlos usando las opciones de limpieza actuales. En ese caso también será posible administrar el proceso fotograma a fotograma, a medida que se solicite elegir una acción para cada dibujo de la selección.

source: You can also select non-consecutive drawings and drawings from different animation levels. Levels will be processed starting from the first selected column/layer, considering only exposed drawings according to their numbering order.
es: También es posible seleccionar dibujos no consecutivos, así como dibujos de distintos niveles de animación. Los niveles serán procesados comenzando por la primera columna/capa seleccionada, considerando únicamente los dibujos expuestos y de acuerdo al orden de su numeración.

source: When a drawing is cleaned up, its cell color turns from *light blue* to *green*, the color denoting Toonz raster levels (see :ref:`Working with Xsheet Columns <working_with_xsheet_columns>` ). If you cleanup partially an animation level, the remaining cells where the level is exposed will have a double color (*green and blue*), to stress the fact that the level is partially processed.
es: Cuando un dibujo ha sido limpiado, el color de la celda donde se encuentra expuesto cambiará de *azul claro* a *verde*, el color identificatorio de los niveles de Imagen de Toonz (ver :ref:`Trabajo con columnas/capas <working_with_xsheet_columns>` ). Si sólo se hubiera limpiado un nivel de forma parcial, las celdas restantes en donde se encuentre expuesto el nivel, tendrán un color doble (*verde y azul*) para resaltar el hecho de que ha sido parcialmente procesado.

source: When drawings belonging to partially processed levels are selected to be cleaned up, you are prompted whether to cleanup selected drawings overwriting the previous cleaned up version, or to add non-cleaned up frames to the existing level, or to delete the existing level and create a new level with the selected drawings only.
es: Cuando se seleccionen dibujos para ser limpiados, pertenecientes a niveles parcialmente procesados, se solicitará elegir si se desea limpiar los dibujos seleccionados sobrescribiendo la versión anteriormente limpiada, si se desea agregar los fotogramas limpiados al nivel ya existente o si se desea borrar el nivel existente y crear uno nuevo sólo con los dibujos seleccionados.

source: If you want you can also revert to the scanned version of the level you cleaned up by using the Level Settings dialog (see :ref:`Editing Level Settings <editing_level_settings>` ).
es: Si fuera necesario, también será posible revertir el nivel limpiado a su versión escaneada, usando el diálogo Opciones de nivel (ver :ref:`Edición de Opciones de nivel <editing_level_settings>` ).

source: If you want to create a new TLV level from an already cleaned up level you can selet it and run the cleanup again. A questions pop up will appear and giving you the possibility to set a different name for the new TLV level by adding a suffix.
es: Si se deseara crear un nuevo nivel TLV a partir de un nivel que ya ha sido limpiado, será posible seleccionarlo y ejecutar una limpieza nuevamente. Un diálogo emergente dará la posibilidad de asignar un nombre distinto al nuevo nivel TLV, mediante la anexión de un sufijo.

source: **To process the selection according to the chosen settings:**
es: **Para procesar la selección de acuerdo a las opciones escogidas:**

source: In the Xsheet/Timeline select the drawings you want to process.
es: En la Planilla/Línea de tiempo, seleccionar los dibujos que se deseen procesar.

source: Choose Scan & Cleanup → **Cleanup**.
es: Elegir Escaneo y limpieza → **Limpiar**.

source: In the Cleanup dialog for each drawing choose one of the following:
es: En el diálogo Limpiar elegir para cada dibujo, lo siguiente:

source: **Cleanup**: the current drawing will be cleaned up.
es: **Limpiar**: el dibujo actual será limpiado.

source: **Skip**: the current drawing will not be cleanup up and the dialog displays the next drawing.
es: **Omitir**: el dibujo actual no será limpiado y el diálogo mostrará el siguiente dibujo.

source: **Cleanup All**: all the selected drawings will be cleaned up without further prompts.
es: **Limpiar todo**: se limpiarán todos los dibujos seleccionados, sin más consultas.

source: **Cancel**: the cleanup process will be interrupted.
es: **Cancelar**: interrumpirá el proceso de limpieza.

source: **To revert to the scanned version of a cleaned up level:**
es: **Para revertir un nivel limpiado a su versión original escaneada:**

source: Select any drawing of the cleaned up level.
es: Seleccionar cualquier dibujo del nivel limpiado.

source: Choose Level → **Level Settings...**
es: Elegir Nivel → **Opciones de nivel...**

source: Copy the **Scan Path:** information, and paste it in the **Path:** text field.
es: Copiar la información del campo **Ruta de escaneo:** y pegarla en el campo **Ruta:**.

source: Cleaning up Drawings in Batch Mode
es: Limpieza de dibujos por lotes

source: The cleanup of drawings exposed in a scene can be added to a task list and performed in batch mode in order to run it in the background while you perform other work on your computer.
es: Es posible agregar tareas de limpieza de dibujos expuestos en una escena a una lista de tareas a ser realizadas por lotes, para poder ser ejecutadas en segundo plano, mientras se sigue trabajando en la computadora.

source: *Cleanup tasks* can be submitted from the OpenToonz browser and can be managed and executed in the Tasks pane, together with *render tasks* (see for :ref:`Rendering Scenes in Batch Mode <rendering_scenes_in_batch_mode>`).
es: Es posible enviar *tareas de limpieza* desde el Explorador de archivos de OpenToonz, y podrán ser administradas y ejecutadas desde el panel de Tareas, conjuntamente con *tareas de procesamiento* (ver :ref:`Procesamiento de escenas por lotes <rendering_scenes_in_batch_mode>`).

source: |tasks_cleanup|
es: |tasks_cleanup_es|

source: The **Tasks** pane is divided into two sections: on the left there is the task tree where all of the *cleanup tasks* are displayed with a brush icon and all of the *render tasks* with a clapboard icon; on the right there is information about the task selected in the tree.
es: El panel **Tareas** se encuentra dividido en dos secciones: a la izquierda hay un árbol de Tareas, donde se mostrarán todas las *tareas de limpieza*, identificadas con el ícono de un pincel, así como todas las *tareas de procesamiento*, identificadas con el ícono de una claqueta; a la derecha se mostrará información acerca de la tarea seleccionada en el árbol de Tareas.

source: The Task list can be saved as TNZBAT files and loaded back later in case you want to manage it through different working sessions.
es: Es posible guardar la lista de Tareas como un archivo TNZBAT, que podrá ser cargado más adelante, en caso de ser necesario acceder a ella a lo largo de varias sesiones de trabajo.

source: **To save a task list:**
es: **Para guardar una lista de tareas:**

source: Click the **Save Task List** (|save|) or the **Save Task List As** button (|save_as|) in the bottom bar of the Tasks pane.
es: Hacer clic en el botón **Guardar** (|save|) o **Guardar como** (|save_as|) en la barra superior del panel Tareas.

source: Right-click the **Tasks** item at the top of the list and choose **Save Task List** or the **Save Task List As** from the menu that opens.
es: Hacer clic derecho en el elemento **Tareas** en la parte superior de la lista y elegir **Guardar lista de tareas** o **Guardar lista de tareas como** en el menú.

source: Use the browser that opens to save the list.
es: Usar el Explorador de archivos emergente para guardar la lista.

source: **To load a task list:**
es: **Para cargar una lista de tareas:**

source: Click the **Load Task List** button (|load|) in the bottom bar of the Tasks pane.
es: Hacer clic en el botón **Cargar** (|load|) en la barra superior del panel Tareas.

source: Right-click the **Tasks** item at the top of the list and choose **Load Task List** from the menu that opens.
es: Hacer clic derecho en el elemento **Tareas** en la parte superior de la lista y elegir **Cargar lista de tareas** en el menú.

source: Use the browser that opens to retrieve and load a previously saved list.
es: Usar el Explorador de archivos emergente para buscar y cargar una lista guardada con anterioridad.

source: **To resize the tasks pane sections:**
es: **Para redimensionar las secciones del panel Tareas:**

source: Click and drag the separator to resize sections.
es: Arrastrar el separador para redimensionar sus secciones.

source: Click and drag the separator toward the window border to hide a section.
es: Arrastrar el separador hacia el borde del panel para ocultar una sección.

source: Click and drag the separator collapsed to the window border toward the window center to display again the hidden section.
es: Arrastrar el separador colapsado hacia el centro del panel para volver a mostrar la sección oculta.

source: Managing and Executing Cleanup Tasks
es: Administración y ejecución de tareas de limpieza

source: When a *cleanup task* is selected in the tree, in the section on the right of the Tasks pane task-related properties are displayed, some of which can be edited to configure the task. Properties are the following:
es: Cuando una *tarea de limpieza* es seleccionada en el árbol de Tareas, en la sección de la derecha se mostrarán las propiedades correspondientes a la misma, algunas de las cuales podrán ser editadas para configurar la tarea. Las propiedades son las siguientes:

source: **Name:**, displays the tasks name; it can be edited to better identify the task.
es: **Nombre:**, muestra el nombre de la tarea; puede ser editado para identificar mejor a la misma.

source: **Status:**, displays if the task is waiting, running, completed or failed.
es: **Estado:**, muestra en qué estado se encuentra la tarea, los estados posibles son: En espera, En ejecución, Completada o Fallida.

source: **Command Line:**, displays the command line related to the task execution with arguments and qualifiers.
es: **Línea de comandos:**, muestra la línea de comandos correspondiente a la ejecución de dicha tarea, con argumentos y calificadores.

source: **Server:**, displays the computer that is running, or will run, the task.
es: **Servidor:**, muestra la computadora que está ejecutando o ejecutará la tarea.

source: **Submitted By:**, displays the user that submitted the task.
es: **Enviada por:**, muestra el *usuario* que envió la tarea.

source: **Submitted On:**, displays the computer from where the task was submitted.
es: **Enviada desde:**, muestra la *computadora* desde donde fue enviada la tarea.

source: **Submission Date:**, displays when the task was submitted.
es: **Fecha de envío:**, muestra *cuando* fue enviada la tarea.

source: **Start Date:**, displays when the execution of the task started.
es: **Fecha de inicio:**, muestra cuándo comenzó la ejecución de la tarea.

source: **Completion Date:**, displays when the execution of the task was completed.
es: **Fecha de finalización:**, muestra cuándo finalizó la ejecución de la tarea.

source: **Duration:**, displays how long the execution lasted.
es: **Duración:**, muestra cuánto duró ejecución de la tarea.

source: **Step Count:**, displays the number of frames rendered.
es: **Cantidad de pasos:**, muestra la cantidad de fotogramas procesados.

source: **Failed Steps:**, displays the number of frames that failed to be rendered.
es: **Pasos fallidos:**, muestra la cantidad de fotogramas que no pudieron ser procesados.

source: **Successful Steps:**, displays the number of frames successfully rendered.
es: **Pasos exitosos:**, muestra la cantidad de fotogramas que fueron procesados de forma exitosa.

source: **Priority:**, sets the importance or urgency of the task: tasks with a higher priority will be executed first. This can be edited to change the priority of a task.
es: **Prioridad:**, permite definir la importancia o urgencia de la tarea: las tareas con una prioridad más alta serán ejecutadas primero. Es posible editar este parámetro para cambiar la prioridad de una tarea.

source: **Visible Only**, when activated, limits the cleanup process only to columns whose camera stand toggle (|camera_stand|) is on, that is to say whose content is visible (see :ref:`Working with Xsheet Columns <working_with_xsheet_columns>`).
es: **Sólo lo visible**, al estar activada permite limitar el proceso de limpieza únicamente a las columnas/capas cuya opción **Visibilidad en mesa de trabajo** (|camera_stand|) se encuentre activa, o lo que es lo mismo, cuyo contenido sea visible en el Visor (ver :ref:`Trabajo con columnas/capas <working_with_xsheet_columns>`).

source: **Overwrite**, when activated, processes levels even if they are already available in the destination folder, overwriting them.
es: **Sobrescribir**, al estar activada permite procesar niveles, aún en caso de ya estar presentes en la carpeta de destino, sobrescribiéndolos así.

source: **Dependencies:**, lets you set which of the other submitted tasks have to be successfully completed before starting the current task execution: these tasks can be added from the box on the right where all submitted tasks are displayed.
es: **Dependencias:**, permite definir cuál de las otras tareas enviadas *deberá ser completada exitosamente* antes de que comience la ejecución de la tarea: estas tareas podrán ser agregadas desde el cuadro de la derecha, donde aparecerán todas las tareas enviadas.

source: Task execution can be started and stopped from the task list. If you are using the OpenToonz render farm, render tasks and sub-tasks will be distributed on the farm, one for each computer, so that several tasks can be executed at the same time (see :ref:`Using the OpenToonz Farm <using_the_toonz_farm>` ).
es: La ejecución de tareas podrá ser comenzada o detenida desde la lista de tareas. Cuando se esté utilizando la granja de procesamiento de OpenToonz, será posible dividir una tarea en *bloques*, para que cada computadora de la granja pueda procesar una sección de la misma tarea de procesamiento (ver :ref:`Uso de Toonz Farm <using_the_toonz_farm>` ).

source: When the tasks are executed, the icon color tells the status of the task according to the following color code:
es: Cuando las tareas son ejecutadas, el color de su ícono indicará el estado de las mismas, de acuerdo al siguiente código de colores:

source: *Grey*, when the task is *waiting* or is *not executed yet*.
es: *Gris*, cuando la tarea se encuentra *en espera* o aún no ha sido ejecutada.

source: *Yellow*, when the task is *being executed*.
es: *Amarillo*, cuando la tarea se encuentra *en ejecución*.

source: *Green*, when the task was *successfully executed*.
es: *Verde*, cuando la tarea ha sido *ejecutada exitosamente*.

source: *Orange*, when the task was *executed with some errors*.
es: *Naranja*, cuando la tarea ha sido *ejecutada con algunos errores*.

source: *Red*, when the task *execution has failed*.
es: *Rojo*, cuando la ejecución de la tarea *ha fallado*.

source: **To add scenes to cleanup in the task list:**
es: **Para agregar escenas a ser limpiadas a la lista de tareas:**
