Repository: WizzerWorks/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/cleaning-up_scanned_drawings.po
Languages: es

source: **Antialias:**, can be set to **Standard**, **None** or **Morphological**. Use **Standard** to keep the antialias resulting from current camera and defined settings. Use **None** to remove the antialiasing from the processed line, so that the resulting line will be fully solid with no semi-transparent pixels smoothing its edges. Use **Morphological** to replace the standard antialias with the one obtained by analyzing the image edges.
es: **Suavizado de bordes:**, es posible establecerlo en **Estándar**, **no**, **Morfológico**. Usar **Estándar** para mantener el suavizado de bordes resultante de las opciones de cámara y procesamiento definidas. Usar **no** para eliminar el suavizado de bordes de las líneas procesadas, para que las mismas sean completamente sólidas, sin píxeles semitransparentes que hagan a sus bordes lucir más suaves. Usar **Morfológico** para reemplazar el suavizado de bordes estándar con uno obtenido mediante el análisis de los bordes de la imagen.

source: If the Antialias is set to **None** or **Morphological**, the **Contrast** parameter will become desactivated.
es: Si el Suavizado de bordes estuviera establecido en **no** o en **Morfológico**, el parámetro **Contraste** quedará desactivado.

source: In the color list, parameters for the black color are the following:
es: En la lista de colores, los parámetros para el color negro son los siguientes:

source: **Contrast:**, controls the antialiasing of the recognized line: a higher value produces more solid pixels, a lower value lines with more antialiased pixels. The amount of antialiasing can also be checked by activating the Opacity Check (see :ref:`Using the Opacity Check <using_the_opacity_check>` ).
es: **Contraste:**, permite controlar el suavizado de bordes de las líneas detectadas: valores más altos producirán píxeles más sólidos, valores más bajos producirán líneas con píxeles más suavizados. También es posible comprobar la cantidad de suavizado de bordes con esta opción, activando la opción Comprobación de opacidad (ver :ref:`Uso de la Comprobación de opacidad <using_the_opacity_check>` ).

source: **Color Threshold:**, sets pixels that have to be considered as black and those that have to be considered as colors: the higher the value, the higher the number of pixels that will be considered as colored.
es: **Umbral color:**, permite definir los píxeles que deberán ser considerados como negros y aquellos que serán considerados de color: cuanto más alto sea el valor, mayor será la cantidad de píxeles considerados de color.

source: **White Threshold:**, sets pixels that have to be considered as white, for example to eliminate the paper color: the higher the value, the higher the number of pixels that will be considered as white.
es: **Umbral blanco:**, permite definir los píxeles que deberán ser considerados como blancos, por ejemplo para eliminar el color del papel: cuanto más alto sea el valor, mayor será la cantidad de píxeles considerados blancos.

source: In the color list, parameters for the other colors are the following:
es: En la lista de colores, los parámetros para los restantes colores son los siguientes:

source: **Brightness:**, controls the thickness of the recognized colored line: the lower the value, the thicker the line.
es: **Brillo:**, permite controlar el grosor de las líneas de color detectadas: cuanto más bajo sea el valor, más gruesa será la línea.

source: **Contrast:**, controls the antialiasing of the recognized colored line: a higher value produces more solid pixels, a lower value lines with more antialiased pixels. The amount of antialiasing can also be checked by activating the Opacity Check (see :ref:`Using the Opacity Check <using_the_opacity_check>` ).
es: **Contraste:**, permite controlar el suavizado de bordes de las líneas de color detectadas: valores más altos producirán píxeles más sólidos, valores más bajos producirán líneas con píxeles más suavizados. También es posible comprobar la cantidad de suavizado de bordes con esta opción, activando la opción Comprobación de opacidad (ver :ref:`Uso de la Comprobación de opacidad <using_the_opacity_check>` ).

source: **H Range:**, sets the range of the hue for color recognition: the higher the value, the higher the number of differently colored pixels that will be associated to the defined color.
es: **Rango tonal:**, permite definir el rango de los tonos a ser considerados para la detección del color: cuanto más alto sea el valor, mayor será la cantidad de píxeles de diferentes tonos que serán asociados con el color especificado.

source: **Line Width:**, sets the width of the recognized colored line: the higher the value, the higher the number of desaturated pixels that will be associated to the defined color, thus increasing the line thickness.
es: **Grosor de línea:**, permite definir el ancho de la línea de color detectada: cuanto más alto sea el valor, mayor será la cantidad de píxeles desaturados que serán asociados con el color especificado, incrementando así el grosor de la línea.

source: **To set the line processing for colored lineart drawings:**
es: **Para definir el procesamiento de líneas para dibujos de color:**

source: Activate the Line Processing → **Color** option.
es: Activar la opción Procesamiento de línea → **Color**.

source: Define the general parameters according to your needs.
es: Definir los parámetros generales de acuerdo a las necesidades.

source: Define the colors you want to be detected in the drawings (see :ref:`Defining Colors for the Color Line Processing <defining_colors_for_the_color_line_processing>` ).
es: Definir los colores que se desee detectar en los dibujos (ver :ref:`Definición de colores para el procesamiento de líneas de color <defining_colors_for_the_color_line_processing>` ).

source: Define the color parameters according to your needs.
es: Definir los parámetros de color de acuerdo a las necesidades.

source: Defining Colors for the Color Line Processing
es: Definición de colores para el procesamiento de líneas de color

source: The colors used to recognize and process drawing lines when doing color line processing can be defined by using the style editor or picking color values directly from the drawing you want to process.
es: Será posible definir los colores usados para la detección y procesamiento de líneas de color, mediante el uso del Editor de estilos o escogiendo los valores de color directamente desde el dibujo que se desee procesar.

source: It is possible to add colors to the list, or remove them if they are not needed anymore. The maximum number of color you can define is 7 (black included).
es: Es posible agregar colores a la lista o eliminarlos, cuando ya no fueran necesarios. La cantidad máxima de colores que es posible definir es 7 (incluyendo el negro).

source: The first color of the list, i.e. the black color, cannot be edited or removed.
es: El primer color de la lista (el negro) no podrá ser editado o eliminado.

source: **To define colors:**
es: **Para definir colores:**

source: Select the color you want to define in the list available in the Processing parameters.
es: Seleccionar el color que se desee definir en la lista de colores.

source: Define the color by doing one of the following:
es: Definir el color realizando una de las siguientes acciones:

source: Use the Style Editor (see :ref:`Editing Styles <editing_styles>` ).
es: Usar el Editor de estilos (ver :ref:`Edición de estilos <editing_styles>` ).

source: Use the **RGB Picker** tool (|RGB_picker|) to pick the value of the line color from the drawings visible in the Viewer (see :ref:`Plain Colors <plain_colors>` ).
es: Usar la herramienta **Selector de color** (|RGB_picker|) para escoger el valor de la línea de color desde los dibujos visibles en el Visor (ver :ref:`Colores <plain_colors>` ).

source: **To define colors to be assigned to lines after cleanup processing:**
es: **Para definir los colores a ser asignados a las líneas, luego del proceso de limpieza:**

source: Select the color for which you want to define the post-process color.
es: Seleccionar el color para el cual se desee definir el color posterior al proceso de limpieza.

source: At the bottom of the Style Editor select the square on the right of the current color: this is the color to be assigned after the processing is done.
es: En la sección inferior del Editor de estilos seleccionar el cuadrado a la derecha del color actual: este será el color a ser asignado luego de realizado el procesamiento.

source: Edit the color in the Style Editor.
es: Editar dicho color en el Editor de estilos.

source: **To add a color in the color list:**
es: **Para agregar un color a la lista de colores:**

source: Click the **+** button available under the color list.
es: Hacer clic en el botón **+** disponible bajo la lista de colores.

source: **To remove a color from the color list:**
es: **Para eliminar un color a la lista de colores:**

source: Select the color you want to remove from the list.
es: Seleccionar el color que se desee eliminar de la lista.

source: Click the **-** button available under the color list.
es: Hacer clic en el botón **-** disponible bajo la lista de colores.

source: Defining Camera
es: Definición de la cámara

source: |camera|
es: |camera_es|

source: The Camera parameters define the size and resolution of the camera that is used to crop and resize drawings during the cleanup process, in order to prepare and optimize them for the scene.
es: Los parámetros de Cámara permiten definir el tamaño y la resolución de la cámara que será usada para recortar y redimensionar los dibujos durante el proceso de limpieza, para prepararlos y optimizarlos para la escena.

source: For example if the cleanup camera is 1920x1080 pixels (HD 1080) with a 16 field size, the cleaned up drawings will be cropped according to the 16 field size and will have the resolution of 1920x1080 pixels.
es: Por ejemplo, si la cámara de limpieza fuera de 1920x1080 píxeles (HD 1080) con un tamaño de 16 campos, los dibujos limpiados serán recortados de acuerdo al tamaño de 16 campos y tendrá una resolución de 1920x1080 píxeles.

source: The cleanup camera definition is similar to the definition of the stage camera (see :ref:`Defining Camera Settings <defining_camera_settings>` ). Usually the two cameras have the same parameters, but sometimes you may need to define a cleanup camera that is larger than the stage camera especially if you want drawings border area to overflow the shot.
es: La definición de la cámara de limpieza es similar a la de la cámara del escenario (ver :ref:`Definición de opciones de cámara <defining_camera_settings>` ). Normalmente las dos cámaras contendrán los mismo parámetros, sin embargo algunas veces es posible que fuera necesario definir una cámara de limpieza que sea más grande que la cámara del escenario, especialmente si se necesitara que los bordes del dibujo escaparan por fuera del encuadre.

source: You can also set other parameters and options:
es: También será posible definir otros parámetros y opciones:

source: The **Closest Field** parameter (NOT AVAILABLE in OpenToonz) defines the smallest field size you will zoom into the drawing, with the camera when compositing the scene. This value is meaningful if it is smaller than the camera field size, as it increases the final image resolution, preventing zoomed-in images from appearing jagged. For example if the cleanup camera is 1920x1080 pixels (HD 1080) with a 16 field size and the **Closest Field** is set to 8, the cleaned up drawings will have to be of twice the camera resolution, that is 3840 by 2160 pixels, so that when the camera closes up, the original image pixel resolution is preserved.
es: El parámetro **Campos de acercamiento** (NO DISPONIBLE en OpenToonz) permite definir la cantidad de campos visibles en el encuadre de la cámara cuando ésta produzca su acercamiento al dibujo, al componer la escena. Este valor será tomado en cuenta sólo si fuera *menor* que el valor de campos de la cámara e incrementará la resolución final de la imagen para prevenir que ésta se vea pixelada durante el acercamiento. Por ejemplo, si la cámara de limpieza fuera de 1920x1080 píxeles (HD 1080), con un tamaño de 16 campos y el valor **Campos de acercamiento** estuviera definido en 8, la resolución de los dibujos limpiados será del doble de la resolución de la cámara, esto es 3840 por 2160 píxeles, para que cuando ésta produzca su acercamiento, los píxeles de la imagen se vean a su resolución original.

source: The **E/W** and **N/S** offset parameters shift the camera position, in case you want to define for the drawings a center different from the one automatically set by the reference field guide when the **Autocenter** is *on*, or different from the actual center of the image if the **Autocenter** is *off*; after the cleanup, the camera center will be the new center for the processed drawings.
es: Los parámetros de desplazamiento **X:** e **Y:** permiten desplazar la posición de la cámara, en caso de que se desee definir para los dibujos un centro distinto al definido automáticamente por la guía de campos de referencia, en caso de que el **Centrado automático** se encontrara *activado*, o uno diferente del centro real de la imagen, en caso de que el **Centrado automático** se encontrara *desactivado*; luego de la limpieza, el centro de la cámara se transformará en el nuevo centro de los dibujos procesados.

source: The cleanup camera size, resolution and offset can also be graphically controlled in OpenToonz's main Viewer when checking the cleanup process with the **Camera Test** mode (see :ref:`Using the Camera Test <using_the_camera_test>` ).
es: El tamaño, resolución y desplazamiento de la cámara de limpieza también podrá ser controlado interactivamente en el Visor de OpenToonz, al revisar el proceso de limpieza mediante el modo **Prueba de cámara** (ver :ref:`Uso de la Prueba de cámara <using_the_camera_test>` ).

source: Saving and Loading Cleanup Settings
es: Guardado y carga de las opciones de limpieza

source: |saveloadreset|
es: |saveloadreset_es|

source: Cleanup settings can be saved as CLN files in order to be loaded back and used in a different scene.
es: Es posible guardar las opciones de limpieza como archivos CLN, para poder ser cargados y usados en otras escenas.

source: They can also be associated specifically to an animation level by saving them in the same location and with the same name of the level: in this way the settings will be automatically displayed when the level is selected, and used every time the level is cleaned up.
es: También podrán ser asociados específicamente a un nivel de animación, guardándolos en la misma ubicación y con el mismo nombre que ese nivel: de esta forma las opciones serán mostradas automáticamente cuando el nivel sea seleccionado y usadas cada vez que el nivel sea limpiado.

source: Loaded cleanup settings can also become the default settings for the scene or for the project (see :ref:`Scene Settings and Project Default Settings <scene_settings_and_project_default_settings>` ).
es: También es posible transformar las opciones de limpieza cargadas, en las opciones predefinidas de la escena o del proyecto activo (ver :ref:`Opciones de escena y opciones predefinidas de proyecto <scene_settings_and_project_default_settings>` ).

source: **To save the cleanup settings:**
es: **Para guardar las opciones de limpieza:**

source: Select an empty cell in the Xsheet/Timeline.
es: Seleccionar una celda vacía en la Planilla/Línea de tiempo.

source: Click the **Save Settings** button in the bottom bar of the Cleanup Settings window.
es: Hacer clic en el botón **Guardar** en la sección inferior del panel Opciones de limpieza.

source: In the browser that opens choose for the CLN file a location and name, and click the **Save** button.
es: En el Explorador de archivos emergente, elegir una ubicación y nombre para el archivo CLN y hacer clic en el botón **Guardar**.

source: **To load saved cleanup settings:**
es: **Para cargar las opciones de limpieza:**

source: Click the **Load Settings** button in the bottom bar of the Cleanup Settings window.
es: Hacer clic en el botón **Cargar** en la sección inferior del panel Opciones de limpieza.

source: In the browser that opens retrieve the CLN file you want to load, and click the **Load** button.
es: En el Explorador de archivos emergente, buscar el archivo CLN que se desee cargar y hacer clic en el botón **Cargar**.

source: **To save the current cleanup settings for a specific level:**
es: **Para guardar las opciones de limpieza actuales para un nivel específico:**

source: Select any cell where the level is exposed in the Xsheet/Timeline.
es: Seleccionar alguna celda donde se encuentre expuesto el nivel en la Planilla/Línea de tiempo.

source: In the browser that opens save the CLN file in the same location and with the same name as the level, and click the **Save** button.
es: En el Explorador de archivos emergente, guardar el archivo CLN en la misma ubicación y con el mismo nombre que el nivel, luego hacer clic en el botón **Guardar**.

source: **To load cleanup settings for a specific level:**
es: **Para cargar las opciones de limpieza para un nivel específico:**

source: Click the **Save Settings** button and in the browser that opens save the CLN file in the same location and with the same name as the level, and click the **Save** button.
es: Hacer clic en el botón **Guardar** y, en el Explorador de archivos emergente, guardar el archivo CLN en la misma ubicación y con el mismo nombre que el nivel, luego hacer clic en el botón **Guardar**.

source: **To reset cleanup settings to the scene default:**
es: **Para restablecer las opciones de limpieza predefinidas de la escena:**

source: Click the **Reset Settings** button in the bottom bar of the Cleanup Settings window.
es: Hacer clic en el botón **Restablecer**, en la sección inferior del panel Opciones de limpieza.

source: Checking the Cleanup Process
es: Revisión del proceso de limpieza

source: While defining the cleanup settings it is possible to preview the full cleanup process, or perform the camera test only, in order to check the result before performing the final cleanup.
es: Mientras se definen las opciones de limpieza es posible previsualizar el resultado final o sólo realizar una prueba de cámara, para comprobar el resultado antes de realizar la limpiaza final.

source: Previewing the Cleanup Process
es: Previsualización del proceso de limpieza

source: The full cleanup process can be checked in the main Viewer.
es: Es posible comprobar el proceso de limpieza completo en el Visor principal.

source: Previewing the Cleanup Process in the Main Viewer
es: Previsualización del proceso de limpieza usando el Visor

source: A cleanup preview can be activated in the main viewer to display the drawing selected in the Xsheet/Timeline as it will be after the real cleanup process according to the defined cleanup settings, displaying at the same time all the other drawings and images exposed in the Xsheet/Timeline at that frame.
es: Es posible activar una previsualización de la limpieza en el Visor principal, para mostrar el dibujo seleccionado en la Planilla/Línea de tiempo, tal como quedará luego de efectuarse sobre él el proceso de limpieza de acuerdo a las opciones definidas, y mostrando al mismo tiempo todos los demás dibujos expuestos en la Planilla/Línea de tiempo en ese mismo fotograma.

source: If you change any parameter in the cleanup settings, the preview automatically updates to display how the changes affect the process.
es: Si se cambiara cualquier parámetro en las opciones de limpieza, la previsualización se actualizará automáticamente para mostrar cómo dichos cambios afectarán al proceso.

source: The **Opacity Check** when activated, affects also the cleanup preview in the main Viewer (see below ).
es: Al activar la opción **Comprobación de opacidad**, también se afectará la previsualización en el Visor principal (ver más abajo).

source: The **Preview Cleanup** and the **Camera Test** checks cannot be activated at the same time: when one is activated the other one is automatically deactivated.
es: Las opciones **Previsualizar limpieza** y **Prueba de cámara** no podrán ser activadas al mismo tiempo: cuando una de ellas estuviera activa, la otra se desactivará automáticamente.

source: **To activate the cleanup preview in the main Viewer:**
es: **Para activar la previsualización de limpieza en el Visor principal:**

source: In the Xsheet/Timeline select the scanned drawing you want to preview, and choose Scan & Cleanup → **Preview Cleanup**.
es: En la Planilla/Línea de tiempo, seleccionar el dibujo escaneado que se desee previsualizar y elegir Escaneo y limpieza → **Previsualizar limpieza**.

source: **To deactivate the cleanup preview in the main Viewer:**
es: **Para desactivar la previsualización de limpieza en el Visor principal:**

source: Choose Scan & Cleanup → **Preview Cleanup**.
es: Elegir Escaneo y limpieza → **Previsualizar limpieza**.

source: **To preview a different drawing:**
es: **Para previsualizar otro dibujo:**

source: Select it in the Xsheet/Timeline.
es: Seleccionarlo en la Planilla/Línea de tiempo.

source: **To exit the preview cleanup mode:**
es: **Para salir del modo de previsualización de limpieza:**

source: Choose Scan & Cleanup → **Preview Cleanup** to deactivate it.
es: Elegir Escaneo y limpieza → **Previsualizar limpieza** para desactivarlo.

source: Using the Opacity Check
es: Uso de la Comprobación de opacidad

source: When calibrating the line processing it is important to check the amount of antialiasing along the drawing outline to understand how smooth the result will be, and to check the small spots and marks that are removed from the drawing because of the **Despeckling:** function (see :ref:`Defining Line Processing Parameters <defining_line_processing_parameters>` ).
es: Al calibrar el procesamiento de líneas es importante comprobar la cantidad de suavizado de bordes presente a lo largo de los contornos del dibujo, para entender qué tan suave será el resultado final, así como para revisar las pequeñas manchas y marcas que serán removidas debido a la función de **Desmanchado:** (ver :ref:`Definición de parámetros de procesamiento de líneas <defining_line_processing_parameters>` ).

source: The **Opacity check**, when activated, displays fully solid pixels in *black*, and semi-transparent pixels belonging to the line antialiasing in *red*; moreover pixels that will be removed because of the **Despeckling:** function are displayed in *green*.
es: Al ser activada, la **Comprobación de opacidad** mostrará los píxeles totalmente sólidos en color *negro*, mientras que los semi transparentes pertenecientes al suavizado de bordes aparecerán en color *rojo*; además los píxeles que serán eliminados debido a la función **Desmanchado:** se mostrarán en color *verde*.

source: The check is visible both in the *preview area* (NOT AVAILABLE in OpenToonz) of the Cleanup Settings pane, and with the **Preview Cleanup** mode, in the *main Viewer*.
es: La comprobación será visible tanto en el área de previsualización del panel de Opciones de limpieza (NO DISPONIBLE en OpenToonz), como durante la **Previsualización de limpieza** en el Visor principal.

source: **To activate and deactivate the opacity check:**
es: **Para activar o desactivar la comprobación de opacidad:**

source: Choose Scan & Cleanup → **Opacity Check** or press its default shortcut **Alt + 1**.
es: Elegir Escaneo y limpieza → **Comprobación de opacidad** o presionar su atajo predefinido **Alt + 1**.

source: Using the Camera Test
es: Uso de la Prueba de cámara
