Repository: WizzerWorks/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/cleaning-up_scanned_drawings.po
Languages: es

source: Click the **Add Cleanup Task** button (|add_cleanup|) in the bottom bar of the Tasks pane and use the browser to select a scene file.
es: Hacer clic en el botón **Limpieza** (|add_cleanup|) en la barra superior del panel Tareas y usar el Explorador de archivos para seleccionar un archivo de escena.

source: Select the scenes in the OpenToonz Browser, then right-click any of them and choose **Add As Cleanup Task** from the menu that opens.
es: Seleccionar las escenas en el Explorador de archivos de OpenToonz, luego hacer clic derecho sobre alguna de ellas y elegir **Agregar como tarea de limpieza** en el menú.

source: **To configure the cleanup task in the task list:**
es: **Para configurar una tarea de limpieza en la lista de tareas:**

source: Select the cleanup task in the task list.
es: Seleccionar una tarea de limpieza en la lista de tareas.

source: Configure it by using the options available on the right of the list.
es: Configurarla usando las opciones disponibles a la derecha de la lista.

source: **To select tasks in the task list:**
es: **Para seleccionar tareas en la lista de tareas.**

source: Click a task to select it.
es: Hacer clic sobre una tarea para seleccionarla.

source: Shift-click a task to extend the selection up to that task.
es: Hacer Mayúsculas-clic para extender la selección hasta esa tarea.

source: Ctrl-click (PC) or Cmd-click (Mac) a task to add it to, or remove it from the selection.
es: Hacer Ctrl-clic (PC) o Cmd-clic (macOS) sobre una tarea para agregar o quitarla de la selección.

source: **To execute selected tasks:**
es: **Para ejecutar las tareas seleccionadas:**

source: Click the **Start** button (|start|) in the bottom bar of the pane.
es: Hacer clic en el botón **Iniciar** (|start|) en la barra superior del panel Tareas.

source: Right-click any selected task icons and choose **Start** from the menu that opens.
es: Hacer clic derecho sobre alguna se las tareas seleccionadas y elegir **Iniciar** en el menú.

source: **To stop the execution of selected tasks:**
es: **Para detener la ejecución de las tareas seleccionadas:**

source: Click the **Stop** button (|stop|) in the bottom bar of the pane.
es: Hacer clic en el botón **Detener** (|stop|) en la barra superior del panel Tareas.

source: Right-click any selected task icon and choose **Stop** from the menu that opens.
es: Hacer clic derecho sobre alguna se las tareas seleccionadas y elegir **Detener** en el menú.

source: **To remove selected tasks from the list:**
es: **Para eliminar las tareas seleccionadas de la lista:**

source: Click the **Remove** button (|remove|) in the bottom bar of the Tasks pane.
es: Hacer clic en el botón **Eliminar** (|remove|) en la barra superior del panel Tareas.

source: Right-click any selected task in the list and choose **Remove** from the menu that opens.
es: Hacer clic derecho sobre alguna se las tareas seleccionadas y elegir **Eliminar** en el menú.

source: **To add tasks to the Dependencies list:**
es: **Para agregar tareas a la lista de Dependencias:**

source: Select a task in the list on the right and click the **<< Add** button.
es: Seleccionar una tarea en la lista de la derecha y hacer clic en el botón **<< Agregar**.

source: **To remove tasks from the Dependencies list:**
es: **Para eliminar tareas de la lista de Dependencias:**

source: Select a task in the list on the left and click the **Remove >>** button.
es: Seleccionar una tarea en la lista de dependencias de la izquierda y hacer clic en el botón **Eliminar >>**.
