Repository: WizzerWorks/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/create_animations_using_plastic_tool.po
Languages: es

source: Go to the Stage Schematic and select the node of the column/layer that has to be linked. Click on the small square on its left side, and drag to one of the small squares on the right side of the Plastic modified node target of the link. Now the two levels are linked but the reference points for the link are probably wrong (by default the column/layer centers are used).
es: Ir al Diagrama de escenario y seleccionar el nodo de la columna/capa que deba ser subordinada. Hacer clic en el pequeño cuadrado en su lado izquierdo y arrastrar hasta uno de los cuadrados similares, en el lado derecho del nodo modificado por la herramienta plástico que se convertirá en su superior. Ahora ambos niveles estarán vinculados, pero probablemente los puntos de referencia para el vínculo estén mal (de forma predefinida estarán usando los centros de sus columnas/capas).

source: Hover on the small square on the left side of the node of the standard level until two small arrows (pointing up and down) appear.
es: Posar el puntero del ratón sobre el pequeño cuadrado del lado izquierdo del nodo del nivel normal, hasta que se muestren dos pequeñas flechas (apuntando hacia arriba y abajo).

source: Click on the arrows and drag to change the value in the small square. Stop when **the number of the hook point** that has to be used as pivot point is reached. In the Viewer the level moves using the chosen point as new center.
es: Hacer clic sobre las flechas y arrastrar para cambiar el valor en el cuadrado. Detenerse al alcanzar **el número del enganche** que deba ser usado como pivote. En el Visor, el nivel se desplazará para usar el punto elegido como su nuevo centro.

source: Do the same procedure of point 5 on the small square on the right of the Plastic modified node that was used as target for the link. Select **the number of the skeleton vertex** that has to be used as target reference point for the link. Into the Viewer the standard level moves to overlap the position of the hook point selected as reference to the position of the skeleton vertex selected on the Plastic modified level.
es: Realizar el mismo procedimiento que en el paso 5, sobre el cuadrado a la derecha del nodo modificado con Plástico, que haya sido usado como superior en el vínculo. Seleccionar allí **el número del vértice del esqueleto** que deba ser usado como punto de referencia para el vínculo. En el Visor, el nivel subordinado se desplazará para superponer la posición de su propio enganche, con la del vértice elegido en el esqueleto Plástico del nivel superior.

source: A mirror procedure can be used for linking a Plastic modified level to a standard level.
es: Será posible utilizar un procedimiento a espejo, para subordinar un nivel modificado con la herramienta Plástico a un nivel normal.

source: **To link Plastic modified levels**
es: **Para vincular niveles modificados con la herramienta Plástico:**

source: The procedure requires that all the levels involved and that need to be linked using determined positions, have at least one skeleton built and one of its vertices has to be positioned at the desired spot for the linking. As said, the Hook tool doesn’t work on the Plastic modified levels so, for exact positioning, skeleton vertices are needed as reference points both on the source and on the target of the link.
es: El procedimiento requerirá que todos los niveles involucrados, que necesiten ser vinculados usando posiciones específicas, contengan al menos un esqueleto y que uno de los vértices del mismo se encuentre posicionado en el punto deseado para el vínculo. Como se mencionó anteriormente la herramienta Enganche no funciona en los niveles modificados con Plástico, de manera que para poder posicionar de forma exacta se necesitará hacer uso de los vértices de un esqueleto, tanto en el objeto subordinado, como en el superior de la jerarquía.

source: Go to the Stage Schematic and select the node of the column/layer that has to be linked. Click on the small square on its left side, and drag to one of the small squares on the right side of the target of the link. Now the two levels are linked but the reference points for the link are probably wrong (by default the column/layer centers are used).
es: Ir al Diagrama de escenario y seleccionar el nodo de la columna/capa que deba ser subordinada. Hacer clic en el pequeño cuadrado a su izquierda y arrastrar hasta uno de los pequeños cuadrados similares del lado derecho del nodo superior. Ahora ambos niveles estarán vinculados, pero probablemente los puntos de referencia para el vínculo estén mal (de forma predefinida estarán usando los centros de sus columnas/capas).

source: Hover on the small square on the left of the node of the first node until two small arrows appear.
es: Posar el puntero del ratón sobre el pequeño cuadrado del lado izquierdo del nodo subordinado, hasta que se muestren dos pequeñas flechas (apuntando hacia arriba y abajo).

source: Click on the arrows and drag to change the value in the small square. Stop when **the number of the skeleton vertex** point that has to be used as pivot point is reached. In the Viewer the level adjusts its position in respect of the new selected center.
es: Hacer clic sobre las flechas y arrastrar para cambiar el valor en el cuadrado. Detenerse al alcanzar **el número del enganche** que deba ser usado como pivote. En el Visor, el nivel se desplazará para usar el punto elegido como su nuevo centro.

source: Do the same procedure of point 3 on the small square on the right of the Plastic modified node that was used as target for the link. Select **the number of the skeleton vertex** that has to be used as target reference point for the link. Into the Viewer the first level moves to overlap the position of its selected skeleton vertex to that of the target skeleton vertex just selected.
es: Realizar el mismo procedimiento que en el paso 3, sobre el cuadrado a la derecha del nodo superior. Seleccionar allí **el número del vértice del esqueleto** que deba ser usado como punto de referencia para el vínculo. En el Visor, el nivel subordinado se desplazará para superponer la posición de su propio vértice seleccionado, con la del vértice elegido en el nivel superior.

source: Function Editor representation of Plastic data
es: Uso del Editor de funciones con datos de Plástico

source: While animating Plastic elements, keyframes are created for the vertices of the skeleton. You can see them as standard keyframes in the Xsheet/Timeline, or you can operate on the values of each vertex into the Function Editor.
es: Al animar elementos de la herramienta Plástico, se crearán fotogramas clave para los vértices del esqueleto. Será posible verlos como claves estándar en la Planilla/Línea de tiempo, así como editar individualmente los valores de cada vértice a través del Editor de funciones.

source: The keyframess of the Xsheet/Timeline mark a keyframe for the Plastic skeleton at the specified frame, but don’t give any information about the number of vertices involved or their actual keyframed properties; they can be indifferently, one, some or all. Moving these keyframes you can easily change the timing of the whole animation.
es: Los claves de la Planilla/Línea de tiempo serán vistos en el fotograma adecuado pero no se obtendrá ninguna información acerca de la cantidad de vértices involucrados o de sus propiedades específicas animadas; podrían ser indistintamente todas, alguna o tan sólo una. Al desplazar estos claves se podrá cambiar de forma sencilla la temporización de la animación.

source: The keyframes into the Function Editor are more detailed, giving you the chance for fine-tuning and modify each vertex parameter animation.
es: Los claves en el Editor de funciones, en cambio, brindarán una información mucho más detallada, permitiendo realizar retoques sutiles y modificar la animación de cada parámetro de los vértices.

source: When in the Function Editor Tree, you open the folder of a column/layer that has the Plastic tool applied, you can see a **Plastic Skeleton** folder. This folder contains the **Skeleton Id** channel, the **Root** subfolder, and one subfolder *for each vertex* of the Plastic skeleton, labeled with the name of the related vertex.
es: Cuando, en el árbol del Editor de funciones, se abre la carpeta correspondiente a una columna/capa modificada con Plástico, será posible ver una carpeta **Esqueleto de plástico**. La misma contendrá el canal **Skeleton Id**, la subcarpeta **Root** y una subcarpeta *por cada vértice* del esqueleto con el mismo nombre del vértice al que haga referencia.

source: The **Skeleton Id** channel contains the data related to which skeleton is active at a certain frame. If the level is using multiple skeletons here you can see the switches from one skeleton to the other, both as numeric values and in a graphical format.
es: El canal **Skeleton Id** contendrá los datos relativos a cuál es el esqueleto activo en un cierto fotograma. Si el nivel usara varios esqueletos, aquí se podrá ver y editar los cambios de uno a otro, tanto en forma numérica, como gráfica mediante el Editor de gráficas.

source: The **Root** subfolder shows all the parameter channels, but only the **SO** (Staking Order) parameter can be animated when this vertex is actually used as root of the skeleton
es: La subcarpeta llamada **Root** (de forma predefinida, siempre y cuando el nombre del primer vértice del esqueleto no hubiera sido cambiado), mostrará todos los canales de sus parámetros, aunque únicamente el parámetro **SO** (Orden) podrá ser animado, cuando este vértice esté siendo realmente usado como raíz de todo el esqueleto.

source: The **Vertex** subfolders (one for each vertex of the skeletons), contain three parameters: **Angle**, **Distance** and **SO**, that are used to determine the position of the vertex at every frame during the animation.
es: Las subcarpetas **Vertex** (una por cada vértice de los esqueletos existentes en el nivel), contendrán tres parámetros: **Ángulo**, **Distancia** y **Orden**, que serán usados para determinar la posición del vértice en cada fotograma, durante la animación.

source: The values of these parameters can be visualized in the Function Editor as a spreadsheet or as curves, and modified as required.
es: Los valores de estos parámetros podrán ser visualizados en el Editor de funciones, en formato de planilla de tiempos o gráficas y ser modificados como sea necesario.

source: The vertices of multiple skeletons are shown as a single list, and *not grouped* for each skeleton. In this way the animation curve of *Vertex_1* is built using the animation values of the vertices named *Vertex_1* of all the skeletons of the mesh, so just one curve can be modified to adjust the animation of related vertices on different skeletons.
es: Los vértices de los varios esqueletos existentes en el nivel se mostrarán como una única lista, y *no agrupados* por el esqueleto al cual pertenezcan. De esta forma la curva de animación de, por ejemplo, el vértice *Vertex_1* se construirá usando los valores de animación de los vértices llamados *Vertex_1* en todos los esqueletos de la malla, para que sea posible que modificando una sola curva se ajuste la animación de los vértices correlativos en cada esqueleto.

source: Use Mathematical Expressions in Plastic Animation
es: Uso de Expresiones matemáticas en animación con Pástico

source: To use OpenToonz mathematical expressions in the Plastic Animation, you can link the vertices of the skeleton to each other or to a column/layer, pegbar or camera.
es: Para usar expresiones matemáticas de OpenToonz con animación realizada mediante la herramienta Plástico, será posible vincular los vértices de un esqueleto Plástico entre sí o a otra columna/capa, barra de sujeción o cámara.

source: This allows to set some automatic actions of the skeleton, for example you can link the main vertices of the shoulders, so that moving just one shoulder automatically moves the other.
es: Esto permitirá establecer algunas acciones automáticas en el esqueleto, por ejemplo se podrá vincular los vértices principales de los hombros, para que al mover uno de ellos, el otro lo haga automáticamente.

source: Suppose that the main vertices of the shoulders are named *Shoulder_left* and *Shoulder_right*, and the Mesh is in column 2 of the Xsheet (or layer 2 of the Timeline). You can set the rotation of *Shoulder_left* vertex to be the same amount of that of *Shoulder_right*, by setting in the Function Editor the following expression in the **Angle** parameter of *Shoulder_left*:
es: Supóngase que los vértices principales de los hombros fueran denominados *Hombro_izq* y *Hombro_der*, y la Malla estuviera en la columna 2 de la Planilla (o la capa 2 de la Línea de tiempo). Será posible establecer que la rotación del vértice *Hombro_izq* tenga la misma magnitud que la del *Hombro_der*, ingresando en el Editor de funciones la siguiente expresión, en el parámetro **Ángulo** del vértice *Hombro_izq*:

source: ``vertex(2, "Shoulder_right").angle``
es: ``vertex(2, "Hombro_der").angle``

source: If you prefer the rotation of the left shoulder to react opposite to the one of the right shoulder, you could add a multiplication as following:
es: Si se prefiriera que la rotación del hombro izquierdo reaccionara de manera opuesta a la del derecho, podría agregarse una multiplicación, tal como se muestra a continuación:

source: ``vertex(2, "Shoulder_right").angle*-1``
es: ``vertex(2, "Hombro_der").angle*-1``

source: The general syntax is:
es: La sintaxis general es:

source: **vertex(column_number, "vertex_name").parameter**
es: **vertex(número_de_columna, "nombre_del_vértice").parámetro**

source: For more information about the *mathematical expressions* usage refer to (See :ref:`Using Interpolations Based on Expressions <using_interpolations_based_on_expressions>` ).
es: Para más información acerca del uso de *expresiones matemáticas* en OpenToonz (consultar :ref:`Uso de interpolación basada en un Expresión <using_interpolations_based_on_expressions>` ).

source: Plastic and Sub-Xsheets
es: Plástico y sub-planillas

source: A Sub-Xsheet is a valid object for the Plastic tool, and all or some of its columns can have a mesh for animating. When a Sub-Xsheet is selected as a starting element, all of the columns in the Sub-Xsheet visible when the **Create Mesh** button is pressed, are taken into count for the creation of the Mesh. These levels will be visible in render and will be deformed by Mesh transformations. If, after creating the Mesh, hidden levels are set to visible, they will behave in a slightly different way: they will be deformed by Mesh transformations, but they will be shown in render *only inside the mesh boundaries* (i.e. the Mesh acts as a *mask* that determines what is visible in the rendered image, even if the newly-shown levels are placed into a nested Sub-Xsheet with its own mesh and skeleton).
es: Una sub-planilla será un objeto válido para su uso con la herramienta Plástico, y todas o algunas de sus columnas/capas podrán contener mallas que podrán ser animadas. Cuando se selecciona una sub-planilla como elemento inicial, todas sus columnas/capas visibles al momento de presionar el botón **Crear malla** serán tomadas en cuenta para la creación de la Malla. Estos niveles estarán visibles durante el procesamiento final y serán deformados por las transformaciones hechas a la Malla. Si luego de creada la Malla, se hicieran visibles niveles anteriormente ocultos de la sub-planilla, éstos serán deformados por las transformaciones de la Malla, sin embargo sólo se mostrarán *dentro de los contornos de la malla* (en otras palabras, la Malla actuará como una *máscara* que determinará qué será visible en la imagen final). En caso de que dentro de la sub-planilla hubiera niveles modificados con Plástico, también podrán ser animados, pero su visibilidad quedará enmascarada por la Malla del nivel en la Planilla/Línea de tiempo principal, al igual que con el resto de los niveles de dicha sub-planilla. De ser necesario, será posible recrear la Malla para tomar en cuenta los nuevos contenidos visibles en la sub-planilla.
