Repository: WizzerWorks/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/creating_cutout_animation.po
Languages: es

source: Creating Cutout Animation
es: Creación de animación de recortes

source: Cutout animation is based on characters made of several sections connected together to create a character model. For example a basic model can be made of a drawing for the head, one for the body, one for each arm, and one for each leg.
es: La animación de recortes se basa en personajes construidos a partir de varias partes conectadas entre si, para crear un modelo completo. Por ejemplo, un modelo simple podría estar compuesto por un dibujo para la cabeza, uno para el cuerpo, uno para cada brazo y uno para cada pierna.

source: Animations in this case can be created not by adding drawings depicting the new animated poses, but by transforming (i.e. moving or rotating) the model sections individually at different frames, in order to create different actions.
es: En este caso será posible crear animaciones, no mediante la adición de dibujos sucesivos representando cada nueva pose, sino mediante la transformación (movimiento, rotación, etc.) de las partes individuales del modelo en diferentes fotogramas, para crear las acciones deseadas.

source: In OpenToonz it's possible to create links between a model's different sections and to set pivot points for each one of them, in order to better manage the animation. For example, you can link a hand to an arm at the wrist, and link the arm to the trunk at the shoulder: in this way when you move the trunk, you will move both arm and hand as well; when you move the arm, it will turn around the shoulder and the hand will follow its movement; when you move the hand, it will turn around the wrist.
es: En OpenToonz es posible crear vínculos entre las distintas partes de un modelo y establecer puntos de pivote para cada una de ellas, pudiendo así manipular su animación de una forma más conveniente. Por ejemplo, será posible vincular una mano con un brazo, a la altura de la muñeca, y vincular el brazo con el torso, en el hombro: de esta manera al mover el tronco, se moverá también el brazo y la mano; al mover el brazo rotará alrededor del hombro; y al mover la mano rotará alrededor de la muñeca.

source: **To create a cutout animation:**
es: **Para crear animación de recortes:**

source: Place each section (that can be a single drawing or an animated level) of your character in a different column/layer.
es: Posicionar cada parte (que podrá ser un nivel de animación de uno o más dibujos) del personaje en una columna/capa distinta.

source: Use the **Skeleton** tool (|skeleton|) to link each section to the other and set the related pivot points.
es: Usar la herramienta **Esqueleto** (|skeleton|) para vincular cada parte a otra y establecer los puntos de pivote correspondientes.

source: Create keyframes for each section at different frames to animate the cutout character.
es: Crear fotogramas clave para cada parte en diferentes fotogramas, para animar el personaje de recortes.

source: Using the Skeleton Tool
es: Uso de la herramienta Esqueleto

source: The **Skeleton** tool (|skeleton|) allows you to define a model by setting hierarchical links between its different sections exposed in different Xsheet columns (or Timeline layers), and animate it.
es: La herramienta **Esqueleto** (|skeleton|) permite definir un modelo, estableciendo vínculos jerárquicos entre sus diferentes partes, expuestas en distintas columnas de la Planilla (o capas de la Línea de tiempo), para luego animarlas.

source: It basically makes possible, by using a single and more immediate tool, the same tasks that could be achieved by using the Stage Schematic and the **Animate** tool (|animate|), when used to create links and animate the transformations of columns/layers (see :ref:`Linking Objects <linking_objects>` ). Indeed, any editing performed with the **Skeleton** tool (|skeleton|) can also be seen happening in the Stage Schematic and the columns/layers transformation values, and vice versa.
es: Básicamente posibilita, a través de una única herramienta de uso simple, las mismas tareas que podrían ser llevadas a cabo mediante el Diagrama de escenario y la herramienta **Animar** (|animate|), permitiendo tanto crear vínculos como animar las transformaciones de las columnas/capas (ver :ref:`Vinculación de objetos <linking_objects>` ). De hecho, podrán verse los resultados de cualquier edición realizada con la herramienta **Esqueleto** (|skeleton|), en el Diagrama de escenario y los valores de las transformaciones de las columnas/capas, y viceversa.

source: In the tool options bar you can set the following:
es: En la barra de opciones de la herramienta, podrán verse las siguientes opciones:

source: **Mode** sets the operation to perform with the tool. Options are: **Build Skeleton**, to create links between the different sections, **Animate**, to animate the character model, and **Inverse Kinematics**, to animate the character model using inverse kinematics.
es: **Modo:**, permite definir el tipo de operación a ser llevada a cabo con la herramienta. Sus opciones son: **Crear esqueleto**, para crear vínculos entre las diferentes partes de un modelo, **Animar**, para animar el modelo, e **Cinemática inversa**, para animar un modelo usando la técnica conocida como cinemática inversa.

source: **Global Key** when activated sets a key for all the object transformations as soon as a key is defined by animating the skeleton. This means that if you rotate a model section, automatically a key will be defined for the position, scaling and shearing transformations as well.
es: **Clave global**, cuando esté activada permitirá marcar un fotograma clave para todas las transformaciones del objeto seleccionado, inmediatamente después de animarlo usando su esqueleto. Esto significa que si se rotara una parte del modelo, automáticamente se marcarían también fotogramas clave para su posición, escala e inclinación.

source: **Show Only Active Skeleton** when activated displays only the pivot points and the skeleton from the current section up to the parent section: in this way it will be easier to manage characters with skeletons of a higher complexity.
es: **Mostrar sólo esqueleto activo**, cuando esté activada mostrará sólo los puntos de pivote y el esqueleto desde la parte seleccionada hasta la parte superior: de esta forma se facilitará la manipulación de modelos con esqueletos de una complejidad elevada.

source: Building a Skeleton
es: Construcción de un esqueleto

source: When the **Skeleton** tool (|skeleton|) mode is set to **Build Skeleton**, it's possible to set pivot points and links between sections by using the handle available in the Viewer.
es: Cuando el Modo de la herramienta **Esqueleto** (|skeleton|) se encuentre definido en **Crear esqueleto**, será posible definir los puntos de pivote y vínculos de las distintas partes de un modelo, mediante el uso del manipulador disponible en el Visor.

source: The handle is made of a small circle, with an arm that by default extends upwards. This allows you to perform the following tasks:
es: El manipulador está compuesto de un círculo pequeño, con un brazo que, de forma predefinida, se extenderá hacia arriba. Esto permitirá realizar las siguientes tareas:

source: Click and drag the **yellow circle** to set the pivot point position.
es: Arrastrar el **círculo amarillo**, para definir la posición del punto de pivote.

source: Click and drag the **square** at the end of the extended arm to set the link to another section.
es: Arrastrar el **cuadrado** en el extremo del brazo, para definir su vínculo con otra parte del modelo.

source: The section pivot point can be moved, but *cannot* change its position during the animation: once it is set, or modified, it is retained during all the animation. If the pivot point is changed many times, and you want to set it back to its original position, right-click the section in the Stage Schematic and choose **Reset Center** from the menu that opens.
es: El punto de pivote de una parte podrá ser reubicado, pero *no podrá* cambiar su posición durante la animación: una vez definido, o cambiado, su posición permanecerá estable durante todas la animación. Si el punto de pivote fuera cambiado varias veces y se deseara devolverlo a su posición original, hacer clic derecho sobre el nodo correspondiente a esa parte, en el Diagrama de escenario, y elegir **Restablecer centro** en el menú.

source: The handle refers to the current section; when you link a section to another, the link is graphically displayed connecting the centers of the two sections. When one or several sections are linked, all their links and the related centers, are displayed as well, configuring the skeleton for the model.
es: El manipulador hará referencia siempre a la parte seleccionada; al vincular una parte con otra, el vínculo será mostrado conectando los centros de ambas partes. Cuando una o más partes se encontraran vinculadas, todos sus vínculos y centros respectivos serán también mostrados, conformando el esqueleto del modelo.

source: Creating Basic Models
es: Creación de modelos simples

source: A basic model is made of sections linked to each other by their centers. It's simpler to create if compared to a model based on hooks (see :ref:`Creating Models with Hooks <creating_models_with_hooks>` ), and has some limitations, but it is suitable for most of the cases of cutout animation.
es: Un modelo simple podrá estar compuesto por partes vinculadas entre si, desde sus centros. Será más sencillo de crear, comparado con uno creado usando enganches (ver :ref:`Creación de modelos con Enganches <creating_models_with_hooks>` ), y presentará algunas limitaciones, pero igualmente podrá ser apropiado para muchos de los casos a resolver mediante animación de recortes.

source: By default each section has a *center* that's placed at the center of the viewer. When creating a model, this center has to be moved to where the pivot point for that specific section has to be.
es: De forma predefinida cada parte del modelo tiene un *centro* ubicado en el centro del Visor. Al crear un modelo, este centro deberá ser movido a donde deba estar el pivote para esa parte específica del mismo.

source: The **Skeleton** tool (|skeleton|) allows you, both, to change the center position of the currently selected model section, and to link it to the center of another section visible in the Viewer.
es: La herramienta **Esqueleto** (|skeleton|) permitirá, tanto modificar la posición del *centro* de la parte seleccionada del modelo, como vincularla al *centro* de otra de las partes, que se encuentre visible en el Visor.

source: Usually it's simpler to start working from the parent section, then link the other sections one by one, following one limb at a time. For example first set the center of the model trunk, then set the arm pivot point and link the arm to the trunk, then set the forearm pivot point and link the forearm to the arm, then set the hand pivot point and link the hand to the forearm, and so on.
es: Usualmente (en términos jerárquicos) será más sencillo comenzar a armar un modelo desde su parte superior, e ir vinculando las otras partes una a una, de a una extremidad a la vez. Por ejemplo, comenzar definiendo el centro del torso del modelo, luego definir el punto de pivote de un brazo y vincular el brazo al torso, luego definir el pivote del antebrazo correspondiente y vincularlo al brazo, luego definir el pivote de la mano y vincularla al antebrazo, y así sucesivamente.

source: In case the sections of your model are drawn in the right place, setting the pivot points and the links is all you have to do to define a skeleton. If they are not, you can set the section right position either before or after setting links by using the **Animate** tool or the **Skeleton** tool in **Animate** mode (see :ref:`Animating Objects <animating_objects>` and :ref:`Animating Models <animating_models>` ).
es: En caso de que las partes del modelo estuvieran dibujadas en el lugar apropiado, todo lo que restaría por hacer para definir un esqueleto, sería definir los puntos de pivote y los vínculos. Si no lo estuvieran, será posible establecer su posición correcta tanto antes como después de definir los vínculos, mediante el uso de las herramientas **Animar** o **Esqueleto** (en modo **Animar**) (ver :ref:`Animación de objetos <animating_objects>` y :ref:`Animación de modelos <animating_models>` ).

source: **To select a model section:**
es: **Para seleccionar una parte de un modelo:**

source: Select the **Skeleton** tool (|skeleton|), set the mode to **Build Skeleton**, and click the section in the Viewer.
es: Seleccionar la herramienta **Esqueleto** (|skeleton|), definir su Modo: en **Crear esqueleto**, y hacer clic sobre la parte deseada en el Visor.

source: **To set the pivot point of the selected section:**
es: **Para definir el punto de pivote de la parte seleccionada:**

source: *Click and drag* the **yellow circle**.
es: *Arrastrar* el **círculo amarillo**.

source: **To Link the selected section to another section:**
es: **Para vincular la parte seleccionada del modelo a otra parte:**

source: *Click and drag* the **square** at the top of the handle to the section you want to be parent. The section you drag to is highlighted by displaying its bounding box and a label displays information about the link you are going to create.
es: *Arrastrar* el **cuadrado** en la parte superior del manipulador hasta la parte que se desee transformar en su superior en la jerarquía. La parte del modelo hacia la que se está efectuando el arrastre será resaltada, mostrando su marco delimitador y una etiqueta con información acerca del vínculo que está a punto de ser creado.

source: Release to set the link.
es: Soltar para definir el vínculo.

source: **To Break the link between the selected section and its parent:**
es: **Para desvincular la parte seleccionada del modelo de su superior:**

source: *Click and drag* the **square** at the middle of the graphical link between the linked sections away from the parent one.
es: *Arrastrar* el **cuadrado** visible en el centro de la unión entre ambas partes hacia otro lado.

source: **To visualize only the skeleton from the current section up to the parent section:**
es: **Para visualizar sólo la porción del esqueleto desde la parte seleccionada hasta la superior:**

source: Activate the **Show Only Active Skeleton** option in the tool options bar.
es: Activar la opción **Mostrar sólo esqueleto activo** en la barra de opciones de la herramienta.

source: Creating Models with Hooks
es: Creación de modelos con Enganches

source: Sometimes basic models may not produce the desired results because the positions of the pivot points in the skeleton are fixed, and therefore cannot follow the changes of model sections which are animated levels themselves.
es: Algunas veces un modelo simple no producirá el resultado deseado, debido a que las posiciones de sus puntos de pivote en el esqueleto se encuentran fijas, y por lo tanto no podrán seguir los cambios en otras partes que estén animadas en sí mismas (cambiando su forma de un fotograma a otro).

source: For example suppose you have a character whose trunk is an animated level made of several drawings of the trunk bending: as the animation of the trunk goes on, the limbs linked to it will not follow the movement of the trunk (because the trunk is neither moving nor rotating in terms of its transformation values).
es: Por ejemplo, en caso de tener un personaje cuyo torso sea un nivel animado, compuesto de varios dibujos del torso flexionándose: a medida que la animación del torso avance, las extremidades vinculadas a él no podrán seguir el movimiento del mismo (debido a que el nivel no estará cambiando su posición ni su rotación, en términos de sus valores de transformación).

source: By using hooks you can specify, drawing by drawing, where the pivot points have to be placed: in this way the model will maintain its consistency even when different drawings from an animation level are used, during the course of the action (see :ref:`Using Hooks <using_hooks>` ).
es: Mediante el uso de enganches será posible especificar, dibujo a dibujo, donde deberán estar ubicados los puntos de pivote: de esta forma el modelo podrá mantener su consistencia, inclusive cuando se usen distintos dibujos para un nivel de animación, durante el curso de la acción (ver :ref:`Uso de Enganches <using_hooks>` ).

source: For example, by placing hooks on the drawings of the trunk and on the limbs (where they have to be connected), and defining the links by using hooks instead of centers, the limbs will follow the trunk even if it is bending.
es: Por ejemplo, mediante la colocación de enganches en los dibujos del torso y en las extremidades (donde deban conectarse mutuamente) y definiendo los vínculos de un enganche a otro, en vez de entre sus centros, las extremidades serán capaces de seguir al torso, aunque éste se esté moviendo.

source: The **Skeleton** tool (|skeleton|) allows you, both, to set a hook as the pivot point for the section, and to link it to a specific hook of another section visible in the Viewer.
es: La herramienta **Esqueleto** (|skeleton|) permite, tanto definir un enganche como punto de pivote de la parte seleccionada del modelo, como vincularla a un enganche de otra de las partes visibles en el Visor.

source: Hooks have to be placed for each character model section where you want the joints to be. For example, a trunk may have five hooks, one for the head, two for the arms and two for the legs; a forearm may have two hooks, one for the elbow and one for the wrist.
es: Los enganches deberán ser ubicados, para cada parte del modelo de un personaje, donde se desee que se encuentren las articulaciones del mismo. Por ejemplo, un torso podría tener 5 enganches, uno para la cabeza, dos para los brazos y dos para las piernas; un antebrazo podría tener dos enganches, uno para el codo y otro para la muñeca.

source: When using the **Hook** tool (|hook|) for defining hooks for the model sections, the **Snap** option can be activated (see :ref:`Using Hooks <using_hooks>` ). In this way it's possible to place hooks exactly in the same position of hooks already defined for other animation levels visible in the Viewer, or, in case the level is a Toonz Vector level, at the center of closed shapes (e.g. rectangles, circles or single vector shapes closed with the **Tape** tool).
es: Al usar la herramienta **Enganche** (|hook|) para definir enganches para las partes de un modelo, la opción **Adherencia** podrá ser activada (ver :ref:`Uso de Enganches <using_hooks>` ). De esta forma será posible ubicar enganches exactamente en la misma posición de enganches definidos para otros niveles de animación visibles en el Visor o, en caso de que el nivel fuera de tipo Vectorial de Toonz, en el centro de formas cerradas que pudiera contener (p.ej: rectángulos, círculos o formas compuestas por un único vector cerradas con la herramienta **Cinta**).

source: This means that, in case the model sections are drawn in the right place, you can define perfectly overlapping hooks, so that limbs preserve their position when hooks are linked; or you can use regular shapes in Toonz Vector drawings (such as circles), to define the overlapping areas of the model limbs, and consequently place hooks exactly at their center to achieve a perfect match when hooks are linked.
es: Esto significa que, en caso de que las partes del modelo estuvieran dibujadas en el lugar correcto, será posible definir enganches que se superpongan de manera precisa, para que las extremidades preserven sus posiciones cuando éstos sean vinculados entre sí; alternativamente se podrán utilizar formas regulares (p.ej: círculos) en dibujos vectoriales, para definir las áreas de superposición de las extremidades de un modelo, para así posicionar los enganches exactamente en su centro y lograr una coincidencia perfecta al vincularlos entre sí.

source: The hook number is just a label to identify hooks, and it is not relevant when performing links.
es: El número del enganche es una etiqueta que permite identificarlo y no será relevante en el momento de efectuar los vínculos.

source: Usually it's simpler to start working from the parent section, then link the other sections one by one, following one limb at the time.
es: Usualmente será más sencillo comenzar a trabajar desde la parte superior del modelo, y luego vincular las otras partes una a una, completando una extremidad por vez.

source: When starting to build a skeleton with hooks, two different cases may take place: the model sections are not drawn in the right place, one in relation to another; or they are drawn in the right place one in relation to another.
es: Al comenzar a construir un esqueleto con enganches, podrán darse dos casos: que las partes del modelo no estén dibujadas en el lugar correcto, una en relación a la otra; o que sí lo estén.

source: In the first case the appropriate hook has first to be set as the pivot point for the model section, then the link can be created. Note that when setting a hook as the new pivot point, the hook, and consequently the section, *shifts* to the center of the work area; as soon as you link that section to the hook of another section, it goes to the right place, with the two hooks perfectly overlapping.
es: En el primer caso, primero se deberá establecer el enganche apropiado como punto de pivote de esa parte del modelo, luego será posible crear el vínculo. Nótese que al establecer un enganche como nuevo punto de pivote, el enganche, y consecuentemente dicha parte, *serán desplazados* al centro del área de trabajo; en el momento en que la misma sea vinculada al enganche de otra de las partes del modelo, asumirá la posición correcta en el modelo, con ambos enganches superponiéndose perfectamente.

source: In the second case a hook of the selected section and a hook of another section are overlapping (e.g. the hook on the wrist of the hand section overlaps the hook on the wrist of the forearm section), and a special button displaying information about the overlapping hooks can be used to automatically link the two sections with a single click.
es: En el segundo caso, un enganche de la parte seleccionada del modelo y uno de otra parte estarán ya superpuestos (p.ej: el enganche correspondiente a la muñeca de la mano, estará superpuesto con el enganche correspondiente a la muñeca del antebrazo) y será posible usar un botón especial, que mostrará información acerca de los enganches superpuestos, para vincular automáticamente ambas partes, mediante un solo clic.

source: **To set a hook as the pivot point of the selected section:**
es: **Para definir un enganche como el punto de pivote de la parte seleccionada de un modelo:**

source: Click the hook label displayed close to the hook.
es: Hacer clic en la etiqueta mostrada cerca del enganche.

source: **To Link the selected section to a hook another section:**
es: **Para vincular la parte seleccionada de un modelo al enganche de otra parte:**

source: *Click and drag* the square at the top of the handle up to the section you want to be its parent. All the *hooks* are displayed and the section you drag to is highlighted by displaying its bounding box.
es: *Arrastrar* el cuadrado en el extremo superior del manipulador, hasta la parte a la que se desee subordinar la parte actual del modelo. Se mostrarán todos sus *enganches* y la misma será resaltada mostrando su marco delimitador.
