Repository: WizzerWorks/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/create_animations_using_plastic_tool.po
Languages: es

source: Create animations using Plastic tool
es: Creación de animaciones usando la herramienta Plástico

source: Plastic is a powerful tool (|plastic|) that can be used as complement in a cutout animation context, as well as a stand-alone animation tool capable of bringing to life a character starting from a single drawing. Using a reference skeleton and a deformable mesh, Plastic allows to curving and deforming each element it's applied to, creating smooth animations.
es: **Plástico** (|plastic|) es una poderosa herramienta que puede ser usada como complemento, en el contexto de una animación de recortes, así como de forma independiente, siendo capaz de dar vida a un personaje a partir de un solo dibujo. Por medio del uso de un esqueleto de referencia y una malla deformable, Plástico permite curvar y deformar cada elemento al que sea aplicada, permitiendo crear animaciones suaves.

source: Using Plastic tool
es: Uso de la herramienta Plástico

source: The **Plastic** tool needs as starting input at least one column of the Xsheet (or layer of the Timeline) where one or more drawings are exposed; from now on this will be referred to as the *texture-column* (or **TC**). Using the outlines of the exposed drawing/s as references, the Plastic tool generates a triangular mesh contained in a new kind of column/layer: the *Mesh* column/layer. Each newly created Mesh column/layer is automatically connected to the proper TC. This link is a core point in the way Plastic works: every column/layer linked to a mesh will be deformed by it, and displayed within the mesh boundaries while rendering.
es: La herramienta **Plástico** necesita como punto de partida al menos una columna de la Planilla (o capa de la Línea de tiempo) donde haya expuesto uno o más dibujos; de aquí en adelante a ésta se le llamará *columna de textura* (o **CdT**). Usando los contornos de los dibujos expuestos como referencia, la herramienta Plástico generará una malla triangular, contenida en un nuevo tipo de columna/capa: la columna/capa de *Malla*. Cada columna/capa nueva de Malla que sea creada será conectada automáticamente a la CdT correspondiente. Este vínculo es un punto clave en el modo de funcionamiento de la herramienta Plástico: cada columna/capa vinculada a una malla será deformada por la misma y visualizada dentro de los límites de la malla, durante el procesamiento.

source: For animating/deforming a Mesh level, Plastic allows the building of a specific skeleton structure active on the mesh. The skeleton is a set of connected vertices, and, for each vertex, different parameters can be specified as: **Position**, **Angle Bounds**, **Rigidity** and **Staking Order**. Thus a great range of animations and effects can easily be created.
es: Para animar/deformar un nivel de Malla, Plástico permite la construcción de una estructura de esqueleto específica que actuará sobre la malla. El esqueleto es un conjunto de vértices conectados y, para cada vértice, será posible definir distintos parámetros, tales como: **Distancia**, **Ángulo**, **Rigidez**, **Límites de ángulo** y **Orden**. Así, será posible la creación de un gran abanico de animaciones y efectos.

source: The Plastic tool is applied to a column of the Xsheet (or layer of the Timeline), and the content of it can be an animated level.
es: La herramienta Plástico es aplicada a una columna de la Planilla (o capa de la Línea de tiempo), y el contenido de la misma podrá ser un nivel de animación con diferentes dibujos en sus fotogramas.

source: Building a Plastic mesh
es: Construcción de una malla

source: The first step for using Plastic is creating a mesh for the Xsheet column (or Timeline layer) that we are going to animate using the **Plastic** tool. The Mesh is a special kind of level, and can be saved as any other kind of levels.
es: El primer paso para usar Plástico es crear una malla para la columna de la Planilla (o capa de la Línea de tiempo) que se desee animar con dicha herramienta. La Malla existirá en un tipo especial de nivel, que podrá ser guardado como los otros tipos.

source: The Mesh level can be seen as *purple* column/layer created when the button **Create Mesh** of the **Plastic** tool is pressed.
es: Las columnas/capas de un nivel de Malla se mostrarán en color *morado* y se crearán usando el botón **Crear malla** en las opciones de la herramienta **Plástico**.

source: The mesh is the real object that the Plastic tool modifies when a plastic skeleton is animated. For this reason all the elements, that are going to be animated by the Plastic tool, need a mesh.
es: La malla es el objeto real que la herramienta Plástico modifica cuando un esqueleto de plástico es animado. Por esta razón todos los elementos que vayan a ser animados con dicha herramienta, necesitarán una malla.

source: **To create a Plastic mesh:**
es: **Para crear una malla de Plástico:**

source: Select the column/layer that is going to be animated using the Plastic tool. This will be the *texture-column* (TC) of the mesh that is going to be created.
es: Seleccionar la columna/capa que se pretenda animar con la herramienta Plástico. Ésta será la *columna de textura* (CdT) de la malla que será creada.

source: Choose the **Plastic** tool (|plastic|)
es: Elegir la herramienta **Plástico** (|plastic|).

source: Press the **Create Mesh** button in the tool options bar.
es: Presionar el botón **Crear malla** en la barra de opciones de la herramienta.

source: Check, in the dialog that opens, the Mesh density in the preview area. Adjust as needed the density using the **Mesh Edges Length** slider.
es: Comprobar, en el área de previsualización del diálogo emergente, la densidad de la Malla. Ajustarla como sea necesario, usando el deslizador **Longitud bordes malla:**.

source: The density of the mesh is crucial for having smooth curves when rotating the skeleton vertex. Lower the **Mesh Edges Length** value and higher the density of the mesh will be, thus a better quality of the animation will be assured, but more computing resources will be required.
es: La densidad de la malla es crucial para obtener curvas suaves al rotar los vértices del esqueleto. Cuando se disminuya el valor de la opción **Longitud bordes malla:** la malla tendrá una mayor densidad, y por lo tanto se asegurará una mayor calidad en la animación de la misma, a costa de una mayor utilización de recursos.

source: The preview will show you just one level at time, even if you have selected multiple columns/layers, to check the preview of each column/layer you have to select them one by one *while* the **Plastic** tool is active. Each time you change the column/layer selection the preview will update for the new content.
es: La previsualización mostrará sólo un nivel al mismo tiempo, aunque se hubieran seleccionado varias columnas/capas, para revisar la previsualización de cada una de las columnas, éstas deberán ser seleccionadas una por una *mientras* la herramienta **Plástico** se encuentre activa. Cada vez que se cambie la columna/capa seleccionada, la previsualización se actualizará para mostrar el nuevo contenido.

source: If needed, change the value of the **Rasterization DPI** parameter. This value represents the DPI used when the TC is rendered as a texture for the mesh. It's recommend using a value consistent with the Camera resolution. A DPI too high compared to the Camera resolution might cause the contours of the TC not to be very soft.
es: En caso de ser necesario, será posible cambiar el parámetro **PPP de conversión a imagen:**. Este valor representa los PPP usados al procesar la CdT, como una textura para la malla. Se recomienda usar un valor consistente con la resolución de la Cámara. Un valor de PPP demasiado alto, comparado con el de la Cámara, podría causar que los contornos de la CdT no lucieran muy suaves.

source: The **Rasterization DPI** parameter is available only when you are creating the mesh from Toonz Vector levels.
es: El parámetro **PPP de conversión a imagen** se encontrará disponible sólo al crear una malla a partir de un nivel Vectorial de Toonz.

source: Adjust the **Mesh Margin** value. This parameter is expressed in *pixels* because it's used when the texture is projected on the mesh, an appropriate amount of margin will be needed to preserve the aliasing of the picture.
es: Ajustar el valor de **Margen de malla (píxeles):**. Este parámetro está expresado en píxeles debido a que será usado cuando la textura sea proyectada sobre la malla; se necesitará un margen de tamaño apropiado para preservar el suavizado de bordes de la imagen.

source: If you are creating a mesh from a **Sub-Xsheet**, you can choose which elements of the Sub-Xsheet will be used by the Plastic tool for computing the mesh: simply turn off visibility for the elements that will not contribute to the mesh outline.
es: Si se estuviera creando una malla a partir de una **sub-planilla*, será posible elegir qué elementos de la sub-planilla serán usados por la herramienta Plástico para calcular la malla: simplemente apagar la visibilidad de los elementos que no se desee que efectúen una contribución al contorno de la malla creada.

source: Click the **Apply** button to create the mesh. Now you can see the mesh drawn in *green* colour in the Viewer, and a new *purple* column in the Xsheet (or layer in the Timeline) next to the TC.
es: Hacer clic en el botón **Aplicar** para crear la malla. Ahora se podrá observar la malla dibujada en color *verde* en el Visor, así como una nueva columna/capa *morada* en la Planilla/Línea de tiempo, junto a la CdT.

source: In the **Stage Schematic** you can see that the *TC* node is now connected to the *Mesh* node just created, its node has a *purple* header for easing recognition.
es: En el **Diagrama de escenario** será posible ver que el nodo correspondiente a la *CdT* estará ahora conectado al nodo de la *Malla* recién creado, su nodo tendrá un encabezado de color *morado* para facilitar su reconocimiento.

source: If the **Create Mesh** is applied to a column/layer that is already modified by the Plastic tool (then already linked to a Mesh level) a dialog will prompt asking how to manage the new and the old Mesh files, and the user can choose from one of three options:
es: Si el comando **Crear malla** fuera aplicado a una columna/capa que ya hubiera sido modificada por la herramienta Plástico (y por lo tanto ya vinculada a un nivel de Malla), emergerá un diálogo consultando acerca de cómo administrar los nuevos y viejos archivos de Malla, se podrá elegir entre tres opciones:

source: **Delete the old level entirely** : the original mesh file is replaced by a new one with the data of the last mesh generated; a new column for the new mesh is created as the old column retains the old structure but exposes only the new created mesh.
es: **Borrar completamente el antiguo nivel**: el archivo original de malla será reemplazado por uno nuevo con los datos de la última malla generada; se creará una nueva columna para la nueva malla, mientras la columna anterior retendrá la antigua estructura, pero exponiendo sólo la nueva malla creada.

source: **Keep the old level and overwrite processed frames** : the original mesh file is updated and the old mesh column exposes the new content for the selected frames, a new column is created exposing just the contents of the selected frames.
es: **Mantener el antiguo nivel y sobrescribir los fotogramas procesados**: el archivo original de la malla será actualizado y la antigua columna/capa de malla expondrá el nuevo contenido en los fotogramas seleccionados, se creará una nueva columna/capa para exponer sólo el contenido de los fotogramas seleccionados.

source: **Choose a different path** (same name as the original level plus _X where X is the ordinal number of the copy): an entirely new mesh file is generated and a new column exposes the new contents while the old column exposes the old ones.
es: **Escoger una ruta distinta (nombre del nivel original con el sufijo _X, donde X es el número ordinal de la copia)**: se creará un archivo de malla completamente nuevo y una nueva columna/capa expondrá el nuevo contenido, mientras que la antigua columna expondrá el anterior.

source: All the above options cause the creation of a new Mesh column and the building of a chain, linking the *texture-column* and the *meshes columns* in the Stage Schematic. In this chain, the older mesh is linked to the younger and the youngest mesh is linked to the *texture-column*. Rearranging the links in the Stage Schematic can be needed for avoiding undesired results while animating.
es: Todas las opciones arriba expuestas causarán la creación de una nueva columna de Malla y la construcción de una cadena, vinculando la *columna de textura* con las *columnas de mallas* en el Diagrama de escenario. En esta cadena, la malla antigua estará vinculada a la más nueva y la malla más nueva estará vinculada a la *columna de textura*. Es posible que sea necesario reordenar la jerarquía en el Diagrama de escenario para evitar resultados no deseados durante una animación.

source: Modifying a Plastic mesh
es: Modificación de una malla

source: It's not always easy to estimate the right density for a mesh. Sometimes a higher density could be needed to avoid *straight lines* on bending elements, or a lower density could be used for saving computing resources in a complex scene, or, simply, the drawings of an element are changed. In all this occurrences, modifying the mesh can solve the problem.
es: No siempre será sencillo estimar la densidad correcta para una malla. Es posible que algunas veces sea necesaria una densidad mayor para evitar *líneas rectas* al flexionar elementos, una menor densidad para ahorrar recursos de cálculo en una escena compleja o simplemente porque los dibujos de un elemento fueron cambiados. En todos esos casos, es posible que modificar la malla resuelva el problema.

source: **To update a Plastic mesh to reflect changes in the Level Strip:**
es: **Para actualizar una malla para que refleje los cambios en la Cinta de nivel:**

source: Select the Mesh column/layer that needs to be modified.
es: Seleccionar la columna/capa de Malla que necesite ser modificada.

source: Press the **Create Mesh** button.
es: Presionar el botón **Crear malla**.

source: In the dialog that opens change the **Mesh Edges Length** slider value as needed, checking the result in the preview area.
es: En el diálogo emergente cambiar el valor del deslizador **Longitud bordes malla:** como sea necesario, revisando el resultado en el área de previsualización.

source: Click the **Apply** button to create the mesh. The new mesh replaces the old one, and now is visible drawn in *green* colour in the main viewer.
es: Hacer clic en el botón **Aplicar** para crear la malla. La nueva malla reemplazará a la antigua y será visible en color *verde* en el Visor principal.

source: **To add new mesh frames to an existing mesh level:**
es: **Para agregar nuevos fotogramas a un nivel de malla ya existente:**

source: Create the new frames (inserting or appending them) as it's usually done for any standard Toonz level, corresponding to the new frames created for the *Texture Column*.
es: Crear los nuevos fotogramas para la *columna de textura* (insertándolos o anexándolos al final) como se haría con cualquier nivel normal de OpenToonz.

source: Activate the **Plastic** tool.
es: Activar la herramienta **Plástico**.

source: Press the **Create Mesh** button and adjust the **Mesh Edges Length** slider.
es: Hacer clic en el botón **Crear malla** y ajustar el deslizador **Longitud bordes malla:**.

source: Press the **Apply** button.
es: Hacer clic en el botón **Aplicar**.

source: Edit a Plastic mesh
es: Edición de una malla

source: The mesh created using the **Create Mesh** button can be edited in several ways. It's possible to: Move a mesh point, Swap, Collapse, Split and Cut the mesh by its edges.
es: La malla creada mediante el botón **Crear malla* podrá ser editada de varias maneras. Será posible Mover los puntos de la malla, así como Rotar, Colapsar o Dividir sus bordes.

source: **Swap** an edge if you want to change the shape of a mesh triangle; **Collapse** an edge if you want to join the ends of the edge; **Split** an edge if you want to increase the density of the mesh at any given point; **Cut** the mesh if you want to duplicate an edge to have the possibility, for example, to create a hole in the mesh and be able to animate it.
es: **Rotar** un borde si se desea cambiar la forma de uno de los triángulos de la malla; **Colapsar** un borde si se desea unir los extremos del mismo; **Dividir** un borde si se desea incrementar la densidad de una malla en un punto específico; **Cortar** la malla si se desea duplicar un borde para tener la posibilidad de, por ejemplo, crear un hueco en la malla para poder animarlo.

source: The **Cut Mesh** command is visible only if the selected edges can be cut.
es: El comando **Cortar malla** será visible sólo cuando existiera la posibilidad de cortar los bordes seleccionados.

source: **To enter Plastic mesh editing mode:**
es: **Para ingresar al modo de edición de mallas:**

source: Select the mesh column/layer you want to modify.
es: Seleccionar la columna/capa de la malla que se desee editar.

source: If not already active, choose the **Plastic** tool (|plastic|)
es: Si no se encontrara activa, elegir la herramienta **Plástico** (|plastic|).

source: In the Tool Options bar set the **Mode:** to **Edit Mesh**.
es: En la barra de opciones de la herramienta definir el **Modo:** en **Editar malla*.

source: **To move selected mesh points:**
es: **Para mover puntos seleccionados de una malla:**

source: Select the mesh points you want to modify. Use the **Ctrl** key to select multiple points. Selected mesh points become *red*.
es: Seleccionar los puntos de la malla que se desee mover. Usar la tecla **Ctrl** para seleccionar varios puntos. Los puntos seleccionados de la malla se mostrarán en color *rojo*.

source: Drag to move the point to its new position.
es: Arrastrar para mover los puntos hasta su nueva posición.

source: **To swap an edge of the mesh:**
es: **Para rotar un borde de una malla:**

source: Select a mesh edge.
es: Seleccionar un borde de una malla.

source: Click the right mouse button to open the context menu.
es: Hacer clic derecho para abrir el menú contextual.

source: Choose the **Swap Edge** command.
es: Elegir el comando **Rotar borde**.

source: **To collapse an edge of the mesh:**
es: **Para colapsar un borde de una malla:**

source: Choose the **Collapse Edge** command.
es: Elegir el comando **Colapsar borde**.

source: **To split an edge of the mesh:**
es: **Para dividir un borde de una malla:**

source: Choose the **Split Edge** command.
es: Elegir el comando **Dividir borde**.

source: **To cut edges of the mesh:**
es: **Para cortar bordes de una malla:**

source: Select several mesh edges.
es: Seleccionar varios bordes de la malla.

source: Choose the **Cut Mesh** command.
es: Elegir el comando **Cortar malla**.

source: Building a Plastic skeleton
es: Construcción de un esqueleto

source: The Plastic skeleton is a control structure linked to a mesh level that provides handles for deforming/animating the chosen elements of the Xsheet/Timeline.
es: El esqueleto Plástico es una estructura de control vinculada a un nivel de malla que proporciona asas para deformar/animar los elementos escogidos de la Planilla/Línea de tiempo.

source: **To create a Plastic skeleton:**
es: **Para crear un esqueleto Plástico:**

source: Select in the mesh column/layer for which you want to build the skeleton.
es: Seleccionar la columna/capa de malla para la cual se desee crear un esqueleto.

source: In the Tool Options bar set the **Mode:** to **Build Skeleton**.
es: En la barra de opciones de la herramienta establecer el **Modo:** en **Crear esqueleto**.

source: Move the mouse pointer on the Viewer. A small red square is now visible near the tip of the cursor.
es: Mover el puntero del ratón sobre el Visor. Aparecerá un pequeño cuadrado rojo en su punta.

source: In the Viewer click (to set in place) or click and drag (to adjust its positioning) to place the first vertex. A *purple* square is now visible in the Viewer.
es: En el Visor hacer clic (para colocar en el lugar) o arrastrar (para ajustar la posición) para crear el primer vértice. Se verá un cuadrado *morado* en el Visor.

source: The first time you release the mouse button, you are setting the position of the parent of all the hierarchy, *the Root vertex*. This vertex differs visually from the others vertices: its square is solid while the others are hollow in the middle, giving a visual hint for determining the right hierarchical order in the skeleton chains. The **Root vertex** will be *static* in **Animate** mode, but it can still be moved while in **Build Skeleton** mode by selecting it and dragging.
es: La primera vez que se suelte el botón de ratón, se definirá la posición del *vértice Raíz*, el superior de todas la jerarquía. El primer vértice difiere visualmente de los otros vértices: su cuadrado es sólido, mientras que el de los otros se hueco en el medio, dando una indicación visual para determinar el orden jerárquico correcto en las cadenas del esqueleto. El **vértice Raíz** será *estático* en el modo **Animar**, aún así podrá ser movido en el modo **Crear esqueleto**, seleccionándolo y arrastrándolo.

source: Move to the position where you want to add the second vertex and click or click and drag to place it. An *orange* line with a black border will connect the two vertices.
es: Desplazar el puntero a la posición donde se desee agregar el segundo vértice y hacer clic o arrastrar para ubicarlo. Una línea naranja de contorno negro conectará ambos vértices.

source: Continue clicking or clicking and dragging until all the vertices are in the right places and the skeleton is completed.
es: Continuar haciendo clic o arrastrando nuevos vértices hasta que todos se encuentren en los lugares apropiados y el esqueleto se haya completado.

source: Using multiple skeletons on a mesh level
es: Uso de varios esqueletos en un nivel de malla

source: Every mesh level uses at least one skeleton for animating, but this is just the easier configuration for working: a mesh level can have multiple skeletons active at different frames for building more complex animations: like a character turn-around, or for animating a level with multiple drawings of different shapes. Every time the drawings change in shape, a new *ad-hoc* skeleton structure can be built with the number of vertices needed and placed in the right positions.
es: Cada nivel de malla usa al menos un esqueleto para ser animado, sin embargo esta es apenas la configuración más simple para trabajar: es posible que un mismo nivel de malla tenga varios esqueletos, activos en distintos fotogramas, para crear animaciones más complejas, como una revolución de un personaje o para animar un nivel que conste de varios dibujos con formas distintas. Cada vez que los dibujos cambien su forma, será posible crear una nueva estructura de esqueleto *ad-hoc* con la cantidad de vértices necesarios ubicados en las posiciones apropiadas.

source: **To add a new skeleton on a mesh level**
es: **Para agregar un nuevo esqueleto en un nivel de malla:**

source: In the Xsheet/Timeline select the Mesh level and the frame where the new skeleton is needed.
es: En la Planilla/Línea de tiempo seleccionar el nivel de Malla y el fotograma donde el nuevo esqueleto sea necesario.
