Repository: WizzerWorks/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/create_animations_using_plastic_tool.po
Languages: es

source: In the Tool Options bar press the **+** button to the right of the options menu labeled **Skeleton:**. A new numeric entry is added to the list and a keyframe is created at the selected frame.
es: En la barra de opciones de herramienta, hacer clic en el botón **+** a la derecha del menú de la opción **Esqueleto:**. Se agregará una nueva entrada numérica a la lista y se creará un clave en el fotograma actual.

source: Start building the new skeleton as usual.
es: Comenzar a construir el nuevo esqueleto como cualquier otro.

source: **To link an available skeleton to a chosen frame of a mesh level**
es: **Para activar un esqueleto existente a partir de un fotograma específico:**

source: In the Xsheet/Timeline select the frame of the Mesh level where the skeleton has to change.
es: En la Planilla/Línea de tiempo seleccionar el fotograma del nivel de Malla donde deba producirse en cambio de esqueleto.

source: In the Tool Options bar open the option menu labeled **Skeleton:**, a list of the ID numbers of the already built skeletons opens.
es: En la barra de opciones de herramienta, en el menú de la opción **Esqueleto:** se listarán los números identificatorios de los esqueletos ya creados.

source: Select the **ID number** matching the skeleton you need.
es: Seleccionar el *número que identifique* al esqueleto deseado.

source: The selected skeleton is now visible in the main Viewer, and a keyframe is created at the chosen frame.
es: El esqueleto seleccionado se mostrará en el Visor y se creará un clave en el fotograma actual.

source: **To delete a skeleton from the Skeleton list**
es: **Para borrar un esqueleto de la lista de Esqueletos:**

source: In the Xsheet/Timeline select the Mesh level owning the skeleton that has to be deleted.
es: En la Planilla/Línea de tiempo seleccionar el nivel de Malla al que pertenezca el esqueleto que se desee borrar.

source: Select from the **Skeleton:** drop down the **ID** matching the skeleton to delete.
es: Seleccionar en la opción **Esqueleto:** el **número del esqueleto** que se desee borrar.

source: Press the **-** button.
es: Presionar el botón **-**.

source: Modifying a Plastic skeleton
es: Modificación de un esqueleto

source: While drawing the skeleton or after finishing its creation, some adjustments to the positions or the number of vertices may be required:
es: Al dibujar un esqueleto o luego de finalizar su creación, es posible que sea necesario realizar ajustes a las posiciones o la cantidad de los vértices:

source: **To Select a vertex:**
es: **Para Seleccionar un vértice:**

source: While in **Build Skeleton** mode, move the mouse pointer on an already placed vertex.
es: Mientras se está en modo **Crear esqueleto**, mover el cursor del ratón sobre uno de los vértices existentes.

source: Click, when the name of the vertex appears and a dashed square encloses the vertex position.
es: Hacer clic, cuando el nombre del vértice aparezca y un cuadrado punteado rodee la posición del mismo.

source: **To Delete a vertex:**
es: **Para Borrar un vértice:**

source: While in **Build Skeleton** mode, select the vertex that has to be deleted.
es: Mientras se está en modo **Crear esqueleto**, seleccionar el vértice que se desee borrar.

source: Press the **Del** key.
es: Presionar la tecla **Supr**.

source: **To Insert a vertex:**
es: **Para Insertar un vértice:**

source: While in **Build Skeleton** mode, move the mouse pointer over the line connecting the two vertices that need a vertex between them.
es: Mientras se está en modo **Crear esqueleto**, mover el cursor del ratón sobre la línea que conecta dos vértices y que necesita un nuevo vértice intermedio.

source: Click to set the new vertex in place, or click and drag to adjust the position of the new vertex.
es: Hacer clic para definir un nuevo vértice o hacer clic y arrastrar para ajustar la posición del nuevo vértice.

source: **To Move a vertex:**
es: **Para Mover un vértice:**

source: Click on the vertex to select it, and drag for adjusting its position.
es: Hacer clic sobre un vértice y arrastrar para ajustar su posición.

source: **To Prevent a vertex from Stretching the mesh:**
es: **Para evitar que un vértice estire la malla:**

source: Select the vertex that you wish to modify.
es: Seleccionar el vértice que se desee modificar.

source: Uncheck the **Allow Stretching** option in the Tool Options bar.
es: Desactivar la opción **Permitir estiramiento** en la barra de opciones de la herramienta.

source: The square marking the vertex position becomes *yellow*, and from now on the vertex *will not stretch* the Mesh while you are moving it.
es: El cuadrado del vértice se tornará *amarillo* y a partir de ese momento el vértice *no estirará* a la malla cuando se mueva.

source: **To Snap a vertex to the mesh**
es: **Para Adherir un vértice a la malla:**

source: While in **Build Skeleton** mode, activate the **Snap To Mesh** option.
es: Mientras se está en modo **Crear esqueleto**, activar la opción **Adherir a la malla**.

source: Select the vertex you wish to snap.
es: Seleccionar el vértice que se desee adherir.

source: Drag it near the *mesh point* at which you want to snap it.
es: Arrastrarlo cerca de uno de los *puntos de la malla* al cual se lo desee adherir.

source: **To Branch the skeleton:**
es: **Para Ramificar un esqueleto:**

source: While in **Build Skeleton** mode, **select the vertex** from which the new branch will start.
es: Mientras se está en modo **Crear esqueleto**, **seleccionar el vértice** a partir del cual se desee iniciar la ramificación.

source: Move to the position where the first vertex of the new branch will be positioned.
es: Mover el puntero a la posición en donde se desee posicionar al primer vértice de esa rama.

source: Click to create it.
es: Hacer clic para crearlo.

source: **To Copy a skeleton:**
es: **Para Copiar un esqueleto:**

source: While in **Build Skeleton** mode, **select the Root vertex** and click the right mouse button.
es: Mientras se está en modo **Crear esqueleto**, **seleccionar el vértice raíz** y hacer clic derecho.

source: From the context menu that opens, select the **Copy Skeleton** option.
es: En el menú contextual emergente, seleccionar la opción **Copiar esqueleto**.

source: **To Paste a skeleton:**
es: **Para Pegar un esqueleto:**

source: Select a mesh column in the Xsheet/Timeline.
es: Seleccionar una columna de malla de la Planilla (o capa de la Línea de tiempo).

source: If needed press the **+** button to create a new empty skeleton.
es: Si fuera necesario, presionar el botón **+** para crear un nuevo esqueleto vacío.

source: Click the right mouse button and select the **Paste Skeleton** option.
es: Hacer clic derecho y seleccionar la opción **Pegar esqueleto**.

source: Pasting the skeleton on *an already existing one* will cause the deletion of the old structure and all its animation. This can be reverted to the previous state by using the **Undo** command.
es: Pegar un esqueleto sobre *uno ya existente* causará que la estructura antigua y su animación sean borradas. Será posible revertir esta operación, mediante el uso del comando **Deshacer**.

source: Animating Plastic elements
es: Animación de elementos

source: Creating an animation in Plastic is quite an easy task: just select the vertices and move them to the desired positions at a specific frames and animation keyframes will be automatically created. Play back the sequence to check the results.
es: Crear una animación con la herramienta Plástico es una tarea bastante simple: bastará sólo con seleccionar los vértices y moverlos hasta la posición deseada en fotogramas específicos, para que se creen claves de forma automática. Para ver el resultado se deberá reproducir la secuencia.

source: **To animate Plastic elements:**
es: **Para animar elementos:**

source: Select the mesh column/layer you like to animate.
es: Seleccionar la columna/capa de la malla que se desee animar.

source: Select **Plastic** tool and set **Mode:** to **Animate**. Now, in the Viewer, you can see the skeleton and the mesh of the selected column/layer.
es: Seleccionara la herramienta **Plástico** y definir su Modo: en **Animar**. En el Visor podrá verse el esqueleto y la malla de la columna/capa seleccionada.

source: Select the first frame of the animation in the Xsheet/Timeline.
es: Seleccionar el primer fotograma de la animación en la Planilla/Línea de tiempo.

source: Select the *vertices* of the skeleton and move them to the desired positions to set the relative keyframes, or write the desired values into the text fields of the Tool Options bar.
es: Seleccionar *vértices* del esqueleto y moverlos hasta la posiciones deseadas para marcar sus fotogramas clave correspondientes o ingresar los valores deseados en los campos de la barra de opciones de la herramienta.

source: Move to the next keyframe of the animation and modify the vertices positions to define a new pose.
es: Cambiar a otro fotograma de la animación y modificar las posiciones de los vértices para definir una nueva pose.

source: Repeat the step 5 until the end the animation is finished.
es: Repetir el paso 5 hasta que se haya completado la animación.

source: **To Set a Rest Position key for one vertex:**
es: **Para marcar un clave de reposo para un vértice:**

source: The first time you draw a skeleton you are also creating the *rest position* of this structure. This pose is automatically stored and you can recall it on any vertex.
es: La primera vez que se crea un esqueleto también se estará creando la *posición de reposo* para dicha estructura. Esta pose será guardada automáticamente y podrá ser invocada en cualquier vértice.

source: Select a vertex and click the right mouse button.
es: Seleccionar un vértice y hacer clic derecho.

source: From the context menu that opens, select **Set Rest Key**.
es: En el menú contextual emergente, seleccionar **Marcar clave (en reposo)**.

source: A new keyframe at the current frame is created for the vertex, using its *rest values*.
es: Se creará un nuevo clave en el fotograma actual para el vértice, usando sus *valores de reposo*.

source: **To Set a Global Rest Position key for the whole skeleton:**
es: **Para marcar un clave de reposo para todo un esqueleto:**

source: The first time you draw a skeleton you are also creating the *rest position* of this structure. This pose is automatically stored and you can recall it on all the vertices.
es: La primera vez que se crea un esqueleto también se estará creando la *posición de reposo* para dicha estructura. Esta pose será guardada automáticamente y podrá ser invocada en todos los vértices.

source: From the context menu that opens, select **Set Global Rest Key**.
es: En el menú contextual emergente, seleccionar **Marcar clave global (en reposo)**.

source: A new keyframe at the current frame is created for all the vertices, using their *rest values*.
es: Se creará un nuevo clave en el fotograma actual para todos los vértices, usando sus *valores de reposo*.

source: **To preserve the distance between vertices while animating:**
es: **Para preservar la distancia entre los vértices, al animarlos:**

source: If it's required that the distance between two joints stays constant during the animation, check the **Keep Distance** checkbox in the Tool Options bar.
es: Si se requiriera que la distancia entre dos articulaciones se mantuviera constante durante la animación, activar la opción **Mantener distancia** en la barra de opciones de la herramienta.

source: **To Set Keyframes on all vertices at the same time:**
es: **Para marcar fotogramas clave para todos los vértices a la vez:**

source: By default when you move a vertex in **Animate** mode, you set a keyframe just for this selected vertex. For setting a keyframe simultaneously for all the vertices of the skeleton, when just moving one of them, check the **Global Key** checkbox.
es: De forma predefinida al mover un vértice en modo **Animar**, se marcará un clave únicamente para el vértice seleccionado. Para marcar un clave simultáneamente para todos los vértices del esqueleto, al mover solo uno de ellos, se deberá activar la opción **Clave global**.

source: **To Set a Keyframe for a vertex which hasn’t changed position:**
es: **Para marcar un fotograma clave para un vértice que no haya cambiado su posición:**

source: Select the vertex for which you want to create a keyframe.
es: Seleccionar el vértice para el que se desee crear un fotograma clave.

source: Click the right mouse button.
es: Hacer clic derecho.

source: Select the **Set Key** option from the context menu that opens.
es: Seleccionar la opción **Marcar clave** en el menú.

source: **To Set a Keyframe for all the skeleton vertices which hasn’t changed position:**
es: **Para marcar un fotograma clave para todos los vértices que no hayan cambiado su posición:**

source: Select a skeleton vertex.
es: Seleccionar un vértice del esqueleto.

source: Select the **Set Global Key** option from the context menu that opens.
es: Seleccionar la opción **Marcar clave global** en el menú.

source: **To animate the Stacking Order of a vertex:**
es: **Para animar el Orden de un vértice:**

source: Using Plastic you can simulate the effect of overlapping limbs defining a stacking order for the vertices involved in the animation.
es: Usando la herramienta Plástico será posible simular el efecto de extremidades pasando por detrás o delante de otras partes, controlando el orden de composición de los vértices involucrados en la animación.

source: Select the vertex you wish to animate.
es: Seleccionar el vértice que se desee animar.

source: Input the **Stacking Order** value you wish to assign to the vertex into the **SO** text field in the Tool Options bar.
es: Ingresar el valor de orden de composición que se desee asignar al vértice, en el campo de la opción **Orden:**, en la barra de opciones de la herramienta.

source: Plastic stacking order is a *per vertex* characteristic, you have to define the value you wish for each vertex required. The default value is 0 for all vertices, and can be modified freely using positive or negative values as needed.
es: El orden de composición de la herramienta Plástico es una propiedad de *cada vértice*, se deberá definir el valor deseado para cada vértice que se necesite controlar. El valor predefinido para todos los vértices es 0, y puede ser modificado libremente usando valores positivos y negativos.

source: **To define an Angle Bounds for a vertex:**
es: **Para definir Límites de ángulo para un vértice:**

source: Select the desired vertex.
es: Seleccionar el vértice deseado.

source: Set the minimum and maximum **Angle Bounds** values for the vertex rotation.
es: Definir los **Límites de ángulo** mínimo y máximo para la rotación del vértice.

source: Defining Rigidity for a Plastic mesh
es: Definición de rigidez de una malla

source: In many occasions it may be required that certain portions of a Mesh that's being animated using the Plastic tool, preserve their shape even if following the overall transformations of the whole element, simulating a more *rigid structure* or a part of it. To achieve this kind of effect a **Rigidity** value can be painted directly on the Mesh.
es: En muchas ocasiones es posible que se necesite que ciertas porciones de una Malla, que esté siendo animada con la herramienta Plástico, mantenga su forma aunque esté siguiendo las transformaciones del elemento en su conjunto, simulando ser una *estructura rígida*. Para lograr este tipo de efecto será posible pintar un valor de **Rigidez** en la malla.

source: When activating the **Paint Rigid** mode in the **Plastic** Tool Options bar, a specific drawing tool becomes available. In the Viewer a *red circle* is visible near the tip of the mouse pointer, the size of the circle is the size of the brush you are going to use for painting the rigidity on the mesh.
es: Al activar el Modo: **Pintar rigidez** en las opciones de la herramienta Plástico, se activa una herramienta de pintura específica. En el Visor, se mostrará un *círculo rojo* en el puntero del ratón, el tamaño del círculo será el tamaño del pincel con el que se pintará la rigidez sobre la malla.

source: **To paint Rigidity on a mesh:**
es: **Para pintar la Rigidez de una malla:**

source: Select the mesh column/layer in the Xsheet/Timeline.
es: Seleccionar una columna/capa de malla en la Planilla/Línea de tiempo.

source: Set the **Mode:** to **Paint Rigid**.
es: Establecer el Modo: en **Pintar rigidez**.

source: Set the size of the brush moving the **Thickness** slider or entering a value into the text field.
es: Definir el tamaño del pincel con el deslizador **Grosor** o ingresando su valor en el campo numérico correspondiente.

source: Select **Rigid** from the option menu to the right of the Thickness slider (**Rigid** is the default value).
es: Seleccionar **Rígido** en el menú de opciones del extremo derecho de la barra de opciones de herramientas (**Rígido** es el valor predefinido).

source: Move the cursor on the Viewer and start painting on the selected Mesh. The colour of the mesh will change to *red* where painted. Now the *red* areas behave as *rigid* portions of the Mesh.
es: Mover el puntero en el Visor y comenzar a pintar sobre la Malla seleccionada. El color de la malla cambiará a *rojo* donde se haya pintado. Ahora las áreas *rojas* se comportarán como porciones *rígidas* de la Malla.

source: **To modify, correct, erase Rigidity on a mesh:**
es: **Para modificar, corregir, borrar la Rigidez de una malla:**

source: Select **Flex** from the option menu to the right of the Thickness slider.
es: Seleccionar **Flexible** en el menú de opciones del extremo derecho de la barra de opciones de herramientas.

source: Move the cursor on the Viewer and start painting on the selected Mesh. The colour of the mesh will change to *green* where painted. Now the *green* areas behave as *flexible* portions of the Mesh.
es: Mover el puntero en el Visor y comenzar a pintar sobre la Malla seleccionada. El color de la malla cambiará a *verde* donde se haya pintado. Ahora las áreas *verdes* se comportarán como porciones *flexibles* de la Malla.

source: The default colour of a mesh is *green*; it means that the whole mesh is *flexible*. The *red* colour is used to point out the *rigid* areas of the mesh (if there are any defined). But if a mesh is all painted in red colour it behaves as a flexible one too.
es: El color predefinido de una malla es *verde*; significa que la misma es completamente *flexible*. El color *rojo* es usado para destacar las áreas *rígidas* de la malla (si las hubiera definidas). Sin embargo, si una malla estuviera completamente pintada de *rojo* se comportará como si fuera flexible, de todas maneras.

source: Displaying Plastic elements and properties
es: Visualización de elementos y propiedades

source: While working with the Plastic tool there is an easy way for customizing which information have to be displayed in the Viewer. Clicking the right mouse button on the Viewer *while* the **Plastic** tool is active brings up a context menu. There are four checkboxes that set the display properties for the Mesh, the **Rigidity**, the **SO** (Stacking Order) and the **Skeleton Onion Skin**.
es: Al trabajar con la herramienta Plástico, existe una manera sencilla de personalizar qué información deberá ser mostrada en el Visor. Al hacer clic derecho sobre el Visor, *mientras* la herramienta **Plástico** se encuentre activa, emergerá un menú contextual. Existen cuatro opciones que controlarán las propiedades de visualización de la **Malla**, **Rigidez** y **Orden**, así como la **Piel de cebolla del esqueleto**.

source: If **Show Mesh** is enabled, the mesh will be visible as a triangulated wire frame shape.
es: Si la opción **Mostrar malla** se encontrara activa, la malla será visible como una estructura triangular.

source: If **Show Rigidity** is enabled, continuous *green* areas will show the flexibility, while *red* areas will show rigidity.
es: Si la opción **Mostrar rigidez** se encontrara activa, las áreas continuas de color *verde* indicarán flexibilidad, mientras que las áreas *rojas* indicarán rigidez.

source: If **Show SO** is enabled *a grey shading* shows the Stacking Order values of the vertices, where lighter areas will be on top, and darker ones behind.
es: Si la opción **Mostrar orden** se encontrara activa, *un sombreado gris* representará a los valores de orden de los vértices, donde los tonos más claros estarán por delante y los más oscuros por detrás.

source: If **Show Skeleton Onion Skin** is enabled, ghosts of the skeleton at the selected frames will be displayed with incremental levels of transparency.
es: Si la opción **Mostrar piel de cebolla del esqueleto** se encontrara activa, se mostrarán fantasmas del esqueleto en los fotogramas especificados, con niveles progresivos de transparencia.

source: All of this information can be displayed at once (by checking all the options), giving an overall description of the vertices state.
es: Toda esta información podrá ser visualizada a la vez (activando todas las opciones), para ofrecer una descripción completa del estado de los vértices.

source: Parenting Plastic levels using vertices and hooks
es: Creación de jerarquías de niveles usando vértices y enganches

source: For building interesting and complex animations it could be useful and time saving to create a hierarchical relationship between standard levels and Plastic modified levels, or between Plastic modified levels themselves, so that the children levels inherit the transformations of the parent automatically. It's always possible to link the levels using the column/layer center as target, but what if something more subtler is needed as using *Hooks*? We have already described similar techniques for OpenToonz standard elements (see :ref:`Linking Objects <linking_objects>` or :ref:`Using Hooks <using_hooks>` ), but Plastic modified levels works in a slightly different way because the Hook tool *is not* enabled on this kind of levels. Plastic modified levels use their skeleton vertices instead of the hook points.
es: Para poder crear animaciones complejas e interesantes podría resultar útil, así como ayudar a ahorrar tiempo, crear una relación jerárquica entre niveles normales y niveles modificados con la herramienta Plástico, o entre niveles modificados con la herramienta Plástico, de manera que los niveles subordinados hereden las transformaciones de su superior de forma automática. Siempre será posible vincular los niveles, usando simplemente los centros de sus respectivas columnas/capas como referencia, pero es posible que surjan ocasiones en que sea necesario algo más sutil, como el uso de **Enganches**. Ya se han descrito técnicas similares para los elementos normales de OpenToonz (ver :ref:`Vinculación de objetos <linking_objects>` o :ref:`Uso de Enganches <using_hooks>` ), sin embargo los niveles modificados por la herramienta Plástico funcionan de una forma ligeramente diferente, debido a que *no es posible* usar la herramienta Enganche en este tipo de niveles. Los niveles modificados por la herramienta Plástico utilizan los vértices de sus esqueletos, en lugar de puntos de enganche.

source: **To link a standard level to a Plastic modified level**
es: **Para subordinar un nivel normal a uno modificado con Plástico:**

source: Select in the Xsheet/Timeline the level that has to be linked.
es: Seleccionar en la Planilla/Línea de tiempo, el nivel que deba ser subordinado.

source: Use the **Hook** tool in the Viewer to create a hook on the spot that will be used as pivot for the level.
es: Usar la herramienta **Enganche** en el Visor, para crear un enganche en el punto que deba ser usado como pivote del nivel.
