Repository: WizzerWorks/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/creating_cutout_animation.po
Languages: es

source: Drag towards the hook you want to link the section to: the hook label is displayed and another label displays information about the link you are going to create.
es: Arrastrar hacia el enganche al que se desee subordinar la parte actual: se mostrará la etiqueta de dicho enganche y otra etiqueta adicional mostrará información acerca del vínculo que está a punto de ser creado.

source: **To Link two overlapping hooks:**
es: **Para vincular dos enganches superpuestos:**

source: Click the label close to the overlapping hooks displaying information about the link you are going to create.
es: Hacer clic sobre la etiqueta cercana a los enganches superpuestos, ésta mostrará información acerca del vínculo que está a punto de ser creado.

source: *Click and drag* the square at the middle of the graphical link between the linked sections away from the parent one.
es: *Arrastrar* el cuadrado visible en el centro de la unión entre ambas partes hacia otro lado.

source: Animating Models
es: Animación de modelos

source: When the Skeleton tool (|skeleton|) mode is set to **Animate**, it is possible to set positions for the model sections at different frames, thus defining an animation.
es: Cuando el Modo de la herramienta **Esqueleto** (|skeleton|) se encuentre en **Animar**, será posible definir posiciones para las partes del modelo en distintos fotogramas, creando así una animación.

source: In the viewer it's possible to select a model section and perform the following tasks:
es: En el Visor será posible seleccionar una parte del modelo y realizar las siguientes tareas:

source: *Click anywhere* to rotate the current section.
es: *Hacer clic en cualquier lugar* para rotar la parte seleccionada del modelo.

source: *Click and drag the green square with the four arrows* to move the current section.
es: *Arrastrar el cuadrado verde con las cuatro flechas* para mover la parte seleccionada del modelo.

source: As you roll over the handle, the cursor changes shape to indicate to you the operations you may perform.
es: A medida que el puntero pasa sobre el manipulador cambiará de forma, para indicar las operaciones que podrán ser realizadas.

source: Every time a position for a section is set, a keyframe is automatically generated for the Xsheet column (or Timeline layer) where that section is exposed, at the current frame. Keys are created only for the transformation you modify: rotation, displacement, or both.
es: Cada vez que se defina una posición para una parte del modelo, se generará automáticamente un fotograma clave para la columna de la Planilla (o capa de la Línea de tiempo) correspondiente, en el fotograma actual. Loas claves serán creados únicamente para la transformación modificada: rotación, posición o ambas.

source: It is also possible to activate the **Global Key** option in order to set a keyframe for all the section transformations, including scaling and shearing, as soon as a keyframe for one transformation is set. This may result useful if you want to animate the model first, and then refine the animation by adding stretching and squashing transformations.
es: También será posible activar la opción **Clave global** para poder marcar un fotograma clave para todas las transformaciones de esa parte del modelo (incluyendo escala e inclinación), cada vez que se modifique alguna de ellas.

source: If you want to create a keyframe without operating the handle, in order to leave the section position and rotation as they are, you can use the **Set Key** button (|key|) available in the bottom bar of the Viewer. In this case keys are created for all the object transformations (see :ref:`Animating Objects <animating_objects>` ). It is also possible to manage keys for several model sections at once by inserting or deleting keys affecting the Xsheet/Timeline as a whole, or a selection of Xsheet columns (or Timeline layers) (see :ref:`Working with Multiple Column Keys <working_with_multiple_column_keys>` ).
es: Si se deseara crear un fotograma clave sin usar el manipulador, para conservar la posición y rotación de la parte del modelo tal como están, será posible usar el botón **Marcar fotograma clave** (|key|) disponible en la barra inferior del Visor. En este caso, se crearán claves para todas las transformaciones del objeto (ver :ref:`Animación de objetos <animating_objects>` ). También será posible insertar o borrar claves de varias partes del modelo a la vez, afectando a la totalidad de la Planilla/Línea de tiempo o sólo a una selección de sus columnas/capas (ver :ref:`Trabajo con claves de varias columnas/capas <working_with_multiple_column_keys>` ).

source: Keys and interpolations you define in this way are displayed in Xsheet columns (or Timeline layers), where they can be directly managed (see :ref:`Using Column Keys <using_column_keys>` ).
es: Los claves y sus interpolaciones serán mostrados en las columnas de la Planilla (o capas de la Línea de tiempo), donde podrán ser manipulados directamente (ver :ref:`Uso de claves en columnas/capas <using_column_keys>` ).

source: As keyframes can be defined at specific frames for specific sections only, you may calibrate the animation and the movement speed of your model the way you prefer.
es: Debido a que los fotogramas clave podrán ser marcados en fotogramas específicos, y sólo para partes específicas del modelo, será posible calibrar la animación y la velocidad de los movimientos del modelo de la forma deseada.

source: Columns/layers can also be animated by working in the Function Editor (see :ref:`Editing Using Spreadsheet and Curves <editing_curves_and_numerical_columns>` )
es: También es posible animar columnas/capas mediante el Editor de funciones (ver :ref:`Edición usando la planilla de tiempos y curvas <editing_curves_and_numerical_columns>` )

source: In case a model section is an animation level consisting of several drawings instead of a single one (for example, if the character’s hand is an animation level consisting of drawings of the hand in different positions), the **Skeleton** tool (|skeleton|) lets you also flip through the drawings to choose the one you need.
es: En caso de que una de las partes del modelo fuera un nivel de animación conformado por varios dibujos, en vez de sólo uno (por ejemplo: si la mano del personaje fuera un nivel conteniendo dibujos de la mano en sus diferentes posiciones), la herramienta **Esqueleto** (|skeleton|) permitirá recorrer estos dibujos hasta elegir el deseado.

source: **To Select a model section:**
es: **Para Seleccionar una parte del modelo:**

source: Choose the **Skeleton** tool (|skeleton|), set the mode to **Animate**, and click the section in the Viewer.
es: Elegir la herramienta **Esqueleto** (|skeleton|), definir el Modo en **Animar** y hacer clic sobre la parte del modelo deseada en el Visor.

source: **To Rotate the selected section:**
es: **Para Rotar la parte seleccionada:**

source: Click and drag *anywhere* in the Viewer.
es: Hacer clic y arrastrar *en cualquier lugar* en el Visor.

source: **To Move the selected section:**
es: **Para Mover la parte seleccionada:**

source: Click and drag *the green square with the four arrows* available on the right of the current section pivot point.
es: Hacer clic y arrastrar *el cuadrado verde con las cuatro flechas* disponible a la derecha del punto de pivote de la parte seleccionada del modelo.

source: **To visualize only the pivot points of the current section up to the parent section:**
es: **Para visualizar sólo los puntos de pivote de la parte seleccionada del modelo hasta la parte superior:**

source: Activate the **Show Only Active Skeleton** option in the Skeleton tool options bar.
es: Activar la opción **Mostrar sólo esqueleto activo** en la barra de opciones de la herramienta Esqueleto.

source: **To flip through the drawings belonging to the animation level:**
es: **Para recorrer los dibujos pertenecientes al nivel de animación seleccionado:**

source: Click *the label with the level name* on the right of the current section pivot point and flip through following and previous frames by doing one of the following:
es: Hacer clic sobre *la etiqueta con el nombre del nivel* a la derecha del punto de pivote de la parte seleccionada del modelo, y recorrer los fotogramas anteriores/siguientes realizando una de las siguientes acciones:

source: Drag up or down.
es: Arrastrar hacia arriba o abajo.

source: Click the up or down arrowheads.
es: Hacer clic sobre la flechas hacia arriba o abajo.

source: Using Inverse Kinematics
es: Uso de Cinemática inversa

source: When the **Skeleton** tool (|skeleton|) mode is set to **Inverse Kinematics**, it's possible to move the model considering the articulation of all the sections its skeleton is made of. This means that if you want to move the end of a model limb to a particular position, all the rest of the sections belonging to that limb will move consequently, with no need to move each section separately.
es: Cuando el Modo de la herramienta **Esqueleto** (|skeleton|) se encuentre en **Cinemática inversa**, será posible mover el modelo, considerando la articulación de todas las partes de las cuales esté compuesto su esqueleto. Esto significa que si se deseara mover el final de una de sus extremidades hasta una posición específica, todo el resto de las partes pertenecientes a esa extremidad se moverán como corresponda, sin necesidad de tener que mover manualmente a cada una de ellas.

source: For example, if you want the hand of a character to reach a particular point, you don’t need to animate the arm and the forearm separately, but instead you can move the hand to the final position, automatically adjusting the arm and forearm sections.
es: Por ejemplo, si se deseara que la mano de un personaje alcanzara un punto en particular, no será necesario animar el brazo y el antebrazo individualmente, sino que simplemente se podrá mover la mano hasta la posición final, ajustándose automáticamente las partes correspondientes al brazo y antebrazo.

source: When the **Inverse Kinematics** mode is activated, the full skeleton with pivot points and links is displayed.
es: Cuando el modo **Cinemática inversa** se encuentre activo, se mostrará todo el esqueleto, incluyendo sus puntos de pivote y vínculos.

source: When moving the model, a rotation keyframe is automatically defined for all the sections involved in the movement, unless the **Global Key** option is activated thus generating a keyframe for all the section transformations.
es: Al mover un modelo, se marcará automáticamente un fotograma clave de *rotación* para todas las partes del modelo involucradas en dicho movimiento, a menos que la opción **Clave global** se encuentre activada, generando así un fotograma clave para *todas las transformaciones* de las partes del modelo involucradas en el movimiento.

source: When using inverse kinematics the movements of the parent section of the skeleton are automatically computed to allow the right configuration of the skeleton; this means that they *cannot* be edited anymore by using standard movement editing tools like the **Animate** tool or the **Function Editor**. To return to the standard movement editing mode, you have to reset the pinned centers information.
es: Al usar cinemática inversa, los movimientos de la sección superior del esqueleto serán calculados automáticamente para permitir una configuración correcta del mismo; esto significa que dichas partes *no podrán* seguir siendo editadas manualmente, usando herramientas de edición normales como **Animar** o el **Editor de funciones**. Para regresar al modo estándar de edición de movimientos, será necesario restablecer la información de *Centros fijos* del esqueleto.

source: Pinned Center
es: Centro fijo

source: One single center (by default located on the section that is the parent of the skeleton), is displayed as a **blue square**: indicating that it's **pinned** and its position won't change throughout the animation when the character sections are animated.
es: Sólo uno de los centros (ubicado de forma predefinida en la parte del modelo superior de todo el esqueleto) se mostrará como un **cuadrado azul**, indicando que se encuentra **fijo** y que su posición no cambiará a lo largo de la animación, cuando las partes del modelo estén siendo animadas.

source: The **pinned center** can be moved from a joint to another along the animation in order to have a center pinned only for a specific frame range. When the pinned center is changed at a specific frame, all the previous frames will retain the **previously pinned center**; all the following frames will have the **new pinned center** up to the frame where another pinned center position, if any, is defined in advance.
es: El **centro fijo** podrá ser movido desde una articulación a otra a lo largo de la animación, para posibilitar mantener un centro fijo sólo durante un rango de fotogramas deseado. Cuando el centro fijo sea cambiado, en un fotograma específico, todos los fotogramas anteriores mantendrán el **centro fijo anterior**; todos los fotogramas siguientes usarán el **nuevo centro fijo**, hasta el fotograma en donde hubiera otro nuevo centro fijo definido.

source: Changing the pinned center allows for a more complex animation where fixed points have to change while the model is moving, for example a walk where one ankle is pinned while the character is doing the first step, and the other ankle is pinned during the second step.
es: Cambiar el centro fijo permitirá lograr animaciones más complejas, donde los puntos fijos deban cambiar mientras el modelo se mueve, por ejemplo durante un ciclo de caminata en donde un tobillo se encontrará fijo mientras el personaje realiza su primer paso, en tanto el otro tobillo deberá quedar fijo mientras se produce el segundo paso.

source: Once the *pinned center* is defined, it will remain active when animating skeleton sections both with the **Skeleton** tool (|skeleton|), and with the **Animate** tool (|animate|). To freely animate any skeleton section again, reset the pinned center information (see below).
es: Una vez que se haya definido el *centro fijo*, permanecerá activo mientras se animen las partes del esqueleto, tanto mediante la herramienta **Esqueleto** (|skeleton|), como con la herramienta **Animar** (|animate|). Para poder volver a animar libremente cualquier parte del esqueleto, se deberá restablecer la información de Centro fijo (ver más abajo).

source: Temporarily Pinned Centers
es: Centros fijos temporales

source: Multiple additional centers can be *temporarily pinned* at any frame in order to constrain additional joints to a specific position. Unlike the pinned center, **temporarily pinned centers** are *not* preserved when the current frame changes, as they are used only to define the position of the sections at a certain frame.
es: Podrán *fijarse temporalmente* varios centros adicionales en cualquier fotograma, para poder restringir otras articulaciones a una posición específica. A diferencia del *centro fijo*, los **centros fijos temporales** no serán preservados cuando se cambie el fotograma actual, ya que sólo serán usados para lograr posicionar las partes de un modelo en un cierto instante.

source: Using **temporarily pinned centers** allows for the definition of specific poses at specific frames, for example the rising of an arm by pinning the shoulder joint.
es: El uso de **centros fijos temporales** permitirá definir poses específicas en determinados fotogramas, por ejemplo alzar un brazo, fijando la articulación del hombro.

source: According to the *pinned center*, and the *temporarily pinned centers*, it's possible to click any point of any section and drag to move the model: all the parent sections up to the *first pinned center* along the skeleton will move consequently, while all the linked sections *down to the free end of the limb* will move rigidly with the picked section. The sections affected by the movement are highlighted by displaying the link wires in *red*.
es: De acuerdo al *centro fijo* y a los *centros fijos temporales*, será posible hacer clic sobre cualquier punto de una parte del modelo y arrastrarlo para poder moverlo: todas las partes superiores del modelo hasta el *primer centro fijo* encontrado a lo largo del esqueleto, se moverán como corresponda, mientras que todas las partes subordinadas del modelo *hasta el final de la extremidad*, se moverán de forma rígida conjuntamente con la parte seleccionada. Las partes del modelo afectadas por el movimiento se resaltarán mostrando sus líneas de vínculo en color *rojo**.

source: The pinned centers information and coordinates are saved along with the scene; in case you want to delete it or start the animation by using the inverse kinematics from scratch, this information can be reset to the default, where only the center of the parent section of the skeleton is pinned.
es: La información y las coordenadas de los centros fijos serán guardadas junto con la escena; en caso de que se desee borrarla o recomenzar la animación desde cero, usando cinemática inversa, esta información podrá ser restablecida a sus valores predefinidos, donde únicamente el centro de la parte superior del esqueleto quedará fija.

source: **To animate the model with Inverse Kinematics:**
es: **Para animar un modelo usando Cinemática inversa:**

source: Choose the **Skeleton** tool (|skeleton|) and set the mode to **Inverse Kinematics**.
es: Elegir la herramienta **Esqueleto** (|skeleton|) y definir el Modo en **Cinemática inversa**.

source: Click any point of any model section and drag it to the desired position.
es: Hacer clic en cualquier punto de una parte del modelo y arrastrarla hasta la posición deseada.

source: **To set the skeleton Pinned Center:**
es: **Para definir el Centro fijo del esqueleto:**

source: **Click the center**: it turns from an *orange circle* to a *blue square* to indicate it is **pinned**.
es: Hacer **clic en el centro**: cambiará de un *círculo naranja* a un *cuadrado azul* para indicar que ha sido **fijado**.

source: **To change the skeleton Pinned Center:**
es: **Para cambiar el Centro fijo del esqueleto:**

source: Select the frame where you want the new center to be set.
es: Seleccionar el fotograma donde se desee definir el nuevo Centro fijo.

source: **Click the center**: all the previous frames will retain the *previously pinned center*; all the following frames will have the *new pinned center* up to a frame where another pinned position might have been defined in advance.
es: Hacer **clic en el centro**: todos los fotogramas anteriores mantendrán en uso el *centro fijo anterior*; todos los fotogramas siguientes usarán el *nuevo centro fijo* hasta otro fotograma posterior en que otro centro fijo sea definido.

source: **To set a Temporarily Pinned Center:**
es: **Para definir un Centro fijo temporal:**

source: **Shift-click the center**: it turns from an *orange circle* to a *light blue square* to indicate it is **temporarily pinned**.
es: Hacer **Mayúsculas-clic en el centro**: cambiará de un *círculo naranja* a un *cuadrado azul claro*, para indicar que ha sido **temporalmente fijado**.

source: **To unset a Temporarily Pinned Center:**
es: **Para desmarcar un centro fijo temporal:**

source: **Shift-click the temporarily pinned center**: it turns from a *light blue square* to an *orange circle* to indicate it's no longer temporarily pinned.
es: Hacer **Mayúsculas-clic en el centro fijo temporal**: cambiará de un *cuadrado azul claro* a un *círculo naranja*, para indicar que se trata de un centro normal otra vez.

source: **To Reset the Pinned Centers information:**
es: **Para restablecer la información de centros fijos:**

source: Choose the **Skeleton** tool (|skeleton|).
es: Elegir la herramienta **Esqueleto** (|skeleton|).

source: Right-click in the viewer and choose **Reset Pinned Center** from the menu that opens.
es: Hacer clic derecho sobre el Visor y elegir **Restablecer centro fijo** en el menú.
