Repository: WizzerWorks/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/rendering_the_animation.po
Languages: es

source: For example, if you are working at 25 fps, a 150 frames Xsheet will produce 6 seconds of animation. If you need to transfer the frame rate to 30 fps using the same Xsheet, the animation will last 5 seconds (150 frames divided by 30 fps is equal to 5 seconds), and consequently it will be a little bit faster. Stretching from 25 to 30 fps, the output will include an increased number of frames to retain the original time length, and the rendered frames will be 180 (6 seconds multiplied by 30 fps is equal to 180 frames).
es: Por ejemplo, si se estuviera trabajando a 25 fps, una Planilla/Línea de tiempo de 150 fotogramas produciría 6 segundos de animación. Al cambiar la velocidad a 30 fps, usando la misma Planilla/Línea de tiempo, la animación durará 5 segundos (150 fotogramas dividido entre 30 fps, que es igual a 5 segundos), consecuentemente se reproducirá un poco más rápido. Al *estirarla* desde 25 a 30 fps, la animación producida contendrá un mayor número de fotogramas para mantener la duración original y, por lo tanto, los fotogramas procesados serán 180 (6 segundos por 30 fps, que es igual a 180 fotogramas).

source: When going from a higher frame rate to a lower one, some level drawings will not be used because the number of output frames decreases. When doing the contrary, some level drawings will be repeated because the number of output frames is higher. Interpolations for object movements and special effects variations will be re-computed according to the final frame rate, in order to keep all the interpolations as smooth as possible.
es: Al pasar de una velocidad mayor a una menor, los dibujos de algunos niveles serán descartados, debido a que la cantidad de fotogramas producidos disminuirá. Al hacer lo contrario, algunos dibujos de niveles serán repetidos, debido a que la cantidad de fotogramas producidos será mayor. La interpolación de las transformaciones de los objetos y las variaciones de los efectos serán recalculados de acuerdo a la velocidad final, para mantener todas las interpolaciones tan suaves como sea posible.

source: When the field rendering is used (by using the **Dominant Field** option) and the **Stretch** feature is set for passing from a lower frame rate to a higher one, drawings and images *will be interlaced* as well, to create newly added frames.
es: Cuando el procesamiento por campos sea utilizado (mediante la opción **Campo dominante:**) y la opción **Estirar (fps)** esté configurada para pasar a una velocidad mayor, los dibujos e imágenes también *serán entrelazados*, al crear los nuevos fotogramas necesarios.

source: The **Particles** effect may have unexpected results when the scene is stretched to a higher FPS value, as the effect requires the original timing information.
es: Es posible que el efecto **Particles** presente un comportamiento inesperado cuando la escena sea estirada a una velocidad mayor, debido a que este efecto necesita la información de tiempo original.

source: **Multiple Rendering:** creates automatically for a single scene several output files based on the Xsheet columns (or Timeline layers) content, and according to the FX Schematic. Options are **None**, **FX Schematic Flows** and **FX Schematic Terminal Nodes** (see :ref:`Creating Multiple Renderings <creating_multiple_renderings>` ).
es: **Procesamiento múltiple:**, permite crear automáticamente, para la misma escena, varios archivos de salida, basados en el contenido de las columnas de la Planilla (o capas de la Línea de tiempo) y de acuerdo con el Diagrama de efectos. Las opciones son **No**, **Flujos del diagrama de efectos** y **Nodos terminales del diagrama de efectos** (ver :ref:`Procesamiento múltiple <creating_multiple_renderings>` ).

source: **Do stereoscopy** activates the stereoscopic 3D output of the scenes. Each frame will be rendered from two different camera view creating two sequences of files, one for each view. The suffixes **_l** (left) and **_r** (right) will be used to identify sequences.
es: **Estereoscopía**, permite activar la producción de imágenes estereoscópicas 3D a partir de las escenas. Cada fotograma será procesado desde dos cámaras distintas, creando dos secuencias de archivos, una correspondiente a cada ojo. Se usarán los sufijos **_l** (izquierda) y **_r** (derecha) para identificar las secuencias.

source: **Camera Shift:** sets the distance between the two camera views.
es: **Separación de cámaras:**, permite definir la distancia entre ambas cámaras.

source: For working properly at least some elements of the scene must have **Z-Depth** values other than 0 in their positioning. OpenToonz uses these values and the **Camera Shift** parameter for rendering the stereoscopic effect.
es: Para que esta opción funcione apropiadamente, al menos algunos elementos de la escena deberán tener valores de **Posición Z** distintos a 0. OpenToonz utiliza dicho valor, conjuntamente con el parámetro **Separación de cámaras:**, para calcular el efecto estereoscópico.

source: **Render** button, starts rendering the scene using the current render settings.
es: **Procesar**, este botón permite iniciar el procesamiento de la escena, usando las opciones elegidas.

source: **To set the scene output settings:**
es: **Para definir las opciones de salida de la escena:**

source: Choose Render → ***Output Settings...**
es: Elegir Procesamiento → **Opciones de salida...**

source: Set the options you want to use for the final rendering.
es: Definir las opciones que se deseen usar para el procesamiento de la animación.

source: Using The Clapperboard
es: Uso de la Claqueta

source: A clapperboard is a static image intended to display information of the scene. It will be added before the rendered frames, in order to record and convey information to subsequent phases of the pipeline.
es: Una claqueta es una imagen estática, cuyo propósito es mostrar información acerca de la escena. Se agregará antes de los fotogramas procesados para transmitir información a etapas posteriores en el flujo de trabajo.

source: |clapperboard|
es: |clapperboard_es|

source: The clapperboard consists of board *items*. At the bottom-right of the Clapperboard Settings dialog there is a list of all the clapperboard items, which can be layered by moving them **Up** or **Down** in the list by using the appropriate buttons. Items can also be created or deleted by using the **Add** or **Remove** buttons.
es: La claqueta es una placa que está compuesta de *elementos*. En la sección inferior derecha del diálogo Opciones de claqueta hay una lista con todos los elementos de la claqueta, éstos se encuentran dispuestos en capas y su orden puede ser controlado mediante los botones **Mover arriba** y **Mover abajo**, a la izquierda de la lista. También será posible crear y borrar elementos usando los botones **Agregar** y **Eliminar**.

source: Settings for the *currently selected* item are displayed above the items list, at the top-right of the Clapperboard Settings dialog. Each item has an information **Type:**. Most of them will automatically retrieve the correspondent data from the current scene or the system, such as: scene **Duration**, **Scene location**, **Current date**, etc. Other types, such as **Text** or **Image** allow to input user defined data to be displayed in the Clapperboard.
es: Las opciones para el *elemento seleccionado* serán mostradas arriba de la lista de elementos, en la sección superior derecha del diálogo Opciones de claqueta. Cada elemento contendrá un **Tipo:** de información. La mayor parte de los tipos de elementos obtendrán los datos necesarios desde la escena o el sistema, tales como la **Duración** de la escena, la **Ubicación de la escena*, la **Fecha actual**, etc. Otros tipos, tales como **Texto** o **Imagen** permitirán ingresar información definida por el usuario para ser mostrada en la Claqueta.

source: The settings can be saved as a *Preset* in order to be reused later, using the **Save as Preset** and **Load Preset** buttons. They can also be stored in the project's default settings by using the File → **Save Default Settings** command.
es: Las opciones podrán ser guardadas como un *Ajuste* para poder ser reusadas más adelante, mediante los botones **Guardar como ajuste** y **Cargar ajuste**. También podrán ser almacenadas como parte de las opciones predefinidas del proyecto activo, al usar el comando Archivo → **Guardar opciones predefinidas**.

source: WARNING: Adding the Clapperboard will make the scene file to lose compatibility with older versions of OpenToonz. Setting the **Duration:** back to 0 will remove the clapperboard data from the scene, so that compatibility can be restored.
es: ADVERTENCIA: Al agregar la Claqueta la escena perderá compatibilidad con versiones anteriores de OpenToonz. Sin embargo, siempre será posible volver a definir la **Duración:** de la claqueta en 0, eliminando los datos de la claqueta de la escena para recuperar así la compatibilidad.

source: **To Add a Clapperboard:**
es: **Para agregar una claqueta:**

source: Open the Render → Output Settings... dialog.
es: Abrir el diálogo Procesamiento → Opciones de salida...

source: Select any *movie* type file format (3GP, AVI, MOV, MP4 or WebM).
es: Seleccionar cualquier formato de archivo de *película* (3GP, AVI, MOV, MP4 o WebM).

source: In the More Settings section, enable the **Add Clapperboard** option.
es: En la sección Más opciones, activar la opción **Agregar claqueta**.

source: Click **Edit Clapperboard...** button. The **Clapperboard Settings** dialog opens.
es: Hacer clic en el botón **Editar claqueta...**. Se abrirá el diálogo **Opciones de claqueta**.

source: Set the **Duration (frames):** option to any value greater than 0.
es: Definir la opción **Duración (fotogramas):** en algún valor mayor que 0.

source: Setting the duration to 0 frames will remove the clapperboard data from the scene when it's saved.
es: Volver a definir la duración en 0 fotogramas, eliminará los datos de la claqueta dela escena, cuando ésta sea guardada.

source: **To temporarily deactivate the Clapperboard:**
es: **Para desactivar temporalmente la Claqueta:**

source: Open the Render → Output Settings... → More dialog section.
es: Abrir el diálogo Procesamiento → Opciones de salida... → Más.

source: Disable the **Add Clapperboard** option.
es: Desactivar la opción **Agregar claqueta**.

source: **To Delete the Clapperboard:**
es: **Para borrar la Claqueta:**

source: Set the **Duration (frames):** option value to 0.
es: Definir la opción **Duración (fotogramas):** en 0.

source: Save the scene.
es: Guardar la escena.

source: Creating Multiple Renderings
es: Procesamiento múltiple

source: With **Multiple Rendering:** it's possible to render automatically, from a single scene, several output files based on the Xsheet columns (or Timeline layers) content and according to the FX Schematic. Options are **None**, **FX Schematic Flows** and **FX Schematic Terminal Nodes**.
es: Usando **Procesamiento múltiple:** será posible crear automáticamente, para la misma escena, varios archivos de salida, basados en el contenido de las columnas de la Planilla (o capas de la Línea de tiempo) y de acuerdo con el Diagrama de efectos. Las opciones son **No**, **Flujos del diagrama de efectos** y **Nodos terminales del diagrama de efectos**.

source: **Flows**: creates as many outputs as the **flows connecting the column nodes to the Xsheet node**. Any effect nodes with multiple input ports met along the flow (such as Matte effects) will be ignored.
es: **Flujos**: permite crear tantas salidas como **flujos haya conectando los nodos de las columnas al nodo de la Planilla**. Cualquier nodo de efectos con entradas múltiples que se encuentre a lo largo del flujo (tales como los efectos Matte) será ignorado.

source: **Terminal Nodes**: creates as many outputs as the **number of nodes linked to the Xsheet node**; all the columns and effects linked to each of these nodes will be taken into account for the rendering.
es: **Nodos terminales**: permite crear tantas salidas como **la cantidad de nodos vinculados al nodo de la Planilla**; todas las columnas/capas y efectos vinculados a cada uno de estos nodos serán tomados en cuenta durante el procesamiento.

source: The names of the different output files are automatically generated in order to avoid any name conflict between file names. In particular they are built by appending to the *output file name*: the **column name**, then the **column ID** (as can be read in the node tooltip), then the **effect name**, then the **effect ID** (as can be read in the node tooltip) *in case the effect node was renamed*. For example ``scene01_B(Col3)_My Blur(Blur1)..tif`` is one of the output files of the scene *scene01* , related to the flow going from column *B* (whose ID is *Col3*) to the effect node *My Blur* (whose ID is *Blur1*).
es: Los nombres de los distintos archivos de salida serán generados automáticamente para evitar cualquier conflicto de nombres entre ellos. Concretamente éstos se generarán anexando al *nombre del archivo de salida*: el **nombre de la columna**, luego el **identificador de la columna** (tal como puede ser leído en la descripción del nodo), luego el **nombre del efecto**, luego el **identificador del efecto** (tal como puede ser leído en la descripción del nodo) *en caso de que el efecto hubiera sido renombrado*. Por ejemplo, la secuencia de archivos``escena01_B(Col3)_Mi Desenfoque(Blur1)..tif`` será una de las secuencias generadas a partir de la escena *escena01* , relativa al flujo que va desde la columna/capa *B* (cuyo identificador es *Col3*) hasta el nodo de efecto *Mi Desenfoque* (cuyo identificador es *Blur1*).

source: No output will be displayed after the rendering, regardless of **Open Flipbook after Rendering** being activated in Preferences... → Preview dialog section.
es: En este caso, al finalizar el procesamiento, no se mostrará el resultado en el Reproductor, sin importar el estado de la opción **Abrir el reproductor luego del procesamiento**, en el diálogo Archivo → Preferencias... → Previsualización.

source: If you need more control on the way scene elements are rendered, you may consider using Sub-Xsheets and the **Over** effect (see :ref:`Using Sub-Xsheets <using_sub-xsheets>` and :ref:`Over <over>` ). For example if you want a single output for a set of columns/layers, you may collapse them in a Sub-Xsheet (in case of **Flows** type multiple rendering) or connect them to several Over nodes (in case of **Terminal Nodes** type multiple rendering).
es: Si fuera necesario tener más control sobre la forma en cómo se procesarán los elementos de la escena, se recomienda considerar el uso de sub-planillas y el efecto **Over** (ver :ref:`Uso de sub-planillas <using_sub-xsheets>` y :ref:`Over <over>` ). Por ejemplo, en caso de necesitar obtener una única salida para un cierto número de columnas/capas, será posible colapsarlas a una sub-planilla (para un procesamiento múltiple de tipo **Flujos**) o conectarlas a varios nodos Over (para un procesamiento múltiple de tipo **Nodos terminales**).

source: Rendering Animations with Alpha Channel Information
es: Procesamiento de animaciones con canal alfa

source: It's possible to render a scene with a transparent background color in order to export it to editing systems supporting alpha channel information.
es: Es posible procesar una escena con un fondo transparente, para exportarla a sistemas de edición que soporten el uso de canal alfa.

source: In this case no image has to be used as background, and the output file format has to support alpha channel information, e.g. TIF at 32 or 64 bits per pixel, TGA at 32 bits per pixel, or MOV with codecs supporting alpha (i.e. Animation).
es: En este caso no será necesario usar una imagen de fondo, y el formato de archivo de salida deberá soportar información de canal alfa: TIF de 32 o 64 bits por píxel, TGA de 32 bits por píxel o MOV al usar compresores que soporten canal alfa (p.ej: Animación).

source: **To render animation with alpha channel information:**
es: **Para procesar una animación con canal alfa:**

source: Choose Xsheet → **Scene Settings...**.
es: Elegir Planilla → **Opciones de escena...**.

source: Set the alpha channel of the **Camera BG Color** to 0 (i.e. transparent).
es: Definir el *canal alfa* del **Color de fondo de cámara:** en 0 (transparente).

source: Choose an output file format supporting alpha channel information.
es: Elegir un formato de archivo de salida que soporte información de canal alfa.

source: Rendering A Loaded Scene
es: Procesamiento de una escena cargada

source: The current scene can be rendered directly while being loaded in OpenToonz according to the defined Output Settings.
es: Es posible procesar directamente la escena actual en OpenToonz, usando las opciones definidas en el diálogo Opciones de salida.

source: By choosing the appropriate range in the Output Settings it's possible to render the scene in chunks, for example by rendering a section first, and then another one. In this case the animation available in the Output location will always include all frames rendered up to that point, both if the format is a multiple-files output (e.g. TIF or TGA), and a single-file one (e.g. MP4 or MOV). The same applies if a section of the scene has to be rendered again because some corrections were needed.
es: Mediante la elección de un rango de fotogramas apropiado en las Opciones de salida, será posible procesar la escena en bloques, por ejemplo realizando el procesamiento de una sección primero y luego el de otra. En este caso, la animación que quedará disponible en la ubicación de salida siempre incluirá todos los fotogramas procesados hasta ese punto, tanto si el formato de salida fuera uno que generara múltiples archivos (p.ej: TIF o TGA), como un único archivo (p.ej: MP4 o MOV). Lo mismo aplicará si una sección de la escena tuviera que ser procesada nuevamente, para corregir algunos errores detectados.

source: If the scene contains some audio files and is rendered in a file format supporting audio (for example MP4), all the audio files will be merged to form the soundtrack of the movie (see :ref:`Creating a Soundtrack <creating_a_soundtrack>` ).
es: Si la escena contuviera algunos archivos de sonido y fuera procesada a un archivo con soporte para sonido (p.ej: MP4), todas las columnas/capas de sonido serán mezcladas para conformar la banda de sonido de la animación (ver :ref:`Creación de una banda de sonido <creating_a_soundtrack>` ).

source: Audio files loaded in Sub-Xsheets will not be included in the output soundtrack (see :ref:`Using Sub-Xsheets <using_sub-xsheets>` ).
es: Los archivos de sonido cargados en sub-planillas no serán incluidos en la banda de sonido de la Planilla/Línea de tiempo principal (ver :ref:`Uso de sub-planillas <using_sub-xsheets>` ).

source: As soon as the rendering is over, the rendered animation can be automatically displayed in a OpenToonz Flipbook by activating the **Open Flipbook after Rendering** option in the Preferences... → Preview dialog section; it's also possible to display blank frames after each rendering playback when looping. If a soundtrack is available for the rendered scene, it's also possible to listen to it.
es: Tan pronto el procesamiento haya terminado, será posible visualizar automáticamente la animación resultante en una ventana de Reproductor de OpenToonz, activando la opción **Abrir el reproductor luego del procesamiento** en el diálogo Archivo → Preferencias... → Previsualización; también será posible mostrar fotogramas en blanco luego de finalizada cada reproducción, en caso de que se encontrara activada la repetición. Si hubiera una banda de sonido disponible para la escena procesada, también será posible escucharla.

source: When displayed in the Flipbook, the rendering can be checked by using the Flipbook tools (see :ref:`Using the Flipbook <using_the_flipbook>` ).
es: Al ser visualizada en el Reproductor, la animación procesada podrá ser revisada usando las funciones del mismo (ver :ref:`Uso del Reproductor <using_the_flipbook>` ).

source: You can also activate the **Use Default Viewer for Movie Formats** option in the Preferences... → General dialog section, in order to play back the output with its own default viewer, e.g. QuickTime Player for the MOV format.
es: También es posible activar la opción **Usar reproductor predefinido para formatos de película** en el diálogo Preferencias... → General, para reproducir el video usando su propio reproductor predefinido, p.ej: QuickTime Player para el formato .MOV.

source: **To render the currently loaded scene:**
es: **Para procesar la escena actualmente cargada:**

source: Choose Render → **Render**.
es: Elegir Procesamiento → **Procesar**.

source: **To display blank frames after each rendering playback when looping:**
es: **Para mostrar fotogramas el blanco luego de cada reproducción, en modo repetición:**

source: Choose File → Preferences... → **Preview**.
es: Elegir Archivo → Preferencias... → **Previsualizar**.

source: In **Blank Frames:** set how many blank frames you want to be displayed after each preview playback, when looping.
es: En la opción **Fotogramas en blanco:** definir cuántos fotogramas en blanco se desea que se muestren luego de finalizar cada ciclo de reproducción.

source: In **Blank Frames Color:** set the color for the blank frames.
es: En la opción **Color de fotogramas en blanco:** definir el color de los fotogramas en blanco.

source: Rendering Scenes in Batch Mode
es: Procesamiento de escenas por lotes

source: The rendering of a scene can be added to a task list and performed in batch mode, in order to run it in the background while you perform other work on your computer.
es: Es posible agregar el procesamiento de una escena a una lista de tareas a ser realizadas por lotes, para poder ser ejecutadas en segundo plano, mientras se sigue trabajando en la computadora.

source: *Render tasks* can be submitted from the OpenToonz Browser and can be managed and executed in the Tasks pane, together with *Cleanup tasks* (see :ref:`Cleaning up Drawings in Batch Mode <cleaning_up_drawings_in_batch_mode>` ).
es: Es posible enviar *tareas de procesamiento* desde el Explorador de archivos de OpenToonz, y podrán ser administradas y ejecutadas desde el panel de Tareas, conjuntamente con *tareas de limpieza* (ver :ref:`Limpieza de dibujos por lotes <cleaning_up_drawings_in_batch_mode>` ).

source: |tasks_render|
es: |tasks_render_es|

source: The Tasks pane is divided into two sections: on the left there is the Task tree where all of the *Render tasks* are displayed with a clapboard icon and all the *Cleanup tasks* with a brush icon; on the right there is Information about the task selected in the Task tree.
es: El panel **Tareas** se encuentra dividido en dos secciones: a la izquierda hay un árbol de Tareas, donde se mostrarán todas las *tareas de procesamiento*, identificadas con el ícono de una claqueta, así como todas las *tareas de limpieza*, identificadas con un ícono de pincel; a la derecha se mostrará información acerca de la tarea seleccionada en el árbol de Tareas.

source: The Task list can be saved as TNZBAT files and loaded back later, in case you want to manage it through different working sessions.
es: Es posible guardar la lista de Tareas como un archivo TNZBAT, que podrá ser cargado más adelante, en caso de ser necesario acceder a ella a lo largo de varias sesiones de trabajo.

source: **To Save a Task list:**
es: **Para guardar una lista de tareas:**

source: Click the **Save** (|save|) or the **Save As** (|save_as|) buttons in the top bar of the Tasks pane.
es: Hacer clic en el botón **Guardar** (|save|) o **Guardar como** (|save_as|) en la barra superior del panel Tareas.
