Repository: WizzerWorks/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/rendering_the_animation.po
Languages: es

source: Right-click the **Tasks** item at the top of the list and choose **Save Task List** or the **Save Task List As** from the menu that opens.
es: Hacer clic derecho en el elemento **Tareas** en la parte superior de la lista y elegir **Guardar lista de tareas** o **Guardar lista de tareas como** en el menú.

source: Use the Browser that opens to save the list.
es: Usar el Explorador de archivos emergente para guardar la lista.

source: **To Load a Task list:**
es: **Para cargar una lista de tareas:**

source: Click the **Load** (|load|) button in the top bar of the Tasks pane.
es: Hacer clic en el botón **Cargar** (|load|) en la barra superior del panel Tareas.

source: Right-click the **Tasks** item at the top of the list and choose **Load Task List** from the menu that opens.
es: Hacer clic derecho en el elemento **Tareas** en la parte superior de la lista y elegir **Cargar lista de tareas** en el menú.

source: Use the Browser that opens to retrieve and load a previously saved list.
es: Usar el Explorador de archivos emergente para buscar y cargar una lista guardada con anterioridad.

source: **To resize the Tasks pane sections:**
es: **Para redimensionar las secciones del panel Tareas:**

source: Click and drag the separator to resize sections.
es: Arrastrar el separador para redimensionar sus secciones.

source: Click and drag the separator toward the window border to hide a section.
es: Arrastrar el separador hacia el borde del panel para ocultar una sección.

source: Click and drag the separator collapsed to the window border toward the window center to display again the hidden section.
es: Arrastrar el separador colapsado hacia el centro del panel para volver a mostrar la sección oculta.

source: Managing and Executing Render Tasks
es: Administración y ejecución de tareas de procesamiento

source: When a *Render task* is selected in the tree, in the section on the right of the Tasks pane task-related properties are displayed, some of which can be edited to configure the task. Properties are the following:
es: Cuando una *tarea de procesamiento* es seleccionada en el árbol de Tareas, en la sección de la derecha se mostrarán las propiedades correspondientes a la misma, algunas de las cuales podrán ser editadas para configurar la tarea. Las propiedades son las siguientes:

source: **Name** displays the task name; it can be edited to better identify the task.
es: **Nombre:**, muestra el nombre de la tarea; puede ser editado para identificar mejor a la misma.

source: **Status** shows if the task is: Waiting, Running, Completed or Failed.
es: **Estado:**, muestra en qué estado se encuentra la tarea, los estados posibles son: En espera, En ejecución, Completada o Fallida.

source: **Command Line** displays the command line related to the task execution with arguments and qualifiers.
es: **Línea de comandos:**, muestra la línea de comandos correspondiente a la ejecución de dicha tarea, con argumentos y calificadores.

source: **Server** displays the computer that is running, or will run, the task.
es: **Servidor:**, muestra la computadora que está ejecutando o ejecutará la tarea.

source: **Submitted By** displays the *user* that submitted the task.
es: **Enviada por:**, muestra el *usuario* que envió la tarea.

source: **Submitted On** displays the *computer* from where the task was submitted.
es: **Enviada desde:**, muestra la *computadora* desde donde fue enviada la tarea.

source: **Submission Date** displays *when* the task was submitted.
es: **Fecha de envío:**, muestra *cuando* fue enviada la tarea.

source: **Start Date** displays when the task execution started.
es: **Fecha de inicio:**, muestra cuándo comenzó la ejecución de la tarea.

source: **Completion Date** displays when the task execution was completed.
es: **Fecha de finalización:**, muestra cuándo finalizó la ejecución de la tarea.

source: **Duration** displays how long the execution lasted.
es: **Duración:**, muestra cuánto duró ejecución de la tarea.

source: **Step Count** displays the number of frames rendered.
es: **Cantidad de pasos:**, muestra la cantidad de fotogramas procesados.

source: **Failed Steps** displays the number of frames that failed to be rendered.
es: **Pasos fallidos:**, muestra la cantidad de fotogramas que no pudieron ser procesados.

source: **Successful Steps** displays the number of frames successfully rendered.
es: **Pasos exitosos:**, muestra la cantidad de fotogramas que fueron procesados de forma exitosa.

source: **Priority** sets the importance or urgency of the task: tasks with a higher priority will be executed first. It can be edited to change the task priority.
es: **Prioridad:**, permite definir la importancia o urgencia de la tarea: las tareas con una prioridad más alta serán ejecutadas primero. Es posible editar este parámetro para cambiar la prioridad de una tarea.

source: **Output** displays the location, name and extension of the rendered output; this information comes from the scene output settings but can be edited here before the rendering.
es: **Salida:**, muestra la ubicación, nombre y extensión de los archivos producidos; esta información proviene de las Opciones de salida de la escena, sin embargo será posible editar este parámetro aquí, antes del procesar la tarea.

source: **Frames Per Chunk** sets how the task is divided into sub-tasks in order to distribute the rendering job in the render farm, one sub-task for each computer. It can be edited to change the chunk size (see :ref:`Using Chunks when Rendering Tasks <using_chunks_when_rendering_tasks>` ).
es: **Fotogramas por bloque:** permite definir cómo se dividirá la tarea en sub-tareas para posibilitar su distribución a lo largo de la granja de procesamiento, una sub-tarea por cada computadora. Será posible editar este parámetro para cambiar el tamaño de los bloques (ver :ref:`Uso de bloques al ejecutar tareas de procesamiento <using_chunks_when_rendering_tasks>` ).

source: **From** and **To** set the scene frame range to render; this information comes from the scene output settings but can be edited here before the rendering (see :ref:`Choosing the Output Settings <choosing_the_output_settings>` ).
es: **Desde:** y **Hasta:** permite definir el rango de fotogramas a ser procesados; esta información proviene de las Opciones de salida de la escena, sin embargo será posible editar este parámetro aquí, antes del procesar la tarea (ver :ref:`Elección de Opciones de salida <choosing_the_output_settings>` ).

source: **Step** sets the step for the rendered sequence; this information comes from the scene output settings but can be edited here before the rendering (see :ref:`Choosing the Output Settings <choosing_the_output_settings>` ).
es: **Intervalo:**, permite definir el intervalo de la secuencia a ser procesada; esta información proviene de las Opciones de salida de la escena, sin embargo será posible editar este parámetro aquí, antes del procesar la tarea (ver :ref:`Elección de Opciones de salida <choosing_the_output_settings>` ).

source: **Shrink** sets the reduction value of the rendered sequence resolution; this information comes from the scene output settings but can be edited here before the rendering (see :ref:`Choosing the Output Settings <choosing_the_output_settings>` ).
es: **Reducción:**, permite definir el valor de reducción de la resolución de la secuencia a ser procesada; esta información proviene de las Opciones de salida de la escena, sin embargo será posible editar este parámetro aquí, antes del procesar la tarea (ver :ref:`Elección de Opciones de salida <choosing_the_output_settings>` ).

source: **Dedicated CPUs** sets how many processors are assigned to the rendering process; this information comes from the scene output settings but can be edited here before the rendering (see :ref:`Choosing the Output Settings <choosing_the_output_settings>` ).
es: **Procesadores dedicados:**, permite definir cuántos procesadores serán asignados al procesamiento; esta información proviene de las Opciones de salida de la escena, sin embargo será posible editar este parámetro aquí, antes del procesar la tarea (ver :ref:`Elección de Opciones de salida <choosing_the_output_settings>` ).

source: **Render Tile** sets if the rendering has to be computed in tiles; this information comes from the scene output settings but can be edited here before the rendering (see :ref:`Choosing the Output Settings <choosing_the_output_settings>` ).
es: **Celdas de procesamiento:**, permite definir si el procesamiento deberá ser dividido en celdas durante su cálculo; esta información proviene de las Opciones de salida de la escena, sin embargo será posible editar este parámetro aquí, antes del procesar la tarea (ver :ref:`Elección de Opciones de salida <choosing_the_output_settings>` ).

source: **Dependencies** lets you set which of the other submitted tasks *have to be successfully completed* before starting the current task execution: these tasks can be added from the box on the right where all submitted tasks are displayed.
es: **Dependencias:**, permite definir cuál de las otras tareas enviadas *deberá ser completada exitosamente* antes de que comience la ejecución de la tarea: estas tareas podrán ser agregadas desde el cuadro de la derecha, donde aparecerán todas las tareas enviadas.

source: Task execution can be started and stopped from the task list.
es: La ejecución de tareas podrá ser comenzada o detenida desde la lista de tareas.

source: When the tasks are executed, the icon color tells the status of the task according to the following color code:
es: Cuando las tareas son ejecutadas, el color de su ícono indicará el estado de las mismas, de acuerdo al siguiente código de colores:

source: *Grey*, when the task is *waiting* or is not executed yet.
es: *Gris*, cuando la tarea se encuentra *en espera* o aún no ha sido ejecutada.

source: *Yellow*, when the task is *being executed*.
es: *Amarillo*, cuando la tarea se encuentra *en ejecución*.

source: *Green*, when the task is *successfully executed*.
es: *Verde*, cuando la tarea ha sido *ejecutada exitosamente*.

source: *Orange*, when the task is *executed with some errors*.
es: *Naranja*, cuando la tarea ha sido *ejecutada con algunos errores*.

source: *Red*, when the task *execution has failed*.
es: *Rojo*, cuando la ejecución de la tarea *ha fallado*.

source: **To Add scenes to render in the task list:**
es: **Para agregar escenas a ser procesadas a la lista de tareas:**

source: Click the **Add Render** button (|add_render|) in the top bar of the Tasks pane and use the Browser to select a scene file.
es: Hacer clic en el botón **Procesamiento** (|add_render|) en la barra superior del panel Tareas y usar el Explorador de archivos para seleccionar un archivo de escena.

source: Select the scenes in the OpenToonz Browser, then right-click any of them and choose **Add As Render Task** from the menu that opens.
es: Seleccionar las escenas en el Explorador de archivos de OpenToonz, luego hacer clic derecho sobre alguna de ellas y elegir **Agregar como tarea de procesamiento** en el menú.

source: **To Configure the render task in the task list:**
es: **Para configurar una tarea de procesamiento en la lista de tareas:**

source: Select a render task in the task list.
es: Seleccionar una tarea de procesamiento en la lista de tareas.

source: Configure it by using the options available on the right of the list.
es: Configurarla usando las opciones disponibles a la derecha de la lista.

source: **To select tasks in the task list:**
es: **Para seleccionar tareas en la lista de tareas.**

source: Click a task to select it.
es: Hacer clic sobre una tarea para seleccionarla.

source: Shift-click a task to extend the selection up to that task.
es: Hacer Mayúsculas-clic para extender la selección hasta esa tarea.

source: Ctrl-click (PC) or Cmd-click (Mac) a task to add it to, or remove it from the selection.
es: Hacer Ctrl-clic (PC) o Cmd-clic (macOS) sobre una tarea para agregar o quitarla de la selección.

source: **To Execute selected tasks:**
es: **Para ejecutar las tareas seleccionadas:**

source: Click the **Start** (|start|) button in the top bar of the Tasks pane.
es: Hacer clic en el botón **Iniciar** (|start|) en la barra superior del panel Tareas.

source: Right-click any selected task icon and choose **Start** from the menu that opens.
es: Hacer clic derecho sobre alguna se las tareas seleccionadas y elegir **Iniciar** en el menú.

source: **To Stop the execution of selected tasks:**
es: **Para detener la ejecución de las tareas seleccionadas:**

source: Click the **Stop** (|stop|) button in the top bar of the Tasks pane.
es: Hacer clic en el botón **Detener** (|stop|) en la barra superior del panel Tareas.

source: Right-click any selected task icon and choose **Stop** from the menu that opens.
es: Hacer clic derecho sobre alguna se las tareas seleccionadas y elegir **Detener** en el menú.

source: **To Remove selected tasks from the list:**
es: **Para eliminar las tareas seleccionadas de la lista:**

source: Click the **Remove** (|remove|) button in the top bar of the Tasks pane.
es: Hacer clic en el botón **Eliminar** (|remove|) en la barra superior del panel Tareas.

source: Right-click any selected task in the list and choose **Remove** from the menu that opens.
es: Hacer clic derecho sobre alguna se las tareas seleccionadas y elegir **Eliminar** en el menú.

source: **To Add or Remove tasks from the Dependencies list:**
es: **Para agregar o eliminar tareas de la lista de Dependencias:**

source: To Add a task to the dependencies list, select a task in the task list on the right and click the **<< Add** button.
es: Para agregar una tarea a la lista de dependencias, seleccionar una tarea en la lista de la derecha y hacer clic en el botón **<< Agregar**.

source: To Remove a task from the dependencies list, select a task in the dependencies list on the left, and click the **Remove >>** button.
es: Para eliminar una tarea de la lista de dependencias, seleccionar una tarea en la lista de dependencias de la izquierda y hacer clic en el botón **Eliminar >>**.

source: Using Chunks when Rendering Tasks
es: Uso de bloques al ejecutar tareas de procesamiento

source: If you are using the OpenToonz render farm, it's possible to divide a task into chunks so that each computer of the farm will render a section of the same render task (see :ref:`Using the Toonz Farm <using_the_toonz_farm>` ).
es: Cuando se esté utilizando la granja de procesamiento de OpenToonz, será posible dividir una tarea en *bloques*, para que cada computadora de la granja pueda procesar una sección de la misma tarea de procesamiento (ver :ref:`Uso de Toonz Farm <using_the_toonz_farm>` ).

source: The default value for the chunk size (expressed in number of frames) can be set using the **Render Task Chunk Size** in the Preferences... → General dialog section. If the default value is higher than the duration (in frames) of the submitted scene, the value will be automatically adjusted to be equal to the duration of the scene.
es: Es posible establecer el valor predefinido para el tamaño de los bloques (expresado en cantidad de fotogramas) mediante la opción **Tamaño del bloque de procesamiento** en el diálogo Archivo → Preferencias... → General. Si el valor predefinido fuera mayor que la duración (en fotogramas) de la escena enviada para ser procesada, el valor será ajustado automáticamente para coincidir con la duración de dicha escena.

source: Once a task is submitted, it's possible to change the chunk size by editing the related value in the task properties.
es: Una vez que una tarea haya sido enviada, será posible cambiar el valor de tamaño del bloque editando el valor correspondiente en las propiedades de la tarea.

source: When a task is divided into chunks, each chunk of the task is represented in the task tree as a sub-task.
es: Cuando una tarea haya sido dividida en bloques, cada bloque de la misma será representado en el árbol de tareas como una sub-tarea.

source: Render tasks and sub-tasks will be distributed on the farm, one for each computer, so that several tasks can be executed at the same time (see :ref:`Using the Toonz Farm <using_the_toonz_farm>` ).
es: Las tareas y sub-tareas de procesamiento serán distribuidas en la granja, una en cada computadora, para que varias tareas puedan ser ejecutadas al mismo tiempo (ver :ref:`Uso de Toonz Farm <using_the_toonz_farm>` ).

source: If you are not using the OpenToonz render farm, dividing the task into chunks is not only useless, but it slows down the rendering process as well. For this reason it's suggested to use a high **Render Task Chunk Size** value (e.g. 1000) in the Preferences... → General dialog section.
es: Si no se estuviera utilizando la granja de procesamiento de OpenToonz, dividir las tareas en bloques no sólo será inútil, sino que probablemente también enlentecerá el procesamiento de las mismas. Por esta razón se sugiere usar un valor alto en la opción **Tamaño del bloque de procesamiento** (p.ej: 1000) en el diálogo Preferencias... → General.

source: Chunk size is relevant only when animations are rendered as image sequences (for example in TIF or TGA formats).
es: El tamaño del bloque de procesamiento sólo será relevante cuando las animaciones sean procesadas a un formato de secuencias de imágenes (por ejemplo: los formatos TIF o TGA).
