Repository: WizzerWorks/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/rendering_the_animation.po
Languages: es

source: Previewing and Rendering
es: Previsualización y procesamiento

source: In order to generate the final animation, including all the transformations and effects applied to the scene elements, the scene has to be *rendered*.
es: Para que sea posible generar la animación final, incluyendo todas las transformaciones y efectos aplicados a los elementos de la escena, será necesario *procesar* la escena.

source: It is also possible to *preview* the animation for performing checks and tune-ups before the full rendering process.
es: También será posible *previsualizar* la animación, para realizar comprobaciones y retoques, antes del procesamiento final.

source: Previewing the Animation
es: Previsualización de una animación

source: Animations can be previewed directly in the OpenToonz Viewer, including in the **Preview** mode all the Flipbook features, or by rendering a preview and visualizing it in a separate Flipbook window.
es: Será posible previsualizar las animaciones, tanto directamente en el Visor de OpenToonz (incluyendo en su modo **Previsualizar** todas las características del Reproductor), como calculando una previsualización y visualizándola posteriormente en una ventana del Reproductor.

source: In both cases the Flipbook window tools can be used, and its appearance can be customized (see :ref:`Using the Flipbook <using_the_flipbook>` ).
es: En ambos casos será posible usar las funciones de la ventana del Reproductor, y su apariencia podrá ser personalizada (ver :ref:`Uso del Reproductor <using_the_flipbook>` ).

source: If the computer performance worsens during the preview process of raster animation levels, try activating the **Minimize Raster Memory Fragmentation** option in the Preferences... → General dialog section (see :ref:`Optimizing the Memory Usage <optimizing_the_memory_usage>` ).
es: Si el rendimiento del sistema se viera enlentecido durante el proceso de previsualización de niveles de animación de Imagen, se recomienda activar la opción **Minimizar fragmentación de imágenes en memoria** en el diálogo Archivo → Preferencias... → General (ver :ref:`Optimización del uso de memoria <optimizing_the_memory_usage>` ).

source: Previewing Frames in the Viewer
es: Previsualización de fotogramas en el Visor

source: In the Viewer it is possible to activate the Preview mode to render the current frame according to the current camera (see :ref:`Using the Stage Schematic <using_the_stage_schematic>` for s).
es: Es posible activar el modo **Previsualizar** en el Visor, para visualizar el fotograma actual de acuerdo al encuadre de la cámara activa (ver :ref:`Uso del Diagrama de escenario <using_the_stage_schematic>` for s).

source: When changing the current frame, for example by using the playback buttons, it is possible to render other frames of the scene as well. The framebar displays already rendered frames in *dark grey*, frames that have yet to be rendered in *light red*, and the current frame, while being rendered in *light green* and when already rendered in *light grey*.
es: Al cambiar el fotograma actual, por ejemplo al usar los botones de reproducción, también será posible procesar otros fotogramas de la escena. La barra de fotogramas del Visor mostrará los fotogramas ya procesados en color *gris oscuro*, los que aún no han sido procesados en **rojo claro* y el fotograma actual en *verde claro* o * gris claro*, dependiendo de si aun se encuentra siendo procesado o si ya lo ha sido.

source: For the current camera it is also possible to define a **Sub-camera**, having an area smaller than the camera frame, inside which the preview will be rendered, and outside which the scene elements will be displayed as they are.
es: Es posible definir una **Región** dentro del encuadre de la cámara, que será usada para previsualizar un área más pequeña y así ahorrar recursos e incrementar el rendimiento del sistema.

source: To optimize the preview time, only the area visible in the Viewer will be rendered: if you zoom out the viewer the preview will resume to render the new visualized area.
es: Para optimizar el tiempo de previsualización, sólo se calculará el área visible en el Visor: al alejar la vista, la previsualización continuará hasta calcular la nueva área visualizada.

source: When the **Preview mode** is activated, every change made in the scene will cause the preview of frames affected by the changes to be recomputed. If, for some reason, the preview fails during the update process, you can regenerate the preview, which will automatically delete previously previewed frames, and compute them again.
es: Cuando el modo **Previsualizar** se encuentre activado, cada cambio realizado en la escena causará un recálculo de la previsualización de los fotogramas afectados por dicho cambio. Si, por alguna razón, la previsualización fallara durante el proceso de actualización, será posible regenerarla, lo que automáticamente borrará los fotogramas previsualizados anteriormente y los recalculará.

source: Once the frames are previewed, the results can be saved to disk.
es: Una vez que un fotograma ha sido previsualizado, podrá ser guardado en disco.

source: The background colors of the preview window, including the colors of the camera background, the window background and the checkerboard visible when transparent images are rendered, are those defined for the Flipbook (see :ref:`Using the Flipbook <using_the_flipbook>` ).
es: Los colores de fondo de la ventana de previsualización, incluyendo el color de fondo de la cámara, el color de fondo de la ventana y los colores del damero, visible cuando se procesan imágenes transparentes, serán los definidos para el Reproductor (ver :ref:`Uso del Reproductor <using_the_flipbook>` ).

source: When previewing frames in the Viewer it is possible to display blank frames after each preview playback, when looping (see :ref:`Using the Flipbook <using_the_flipbook>` ), and to limit the range of frames to be considered when playing back the animation by using the **Playback Markers** (see :ref:`Using the Playback Markers <using_the_playback_markers>` ).
es: Al previsualizar fotogramas en el Visor, será posible mostrar algunos fotogramas en blanco luego de finalizada cada reproducción y antes de su repetición (ver :ref:`Uso del Reproductor <using_the_flipbook>` ), y limitar el rango de fotogramas a ser considerados al reproducir la animación, usando **Marcadores de reproducción** (ver :ref:`Uso de Marcadores de reproducción <using_the_playback_markers>` ).

source: The Camera Box, the Field Guide, the Safe Area and the Guides can be shown or hidden in the Viewer during Preview as well (see :ref:`Customizing the Viewer <customizing_the_work_area>` ).
es: También será posible mostrar y ocultar en el Visor, el Marco de la cámara, la Guía de campos, las Áreas de seguridad y las Guías, durante la Previsualización (ver :ref:`Personalización del Visor <customizing_the_work_area>` ).

source: If the **Apply Shrink to Main Viewer** option is activated in the Preview Settings dialog, the previewed frames may have a reduced resolution (see :ref:`Using the Preview Window <using_the_preview_window>` ).
es: Si la opción **Aplicar reducción a visor principal** se encontrara activada en el diálogo de Opciones de previsualización, los fotogramas previsualizados podrán ser vistos a una resolución menor (ver :ref:`Uso de la ventana de previsualización <using_the_preview_window>` ).

source: **To activate and deactivate the preview:**
es: **Para activar y desactivar la previsualización:**

source: Click the **Preview** button (|preview|) in the viewer title bar to activate or deactivate the *Preview mode*.
es: Hacer clic en el botón **Previsualizar** (|preview|) en la barra de título del Visor, para activar o desactivar el *modo de previsualización*.

source: **To define a preview Sub-camera for the current camera:**
es: **Para definir una región para la cámara activa:**

source: Activate the **Define Sub-camera** button (|define_preview_subcamera|) in the viewer bottom bar.
es: Desactivar el botón **Definir región** (|define_preview_subcamera|) a la izquierda de la barra inferior del Visor.

source: Click and drag in the Viewer to define the box for the *Sub-camera area*; once the box is defined you can resize it by clicking and dragging its sides and corners, and move it by clicking and dragging inside of it.
es: Hacer clic y arrastrar en el Visor para definir la *región*, una vez definida será posible cambiar su tamaño arrastrando sus lados y esquinas, así como moverla arrastrando dentro de ella.

source: **To hide the Sub-camera box:**
es: **Para ocultar la región:**

source: Deactivate the **Define Sub-camera** button (|define_preview_subcamera|) in the Viewer bottom bar.
es: Desactivar el botón **Definir región** (|define_preview_subcamera|) a la izquierda de la barra inferior del Visor.

source: **To activate and deactivate the Sub-camera preview:**
es: **Para activar y desactivar la previsualización de la región:**

source: Click the **Sub-camera Preview** button (|subcamera_preview|) in the Viewer title bar to activate or deactivate the *Sub-camera Preview mode*.
es: Hacer clic en el botón **Previsualizar región** (|subcamera_preview|) en la barra de título del Visor para activar o desactivar el *modo de previsualización de una región*.

source: **To regenerate the preview:**
es: **Para regenarar la previsualización:**

source: Right-click in the viewer in *Preview mode* and choose from the menu that opens one of the following:
es: Con uno de los *modos de Previsualización* activados, hacer clic derecho en el Visor y elegir una de las siguientes opciones en el menú:

source: **Regenerate Frame Preview** to delete and recompute the current frame only.
es: **Regenerar previsualización de fotograma** para borrar y recalcular sólo el fotograma actual.

source: **Regenerate Preview** to delete and recompute the whole previewed frame range.
es: **Regenerar previsualización** para borrar y recalcular todo el rango de fotogramas previsualizado.

source: **To save previewed frames:**
es: **Para guardar fotogramas previsualizados:**

source: Do one of the following:
es: Realizar una de las siguientes acciones:

source: Click the **Save Images** button (|save|) in the Viewer bottom bar.
es: Hacer clic en el botón **Guardar imágenes** (|save|) a la izquierda de la barra inferior del Visor.

source: Right-click in the Viewer, and choose **Save Previewed Frames** from the menu that opens.
es: Hacer clic derecho en el Visor y elegir **Guardar fotogramas previsualizados** en el menú.

source: Use the Browser to choose a name and location for the file to be saved.
es: Usar el Explorador de archivos para elegir una ubicación y nombre para los archivos a ser guardados.

source: The saved files format will be the one currently defined in the **Output Settings** dialog, and the format options used at save time will also be the ones defined by using the **Options** button there (see :ref:`Choosing the Output Settings <choosing_the_output_settings>` ).
es: El formato de los archivos a ser guardados será el actualmente definido en el diálogo **Opciones de salida**, y las opciones de dicho formato usadas al guardar los archivos serán las que se definan al presionar el botón **Opciones** en el mismo diálogo (ver :ref:`Elección de Opciones de salida <choosing_the_output_settings>` ).

source: The saved files *color depth* will always be 8 bit, regardless of the options chosen in the Output Settings or Preview Settings dialogs.
es: La *profundidad de color* de los archivos guardados será siempre de 8 bits, sin importar qué opciones hayan sido elegidas en los diálogos Opciones de salida y Opciones de previsualización.

source: Using the Preview Window
es: Uso de la ventana de previsualización

source: The animation can be previewed in a separate window according to specific *Preview Settings*, that can be different from the *Output Settings*. In this way the preview can be configured so that it is faster to compute then the final output, for example because it uses a camera with a smaller resolution.
es: Es posible previsualizar una animación en una ventana separada, de acuerdo a las *Opciones de previsualización* definidas, que podrán ser distintas a las *Opciones de salida*. De esta forma la previsualización podrá ser configurada, para que sea calculada de manera más rápida que el procesamiento final, por ejemplo al usar una cámara de menor resolución.

source: It is possible to define the range of previewed frames both in the Preview Settings and by using the Playback Markers in the Xsheet/Timeline: any change made in one mode is reflected in the other one as well (see :ref:`Using the Playback Markers <using_the_playback_markers>` ). It is also possible to display blank frames after each preview playback, when looping.
es: Es posible definir el rango de fotogramas a ser previsualizados, tanto en las Opciones de previsualización, como usando los Marcadores de reproducción de la Planilla/Línea de tiempo: cualquier cambio realizado en uno de ellos se reflejará en el otro (ver :ref:`Uso de los Marcadores de reproducción <using_the_playback_markers>` ). También será posible indicar el uso de fotogramas en blanco al final de cada previsualización, cuando se está en modo de repetición.

source: It is possible to activate the Preferences... → Preview → **Fit to Flipbook** option to ensure that the previewed images fit the size of the preview window, regardless their resolution.
es: Es posible activar la opción Archivo → Preferencias... → Previsualización→ **Ajustar al reproductor** para asegurarse de que los fotogramas previsualizados se ajusten a la ventana del Reproductor, independientemente de su resolución.

source: It is possible to clone the Preview window, or to automatically open as many Preview windows as needed by activating the Preferences... → Preview → **Display in a New Flipbook Window** option, for example to examine or compare specific frames by using the Flipbook tools (see :ref:`Using the Flipbook <using_the_flipbook>` ).
es: Es posible clonar la ventana del Reproductor o abrir automáticamente tantas ventanas de Reproductor como sea necesario, activando la opción Archivo → Preferencias... → Previsualización → **Mostrar en una nueva ventana de reproductor**, por ejemplo para examinar o comparar fotogramas específicos, usando las funciones del Reproductor (ver :ref:`Uso del Reproductor <using_the_flipbook>` ).

source: |preview_settings_dialog|
es: |preview_settings_dialog_es|

source: As when changes are made in the scene all the preview windows automatically update, it is possible to check the animation before and after some editing by freezing any of the Previews.
es: Como cada vez que se realizan cambios en la escena todas las ventanas de previsualización serán actualizadas automáticamente, será posible comprobar la animación antes y después de cualquier edición, *congelando* cualquiera de las ventanas de previsualización.

source: The Preview window framebar displays rendered frames in *grey*, frames that have yet to be rendered in *light red*, and the current frame that is being rendered in *light green*.
es: La barra de fotogramas de la ventana de Previsualización mostrará los fotogramas ya procesados en color *gris*, los que aún no lo han sido en *rojo claro* y el fotograma actual, mientras se encuentra siendo calculado, en *verde claro*.

source: To optimize the preview time, only the area visible in the Preview window will be rendered: if you zoom out the Viewer the preview will resume to render the new visualized area.
es: Para optimizar el tiempo de previsualización, sólo el área visible en la ventana de Previsualización será procesada: si se alejara el Visor, la previsualización retomará el cálculo para procesar la nueva área visualizada.

source: The Preview Settings dialog lets you define the resolution, range, step and shrink of the preview frames. Settings are the following:
es: El diálogo de Opciones de previsualización permite definir la resolución, rango, intervalo y factor de reducción de los fotogramas a ser previsualizados. Las opciones son las siguientes:

source: **Output Camera:** sets which camera, among the ones defined in the scene, has to be used to set the resolution and preview the animation.
es: **Cámara de salida:**, permite definir cuál cámara, de entre las creadas en la escena, deberá ser usada para definir la resolución y previsualizar la animación.

source: **Frame Start:** and **End:** set the frame range of the scene to preview; by default these values refer to the whole scene length.
es: **Fotogramas:** **Inicial:** y **Final:**, permiten definir el rango de fotogramas de la escena a ser previsualizado; de forma predefinida estos valores abarcarán la longitud completa de la escena.

source: **Step:** sets the step for the rendered sequence; for example if it is two, one frame each two will be rendered.
es: **Intervalo:**, permite definir el intervalo de la secuencia previsualizada; por ejemplo si fuera 2, se procesará un fotograma de cada dos.

source: **Shrink:** sets the reduction value for the previewed sequence resolution; for example if it is 2, one pixel each two will be rendered, thus resulting in previewed frames having half of the original output camera resolution.
es: **Reducción:**, permite definir el valor de reducción de la resolución de la secuencia previsualizada; por ejemplo si fuera 2, se procesará un píxel de cada dos, resultando así en fotogramas con la mitad de la resolución de la cámara de salida seleccionada.

source: **Apply Shrink to Main Viewer** if activated uses the shrink value set in the preview settings to the preview mode of the viewer as well (see :ref:`Previewing Frames in the Viewer <previewing_frames_in_the_viewer>` ).
es: **Aplicar reducción a visor principal**, cuando se encuentra activada permite usar el valor de Reducción, cuando el Visor se encuentre en modo **Previsualizar** (ver :ref:`Previsualización de fotogramas en el Visor <previewing_frames_in_the_viewer>` ).

source: **Resample Balance:** controls the resample that is used when images are scaled or rotated. In scenes where images are strongly resampled, for instance when their size changes dramatically, the final rendering may appear slightly out of focus. By balancing the resample you can give some sharpness back to the rendered frames.
es: **Filtro:**, permite controlar el proceso de remuestreo que será usado cuando las imágenes sean redimensionadas o rotadas. En escenas donde las imágenes sean fuertemente remuestreadas, por ejemplo cuando sus tamaños cambien drásticamente, la imagen final podría llegar a aparecer ligeramente fuera de foco. Controlando el tipo de filtro aplicado al remuestrear la imagen, será posible restaurar en alguna medida su definición.

source: There are several options to choose from. Originally *Toonz* provided three options: **Standard**, **Improved**, **High**. The higher the balance chosen, the longer the time needed for rendering the output. Additionally, *OpenToonz* provides several other standard resampling filters that could help improve the final results in a wider range of situations.
es: Existen varias opciones de entre las cuales escoger. Originalmente en *Toonz* existían sólo tres opciones: **Estándar**, **Mejorado** y **Alto**. Cuanto mayor fuera la intensidad del filtro usado, más tiempo sería necesario para procesar la imagen final. En *OpenToonz* existen otros filtros adicionales de remuestreo, que podrán ayudar a mejorar el resultado final, ante diferentes situaciones.

source: **Channel Width:** sets the color depth for rendered images; choices are 8 bit or 16 bit per color channel.
es: **Profundidad de color:**, permite definir la profundidad de color de las imágenes procesadas; las opciones son 8 y 16 bits por canal de color.

source: **Dedicated CPUs:** sets, in case your computer has multiple CPUs, how many processors will be assigned to the previewing process. Setting the value to All will generate a number of rendering threads equal to the number of processors, thus speeding up the previewing process. However it is suggested to use the Half or Single values if the scene to preview is very complex, because the higher the dedicated CPUs, the more the memory required to perform the preview.
es: **Procesadores dedicados:**, permite cuántos núcleos de procesador deberán ser usados durante el proceso de previsualización. Cuando la opción está en **Todos** se generará una cantidad de hilos de procesamiento igual a la cantidad de núcleos procesador disponibles en el sistema, acelerando el cálculo de la previsualización. Sin embargo, si la escena a previsualizar fuera de una complejidad alta, se sugiere usar **La mitad** o **Uno solo**, debido a que cuantos más núcleos sean usados se requerirá una mayor cantidad de memoria para llevar a cabo el cálculo.

source: **Render Tile:** allows the preview of very complex scenes whose frames will be computed in tiles that are automatically stitched to create the final preview: the smaller the size of the tile, the longer the preview process. Setting the value to Medium or Small will allow the preview of very high resolution outputs of very complex scenes, that otherwise may fail to be previewed; setting the value to None may prevent some artifacts that the tile stitching may generate. In most of the cases the Large value will do the work, because it is not slower than the None option, and yet is able to preview complex scenes.
es: **Celdas de procesamiento:**, permite previsualizar escenas muy complejas, cuyos fotogramas serán calculados en celdas individuales, que luego serán compuestas una junto a la otra para crear la imagen completa: cuanto más pequeño sea el tamaño de las celdas, más tiempo insumirá el proceso de previsualización. Definir el tamaño de las celdas en **Medianas** o **Pequeñas** permitirá previsualizar imágenes de una gran resolución y de escenas muy complejas que, de otro modo, podrían fallar al intentar ser calculadas; al definir este valor en **No** será posible prevenir la aparición de algunos defectos de imagen, generados al componer las celdas entre ellas. En la mayoría de los casos el valor **Grandes** debería funcionar correctamente, debido a que no es más lento que la opción **No** y aún así será posible previsualizar escenas complejas.

source: **Use Sub-camera**, when activated, uses the sub-camera defined for the selected camera in the preview frames (see :ref:`Previewing Frames in the Viewer <previewing_frames_in_the_viewer>` ).
es: **Usar región**, al estar activada permitirá usar, al previsualizar, la región definida para la cámara activa en el Visor (ver :ref:`Previsualización de fotogramas en el Visor <previewing_frames_in_the_viewer>` ).

source: **To set the scene preview settings:**
es: **Para definir las opciones de previsualización de la escena:**

source: Choose Render → **Preview Settings...**.
es: Elegir Procesamiento → **Opciones de previsualización...**.

source: Set the options you want to use for the preview.
es: Definir las opciones que se deseen usar para la previsualización.

source: **To open the preview window:**
es: **Para abrir una ventana de previsualización:**

source: Choose Render → **Preview**.
es: Elegir Procesamiento → **Previsualizar**.

source: **To clone the preview window:**
es: **Para clonar la ventana de previsualización:**

source: Right-click in the Flipbook window and choose **Clone Preview** from the menu that opens.
es: Hacer clic derecho en la ventana del Reproductor y elegir **Clonar previsualización** en el menú.

source: **To freeze the preview rendering:**
es: **Para congelar el cálculo de una previsualización:**
