Repository: WizzerWorks/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/rendering_the_animation.po
Languages: es

source: Right-click in the Flipbook window and choose **Freeze Preview** from the menu that opens.
es: Hacer clic derecho sobre el Reproductor y elegir **Congelar previsualización**.

source: **To open a new Flipbook window every time you run a preview:**
es: **Para abrir una ventana nueva del Reproductor cada vez que se previsualiza algo:**

source: In File → Preferences... → Preview.
es: En Archivo → Preferencias... → Previsualización.

source: Activate the **Display in a New Flipbook Window** option.
es: Activar la opción **Mostrar en una nueva ventana de reproductor**.

source: **To rewind the preview content automatically after playback:**
es: **Para retroceder el contenido de la previsualización automáticamente luego de la reproducción:**

source: Activate the **Rewind After Playback** option.
es: Activar la opción **Retroceder al comienzo después de reproducir**.

source: **To display blank frames after each preview playback when looping:**
es: **Para mostrar fotogramas en blanco luego de cada reproducción, al estar en modo repetición:**

source: Do any of the following:
es: Realizar cualquiera de las siguientes acciones:

source: Use **Blank Frames** option to set how many blank frames you want to be displayed after each preview playback, when looping.
es: Usar la opción **Fotogramas en blanco:** para definir cuántos fotogramas en blanco deberán ser mostrados luego de cada reproducción, al estar en modo repetición.

source: Use **Blank Frames Color** option to set the color for the blank frames.
es: Usar la opción **Color de fotogramas en blanco:** para definir el color de los fotogramas en blanco.

source: Previewing and Caching Effect Nodes in the Schematic
es: Previsualización y caché de nodos de efectos en el Diagrama

source: The Preview window can also be opened from the FX Schematic, to check the compositing result up to a specific node. The behaviour of the FX Schematic Preview window is the same as the standard one (see :ref:`Using the Preview Window <using_the_preview_window>` ).
es: También es posible abrir la ventana de previsualización desde el Diagrama de efectos, para comprobar el resultado de la composición, hasta un cierto nodo. El comportamiento de la ventana de previsualización del Diagrama de efectos es el mismo que el de la ventana normal (ver :ref:`Uso de la ventana de previsualización <using_the_preview_window>` ).

source: In case the Sub-camera is used, the Preview window will fit the Sub-camera area (see :ref:`Using the Preview Window <using_the_preview_window>` ).
es: En caso de que se utilice la Región, la ventana de previsualización se ajustará a la misma (ver :ref:`Uso de la ventana de previsualización <using_the_preview_window>` ).

source: It is also possible to cache the preview up to a specific node, so that the result of the compositing up to that node is stored in the computer memory and will be reused with no need to recompute it the next time the preview is run.
es: También será posible guardar en un caché la previsualización hasta un cierto nodo, para que el resultado de la composición hasta ese nodo sea guardada en la memoria del sistema para ser reusado sin necesidad de recalcularla la próxima vez que la previsualización sea ejecutada.

source: Of course if something changes in the flow up to the cached node (for example if an object transformation or an effect parameter is changed), the cached preview will be discarded and will be stored again the next time the Preview is run.
es: Por supuesto, si algo cambiara en el flujo de nodos hasta ese punto (por ejemplo, si cambiara la transformación de un objeto o el parámetro de un efecto), la previsualización guardada en el caché será descartada y se calculará nuevamente la próxima vez que el comando **Previsualizar** sea ejecutado.

source: **To open a Preview window referring to an FX Schematic node:**
es: **Para abrir una ventana de previsualización de un nodo del Diagrama de efectos:**

source: Right-click the node and choose **Preview** from the menu that opens.
es: Hacer clic derecho sobre el nodo deseado y elegir **Previsualizar** en el menú.

source: **To cache an effect node:**
es: **Para guardar en caché un nodo de efecto:**

source: Right-click the node and choose **Cache FX** from the menu that opens: the effect node will be displayed with a fold at the bottom right corner to highlight that it has been cached.
es: Hacer clic derecho sobre el nodo y elegir **Guardar efecto en caché** en el menú: el nodo de efecto será mostrado con un *alfiler* en su esquina inferior derecha, indicando que ha sido almacenado en caché.

source: **To uncache an effect node:**
es: **Para borrar el caché de un nodo de efecto:**

source: Right-click the node and choose **Cache FX** from the menu that opens: the cached preview images will be discarded.
es: Hacer clic derecho sobre el nodo y elegir **Eliminar caché del efecto** en el menú: las imágenes de previsualización almacenadas en el caché serán descartadas.

source: Using the Flipbook
es: Uso del Reproductor

source: The Flipbook is an image viewer where animation levels, images, clips and rendered frames can be displayed. In OpenToonz it is used to display the scene contents in the Viewer, including the Preview mode, and to display the previewed or rendered animations. It is also used to view files and levels from the browser or the Xsheet/Timeline, and to display the loaded Color Model.
es: El Reproductor es un visor de imágenes donde es posible visualizar niveles de animación, imágenes, clips de video y fotogramas procesados. En OpenToonz es usado para mostrar el contenido de la escena en el Visor, incluyendo su modo Previsualizar, así como para mostrar las animaciones previsualizadas o ya procesadas. También es usado para ver archivos y niveles de animación desde el Explorador de archivos o la Planilla/Línea de tiempo, así como para mostrar el Modelo de color cargado.

source: The Safe Area is the only element that can be shown or hidden in the Flipbook when previewing the animation (see :ref:`Customizing the Viewer <customizing_the_work_area>` ).
es: Las áreas de seguridad son los únicos elementos que podrán ser mostrados sobre el Reproductor, al previsualizar una animación (ver :ref:`Personalización del Visor <customizing_the_work_area>` ).

source: The Flipbook title bar displays the information about the content on the left, and the zoom percentage on the right.
es: En la barra de título del Reproductor, se muestra información acerca del contenido a la izquierda y a la derecha el porcentaje de zoom.

source: At the bottom a customizable set of buttons is available:
es: En la parte inferior se encuentra disponible un conjunto de botones personalizable:

source: The **Option** button (|option|) sets which buttons and elements have to be displayed in the bottom bar.
es: El botón de **Opciones** (|option|) permite definir qué botones y elementos deberán ser mostrados en la barra inferior.

source: The **Save Images** button (|save|) opens a browser to save the flipbook content.
es: El botón **Guardar imágenes** (|save|) abre un Explorador de archivos para guardar el contenido del Reproductor.

source: The **Snapshot** (|snapshot|) and **Compare to Snapshot** (|compare|) buttons allow the comparison between different frames of the flipbook content.
es: Los botones **Capturar** (|snapshot|) y **Comparar con captura** (|compare|) permiten realizar comparaciones entre distintos fotogramas del contenido del Reproductor.

source: The **Define Sub-camera** button (|define_preview_subcamera|) allows the definition of a region, smaller than the size of the loaded image sequence, that will limit the portion of the images that will be displayed in the Flipbook. It may prove useful to speed up the loading time and increase the playback speed, when you are only interested in a certain region of the full camera image.
es: El botón **Definir región** (|define_preview_subcamera|) permite la definición de una región, más pequeña que el tamaño de las imágenes cargadas, que limitará la porción de las imágenes que serán mostradas en el Reproductor. Puede resultar útil para hacer más rápido el tiempo de carga e incrementar la velocidad de reproducción, cuando sólo haya interés en una cierta región de la imagen mostrada por la cámara.

source: The **Sub-camera Preview** button (|subcamera_preview|) lets you activate or deactivate the defined sub-camera region (see above).
es: El botón **Previsualizar región** (|subcamera_preview|) permite activar o desactivar la región de previsualización definida (ver arriba).

source: The **Background** color buttons sets a **White** (|preview_white|), **Black** (|preview_black|) or **Checkered** (|preview_checkboard|) background for transparent images.
es: Los botones de color de fondo permiten elegir entre un **Fondo blanco** (|preview_white|), **Fondo negro** (|preview_black|) o un **Fondo con damero** (|preview_checkboard|) para ver imágenes con transparencias.

source: The framerate slider sets the number of frames per second to be displayed during playback.
es: El deslizador de velocidad de fotogramas permite definir la cantidad de fotogramas por segundo a la que deberá reproducirse la animación.

source: The playback buttons can be used to play the Flipbook content back and set the current frame.
es: Los botones de reproducción podrán ser usados para reproducir el contenido del Reproductor y establecer el fotograma actual.

source: The **Channel** buttons display the Red, Green, Blue and Alpha channels of the Flipbook content, both in *colors* and *grey-scale*.
es: Los botones de **Canales de color** permiten visualizar los canales Rojo, Verde, Azul y Alfa del contenido del Reproductor, tanto en *color* como en *escala de grises*.

source: The **Histogram** button (|histogram|) opens a window displaying histograms mapping the amount of the darkest and lightest pixels in each channel.
es: El botón de **Histograma** (|histogram|) abre una ventana que permite visualizar histogramas, donde se podrá apreciar la cantidad de píxeles de cada tonalidad (desde la más clara hasta la más oscura) para cada canal.

source: If the bottom bar is too short to display all the options, it can be scrolled by using arrow buttons available at its ends.
es: Si la barra inferior fuera muy corta para mostrar todas las opciones, podrá ser desplazada, usando los botones de flechas disponibles en sus extremos.

source: In an opened Flipbook it is possible to load new contents both replacing the previous animation, or appending the new contents to it. When several Flipbooks are opened, their playback can be *linked*, so that moving the current frame or playing the contents back in one of them, automatically moves the current frames and plays the contents back in *all* the other Flipbooks as well.
es: En un Reproductor ya abierto, será posible cargar un nuevo contenido, tanto reemplazando el anterior, como anexándolo al mismo. Cuando hubiera varios Reproductores abiertos, será posible *vincular* su reproducción, para que al mover el fotograma actual o reproducir en uno de ellos, automáticamente lo haga en *todos* los demás Reproductores abiertos.

source: The colors displayed as background in the flipbook can also be customized so that they can better fit the color scheme of the production.
es: Los colores mostrados como fondo en el reproductor podrán ser personalizados, para que se ajusten al esquema de colores de una determinada producción.

source: **To open a Flipbook:**
es: **Para abrir un Reproductor:**

source: Choose Windows → **Flipbook**.
es: Elegir Ventanas → **Reproductor**.

source: **To load some contents into a Flipbook:**
es: **Para cargar contenido en un Reproductor:**

source: Right-click in the Flipbook and choose **Load Images** from the menu that opens, then use the Browser to retrieve the file you want to load.
es: Hacer clic derecho en el Reproductor y elegir **Cargar / Anexar imágenes** en el menú, luego usar el Explorador de archivos para elegir el archivo que se desee cargar y presionar el botón **Cargar**.

source: Drag and drop the file you want to load from the OpenToonz file browser to the Flipbook.
es: Arrastrar y soltar el archivo que se desee cargar desde el Explorador de archivos de OpenToonz hacia el Reproductor.

source: **To append some content to the Flipbook content:**
es: **Para anexar contenido al contenido del Reproductor:**

source: Right-click in the Flipbook and choose **Append Images** from the menu that opens, then use the Browser to retrieve the file you want to append to the current content.
es: Hacer clic derecho en el Reproductor y elegir **Cargar / Anexar imágenes** en el menú, luego usar el Explorador de archivos para elegir el archivo que se desee anexar y presionar el botón **Anexar**.

source: **To navigate the Flipbook content:**
es: **Para ajustar la vista del Reproductor:**

source: Use the zoom shortcut keys (by default **+** and **-** keys) to zoom in and zoom out at specific steps (e.g. 50%, 100%, 200%, etc.).
es: Usar los atajos de zoom (de forma predefinida **+** y **-**) para acercar y alejar de a saltos predefinidos (50%, 100%, 200%, etc.).

source: Use the mouse wheel to zoom in and zoom out.
es: Usar la rueda del ratón para acercar y alejar la vista.

source: Click and drag to define an area you want to zoom to.
es: Hacer clic y arrastrar para definir un área que se desee acercar.

source: Use the Reset View shortcut (by default the **Alt + 0** key), or right-click in the Viewer and choose **Reset View** from the menu that opens, to display the Flipbook content at its actual size, and centered on the image center.
es: Usar el atajo de la función Restablecer vista (de forma predefinida **Alt + 0**) o hacer clic derecho sobre la vista y elegir **Restablecer vista** en el menú, para visualizar el contenido del Reproductor a su tamaño real y centrado en el visor.

source: Middle-click and drag to scroll in any direction.
es: Hacer clic central y arrastrar para desplazar en cualquier dirección.

source: **To fit the size of the Flipbook window to its content:**
es: **Para ajustar el tamaño de la ventana del Reproductor a su contenido:**

source: Double-click the Flipbook title bar.
es: Hacer doble clic sobre la barra de título del Reproductor.

source: **Windows only - to enter/exit the Flipbook full screen mode:**
es: **Sólo Windows - Para ingresar/salir del modo a pantalla completa del Reproductor:**

source: Right-click the Flipbook and choose **Full Screen Mode** / **Exit Full Screen Mode** from the menu that opens.
es: Hacer clic derecho sobre el Reproductor y elegir **Modo a pantalla completa** / **Salir del modo a pantalla completa** en el menú.

source: **To customize the Flipbook bottom bar:**
es: **Para personalizar la barra inferior del Reproductor:**

source: Use the **Option** button (|option|) to choose which buttons and elements have to be displayed: only selected items will be displayed.
es: Usar el botón de **Opciones** (|option|) para elegir qué botones y elementos deberán ser mostrados: sólo se mostrarán los elementos seleccionados.

source: **To play the Flipbook content back:**
es: **Para reproducir el contenido del Reproductor:**

source: Use the **Play** button.
es: Usar el botón **Reproducir**.

source: Drag the frame bar cursor.
es: Arrastrar la barra de fotogramas.

source: **To rewind the Flipbook content automatically after playback:**
es: **Para retroceder el contenido del Reproductor automáticamente luego de la reproducción:**

source: Activate the **Rewind after Playback** option.
es: Activar la opción **Retroceder al comienzo después de reproducir** en el diálogo Archivo → Preferencias → Previsualización.

source: **To set the current frame:**
es: **Para definir el fotograma actual:**

source: Use the playback buttons.
es: Usar los botones de reproducción.

source: Type in the frame bar field the number of the frame you want to view.
es: Ingresar en el campo de fotograma, en la esquina inferior izquierda, el número del fotograma que se desee visualizar.

source: **To link the playback of all the open Flipbook windows:**
es: **Para vincular la reproducción de todas las ventanas de Reproductor abiertas:**

source: Choose Play → **Link Flipbooks** to activate or deactivate the linked playback mode.
es: Elegir Reproducción → **Vincular reproductores** para activar o desactivar el modo de reproducción vinculada.

source: **To set the playback frame rate:**
es: **Para definir la velocidad de reproducción:**

source: Use the frame rate slider; by default the framerate is the one set in the **Scene Settings** dialog (see :ref:`Setting the Frame Rate <setting_the_frame_rate>` ).
es: Usar el deslizador de velocidad de fotogramas; de forma predefinida la velocidad será la definida en el diálogo de **Opciones de escena** (ver :ref:`Definición de la velocidad <setting_the_frame_rate>` ).

source: **To save the Flipbook content:**
es: **Para guardar el contenido del Reproductor:**

source: Right-click in the Flipbook and choose **Save Images** from the menu that opens.
es: Hacer clic derecho en el Reproductor y elegir **Guardar imágenes** en el menú.

source: Click the **Save Images** button (|save|) in the Flipbook bottom bar.
es: Hacer clic en el botón **Guardar imágenes** (|save|) en la barra inferior del Reproductor.

source: Use the Browser to choose a name, a format and a location for the file to be saved.
es: Usar el Explorador de archivos para elegir una ubicación y nombre para los archivos a ser guardados.

source: **To take a snapshot of a frame and compare it to another frame:**
es: **Para tomar una captura de un fotograma y compararlo con otro:**

source: Select the frame you want to store and click the **Snapshot** button (|snapshot|) in the Flipbook bottom bar.
es: Seleccionar el fotograma que se desee guardar y hacer clic en el botón **Capturar** (|snapshot|) en la barra inferior del Reproductor.

source: Move to a different frame, or load some different content, and click the **Compare to Snapshot** button (|compare|).
es: Moverse a otro fotograma o cargar un contenido distinto y hacer clic en el botón **Comparar con captura** (|compare|).

source: Click and drag the vertical or horizontal marker to display the taken snapshot under the current frame.
es: Hacer clic y arrastrar el separador vertical u horizontal para mostrar la captura tomada junto al fotograma actual.

source: Click again the **Compare to Snapshot** button (|compare|) to exit the compare mode.
es: Hacer clic nuevamente en el botón **Comparar con captura** (|compare|) para salir del modo de comparación.

source: **To Define the Loading Box:**
es: **Para Definir una región:**

source: Load in the Flipbook the sequence of images you want to visualize.
es: Cargar en el Reproductor la secuencia de imágenes que se desee visualizar.

source: Activate the **Define Loading Box** button (|define_preview_subcamera|) in the Flipbook bottom bar.
es: Activar el botón **Definir región** (|define_preview_subcamera|) en la barra inferior del Reproductor.

source: Click and drag in the image to Define the Loading Box; once the box is defined you can resize it by clicking and dragging its sides and corners, and move it by clicking and dragging inside it.
es: Hacer clic y arrastrar sobre la imagen para definir la región; una vez definida, será posible redimensionarla arrastrando sus lados y esquinas, así como moverla arrastrando en su interior.

source: **To activate and deactivate the Loading Box:**
es: **Para activar y desactivar la región:**

source: Click the **Use Loading Box** button (|subcamera_preview|) in the Flipbook bottombar to activate or deactivate the loading box.
es: Hacer clic en el botón **Usar región** (|subcamera_preview|) en la barra inferior del Reproductor para activar o desactivar la región.

source: **To set the Flipbook background color for transparent images:**
es: **Para definir el color del fondo del Reproductor al cargar imágenes transparentes:**

source: Click the **White Background** (|preview_white|), **Black Background** (|preview_black|) or **Checkered Background** (|preview_checkboard|) buttons in the Flipbook bottom bar to activate/deactivate the desired background color.
es: Hacer clic sobre los botones **Fondo blanco** (|preview_white|), **Fondo negro** (|preview_black|) o **Fondo con damero** (|preview_checkboard|) en la barra inferior del Reproductor para activar/desactivar el color de fondo deseado.

source: In the Preview window and when the Viewer is in *Preview mode* the background color will be visible behind the *Camera BG Color* (see below ).
es: En la ventana del Reproductor o cuando el Visor se encuentra en *modo Previsualizar*, el color de fondo será visible detrás del *Color de fondo de cámara* (ver abajo).

source: **To set the image channels to be displayed:**
es: **Para definir los canales de color a ser mostrados:**

source: Click the top section of the **Red**, **Green** and **Blue** buttons in the Flipbook bottom bar to display, or hide, the related *image channel* in colors.
es: Hacer clic sobre la parte superior de los botones de los canales **Rojo**, **Verde** y **Azul** en la barra inferior del Reproductor para mostrar/ocultar los respectivos *canales de la imagen* en color.

source: Click *the bottom* section of the **Red**, **Green** and **Blue** buttons in the Flipbook bottom bar to display, or hide, the related *image channel* in grey-scale.
es: Hacer clic sobre la parte inferior de los botones de los canales **Rojo**, **Verde** y **Azul** en la barra inferior del Reproductor para mostrar/ocultar los respectivos *canales de la imagen* en escala de grises.

source: Click the **Alpha Channel** button in the Flipbook bottom bar to display, or hide, the image alpha channel.
es: Hacer clic sobre el botón de **Canal alfa** en la barra inferior del Reproductor para mostrar/ocultar el *canal alfa* de la imagen.

source: When no channel button is activated the full image is displayed.
es: Cuando ninguno de los botones se encontrara activado, se mostrará la imagen de forma normal.

source: **To display the Histograms of the Flipbook content:**
es: **Para mostrar los Histogramas del contenido del Reproductor:**

source: Click the **Histogram** button (|histogram|) in the Flipbook bottom bar.
es: Hacer clic en el botón **Histograma** (|histogram|) en la barra inferior del Reproductor.

source: Right-click the Flipbook content and choose **Show Histogram** from the menu that opens.
es: Hacer clic derecho sobre el contenido del Reproductor y elegir **Mostrar histograma** en el menú.

source: Choose the channel for which you want to see the histogram.
es: Elegir el canal para el cual se desee ver el histograma.

source: **To define the previewed images background color:**
es: **Para definir el color de fondo de las imágenes previsualizadas:**

source: Choose Xsheet → **Scene Settings...**
es: Elegir Planilla → **Opciones de escena...**

source: Set the **Camera BG Color** by doing one of the following:
es: Definir el **Color de fondo de cámara:** realizando una de las siguientes acciones:

source: Set the **Red**, **Green** and **Blue** values.
es: Definir los valores de **Rojo**, **Verde**, **Azul** y **Alfa**.

source: Click the *color thumbnail* and use the Style Editor to edit it (see :ref:`Plain Colors <plain_colors>` ).
es: Hacer clic sobre la *miniatura de color* y usar el Editor de estilos para editarlo (ver :ref:`Colores <plain_colors>` ).

source: This color is relevant only in the Preview window and when the Viewer is in *Preview mode*.
es: Este color solo será relevante en la ventana del Reproductor y cuando el Visor se encuentre en modo **Previsualizar**.

source: **To define the Flipbook checkerboard colors:**
es: **Para definir los colores del damero del Reproductor:**
