Repository: WizzerWorks/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/rendering_the_animation.po
Languages: es

source: Set the **Checkerboard Color 1** and **Color 2** by doing one of the following:
es: Definir los colores **Damero - Color 1** y **Damero - Color 2** realizando una de las siguientes acciones:

source: Set the Red, Green and Blue values.
es: Definir los valores de Rojo, Verde y Azul.

source: Click the color thumbnail and use the Style Editor to edit it (see :ref:`Plain Colors <plain_colors>` ).
es: Hacer clic sobre la miniatura de color y usar el Editor de estilos para editarlo (ver :ref:`Colores <plain_colors>` ).

source: Using the Playback Markers
es: Uso de Marcadores de reproducción

source: Two markers, **Playback Start Marker** and **Playback End Marker**, are available in the frame column of the Xsheet (and the frame row of the Timeline) to define the playback range.
es: Existen dos marcadores, **Marcador de Inicio de reproducción** y **Marcador de Fin de reproducción**, disponibles en la columna de fotogramas de la Planilla (y la barra de tiempo de la Línea de tiempo) que permiten definir el rango de fotogramas a ser reproducidos.

source: The user can manually set the playback markers to define the *starting* and *ending* frames to be considered when playing back the animation, or leave them unset, so OpenToonz automatically defines a playback range that includes all of the Xsheet/Timeline contents.
es: Será posible definirlos de forma manual para demarcar los fotogramas de *inicio* y *fin*, a ser considerados al reproducir una animación, o dejarlos sin definir para que OpenToonz automáticamente los ajuste al contenido expuesto en la Planilla/Línea de tiempo.

source: When the playback markers are activated, the frame range in the **Preview Settings...** dialog changes accordingly (see :ref:`Using the Preview Window <using_the_preview_window>` ).
es: Cuando los marcadores de reproducción se encuentren activados, el rango de fotogramas en el diálogo **Opciones de previsualización** cambiará correspondientemente (ver :ref:`Uso de la ventana de previsualización <using_the_preview_window>` ).

source: **To set a playback range:**
es: **Para definir el rango de reproducción:**

source: Set the starting frame by doing one of the following:
es: Definir el fotograma de inicio realizando una de las siguientes acciones:

source: Drag the **Playback Start Marker** to the desired frame.
es: Arrastrar el **Marcador de Inicio** hasta el fotograma deseado.

source: Right-click on the desired frame in the frame column/bar and select **Set Start Marker** from the menu that shows.
es: Hacer clic derecho sobre el fotograma deseado en la columna/barra de fotogramas y seleccionar **Definir marcador de Inicio** en el menú.

source: Set the ending frame by doing one of the following:
es: Definir el fotograma de finalización realizando una de las siguientes acciones:

source: Drag the **Playback End Marker** to the desired frame.
es: Arrastrar el **Marcador de Fin** hasta el fotograma deseado.

source: Right-click on the desired frame in the frame column and select **Set Stop Marker** from the menu that shows.
es: Hacer clic derecho sobre el fotograma deseado en la columna de fotogramas y seleccionar **Definir marcador de Fin** en el menú.

source: **To set the playback range to match the duration of a block of contiguous exposed cells:**
es: **Para hacer que el rango de reproducción coincida con la duración de un bloque de celdas contiguas expuestas:**

source: In the Xsheet/Timeline, select an exposed cell from the desired column/layer.
es: En la Planilla/Línea de tiempo, seleccionar una celda expuesta de la columna/capa deseada.

source: Right-click on the desired frame in the frame column and select **Set Auto Markers** from the menu that shows.
es: Hacer clic derecho sobre el fotograma deseado en la columna/barra de fotogramas y seleccionar **Definir marcadores automáticamente** en el menú.

source: There must be an exposed cell in that column/layer at that frame for the **Set Auto Markers** option to be available.
es: Deberá existir una celda expuesta en la columna/capa seleccionada en ese fotograma, para que la opción **Definir marcadores automáticamente** esté disponible.

source: No matter to what block of contiguous exposed cells the selected cell belongs to, this function will take into account the frame in which the user performed the right click operation to set the markers.
es: No importa a qué bloque de celdas contiguas pertenezca la celda seleccionada, esta función tomará en cuenta el fotograma en el que el usuario realizó la operación de clic derecho para definir los marcadores.

source: **To set a single-frame playback range:**
es: **Para definir un rango de reproducción de un solo fotograma:**

source: Right-click on the desired frame in the frame column/bar and select **Preview This** from the menu that shows.
es: Hacer clic derecho sobre el fotograma deseado, en la columna/barra de fotogramas, y seleccionar **Previsualizar esto** en el menú.

source: **To unset the playback markers:**
es: **Para eliminar los marcadores de reproducción definidos anteriormente:**

source: Right click on the frame column and select **Remove Markers** from the menu that shows.
es: Hacer clic derecho sobre la columna/barra de fotogramas y seleccionar **Eliminar marcadores** en el menú.

source: When deactivated, playback markers turn *grey*.
es: Cuando se encuentren desactivados, los marcadores de reproducción se mostrarán en color *gris*.

source: Rendering the Animation
es: Procesamiento de una animación

source: Final animations can be rendered directly by loading the related scene, or in batch mode. In both cases the rendering properties are defined in the Output Settings dialog.
es: Es posible procesar las animaciones finales cargando directamente la escena correspondiente o en modo por lotes. En ambos casos las opciones de procesamiento serán definidas en el diálogo de Opciones de salida.

source: Information about the scene name and frame number can be included when needed in rendered frames by activating the **Show Info in Rendered Frames** option in the Preferences... → General dialog section.
es: De ser necesario, será posible incluir información respecto al nombre de la escena y el número de fotograma en los fotogramas procesados, activando la opción **Sobreimprimir información en los fotogramas procesados** en el diálogo Archivo → Preferencias... → General.

source: Choosing the Output Settings
es: Elección de Opciones de salida

source: The Output Settings dialog lets you define the file format, location and properties for the final rendering. Settings are the following:
es: El diálogo Opciones de salida permite definir el formato de archivo, ubicación y otras propiedades para el procesamiento final. Las opciones son las siguientes:

source: |output_settings_dialog|
es: |output_settings_dialog_es|

source: Camera Settings
es: Opciones de cámara

source: **Output Camera:** sets which camera, among the ones defined in the scene, has to be used to render the animation.
es: **Cámara de salida:**, permite definir cuál de las cámaras definidas en la escena deberá ser usada para procesar la animación.

source: **Frame Size** sets the frame size of the current camera, also available in the Xsheet → **Camera Settings...** dialog (see :ref:`Defining Camera Settings <defining_camera_settings>` ).
es: **Tamaño de la imagen**, permite definir la resolución de la cámara activa, también disponible en el diálogo Planilla → **Opciones de cámara** (ver :ref:`Definición de opciones de cámara <defining_camera_settings>` ).

source: **Frame Start:** and **End:** set the frame range of the scene to render; by default these values refer to the whole scene length.
es: **Fotogramas** **Inicial:** y **Final:** permiten definir el rango de fotogramas de la escena a ser procesados; de forma predefinida estos valores abarcarán la longitud completa de la escena.

source: **Step:** sets the step for the rendered sequence; for example if it is 2, one frame each two will be rendered.
es: **Intervalo:** permite definir el intervalo de la secuencia procesada; por ejemplo si fuera 2, se procesará sólo un fotograma de cada dos.

source: **Shrink:** sets a reduction value for the defined render resolution; for example if it is 2, one pixel each two will be rendered, thus resulting in frames having half of the original output camera resolution.
es: **Reducción:**, permite definir un valor de reducción para la resolución de procesamiento establecida; por ejemplo si fuera 2, un píxel de cada dos será procesado, resultando así en fotogramas de la mitad de la resolución establecida para la cámara.

source: File Settings
es: Opciones de archivo

source: **Save in:** is for setting the location where the output is saved; the location can be set by typing or by using the Browser button.
es: **Guardar en:** permite definir la ubicación donde se guardarán los archivos producidos; la ubicación podrá ser definida ingresándola directamente o usando el botón de Explorar.

source: If in the Browser you choose any default folder of the active project, in the path field the full path will be replaced by the related default folder alias (see :ref:`Project Default Folders <project_default_folders>` ).
es: Si en el Explorador de archivos se escogiera cualquiera de las carpetas predefinidas del proyecto activo, en el campo de la ruta la ruta completa será sustituida por la referencia a la carpeta predefinida correspondiente (ver :ref:`Carpetas predefinidas de un proyecto <project_default_folders>` ).

source: **Name:** is the name you want to assign to the output file; by default it's the name of the scene.
es: **Nombre:** es el nombre que se desee asignar al archivo producido; de forma predefinida será el nombre de la escena.

source: In case the chosen file format produces image sequences, the base name will be assigned to all rendered frames, that will be identified by a progressive four-digits number written between the *base name* and the *file extension*, e.g. ``animation.0001.tif`` , ``animation.0002.tif`` , etc. These file sequences will be displayed in the OpenToonz File Browser with a double dot before the file extension, e.g. ``animation..tif`` , and treated as a single animation level when loaded back into OpenToonz.
es: En caso deque el formato de archivo escogido produzca secuencias de imágenes, el nombre base será asignado a todos los fotogramas procesados, que serán identificados con un número progresivo de 4 dígitos escrito entre el *nombre base* y la *extensión del archivo*, p.ej: ``animación.0001.tif`` , ``animación.0002.tif`` , etc. Estas secuencias de archivos serán mostradas en el Explorador de archivos de OpenToonz con un doble punto antes de su extensión, p.ej: ``animación..tif`` , y serán tratadas como un único nivel de animación al ser cargadas nuevamente en OpenToonz.

source: **File Format** is the format for the output; natively supported formats are the following: 3GP, AVI, BMP, GIF, JPG, MOV, NOL, PNG, RGB, SGI, Spritesheet, TGA, TIF and TIFF.
es: **Formato de archivo** es el formato de archivo a ser producido; los formatos soportados de forma nativa son los siguientes: 3GP, AVI, BMP, GIF, JPG, MOV, NOL, PNG, RGB, SGI, Spritesheet, TGA, TIF y TIFF.

source: OpenToonz supports the 3GP and MOV formats by using the 32-bit version of QuickTime.
es: OpenToonz soporta los formatos 3GP y MOV mediante el uso de la versión de 32 bits de QuickTime.

source: To save in other popular video formats, like MP4 and WebM, OpenToonz uses FFmpeg (a free software project that produces libraries and programs for handling multimedia data). Once FFmpeg is installed in the system, and configured to work with OpenToonz, MP4 and WebM will be listed along the other standard output file formats. For detailed instructions on how to install and configure FFmpeg, please see :ref:`Using FFmpeg with OpenToonz <using_ffmpeg_with_opentoonz>` .
es: Para guardar en otro formatos de archivo populares, como MP4 y WebM, OpenToonz hace uso de FFmpeg (un proyecto de software libre que produce bibliotecas y programas para manipular datos multimedios). Una vez que FFmpeg se encuentre instalado en el sistema y configurado apropiadamente para trabajar con OpenToonz, los formatos MP4 y WebM aparecerán listados entre los demás formatos de archivo estándar. Para obtener instrucciones detalladas acerca de cómo instalar y configurar FFmpeg, por favor ver :ref:`Uso de FFmpeg con OpenToonz <using_ffmpeg_with_opentoonz>` .

source: Apart from 3GP, AVI, GIF, MOV, MP4 and WebM, all other formats will output image sequences.
es: Salvo por los formatos 3GP, AVI, GIF, MOV, MP4 y WebM, todos los demás formatos disponibles producirán secuencias de imágenes.

source: **Options** button, opens a dialog to set specific properties related to the chosen file format, such as codecs for video files, color depth for TIF images, etc.
es: **Opciones**, este botón permite abrir un diálogo donde será posible configurar propiedades específicas del formato escogido, tales como compresores de video, la profundidad de color, etc.

source: **Resample Balance:** controls the resample that is used when images are scaled or rotated. In scenes where images are strongly resampled, for instance when their size changes dramatically, the final rendering may appear slightly out of focus. By chosing a different resampling algorithm you can give some sharpness back to the rendered frames.
es: **Filtro:**, permite controlar el proceso de remuestreo que será usado cuando las imágenes sean redimensionadas o rotadas. En escenas donde las imágenes sean fuertemente remuestreadas, por ejemplo cuando sus tamaños cambien drásticamente, la imagen final podría llegar a aparecer ligeramente fuera de foco. Controlando el tipo de filtro aplicado al remuestrear la imagen, será posible restaurar en alguna medida su definición.

source: There are several options to choose from. Originally Toonz provided only three options: **Standard**, **Improved**, and **High**. The higher the balance chosen, the longer the time needed for rendering the output. Currently OpenToonz also provides several other standard resampling options that could help improve the final results in a wider range of situations. These include: **Triange filter**, **Mitchell-Netravali filter**, **Cubic convolution**, **Hann window**, **Hamming window**, **Lanczos window**, **Gaussian convolution**, **Closest Pixel** and **Bilinear**.
es: Existen varias opciones de entre las cuales escoger. Originalmente en *Toonz* existían sólo tres opciones: **Estándar**, **Mejorado** y **Alto**. Cuanto mayor fuera la intensidad del filtro usado, más tiempo sería necesario para procesar la imagen final. En *OpenToonz* existen otros filtros adicionales de remuestreo, que podrán ayudar a mejorar el resultado final, ante diferentes situaciones. Estos son: **Filtro triangular**, **Filtro Mitchell-Netravali**, **Circunvolución cúbica**, **Ventana Hann**, **Ventana Hamming**, **Ventana Lanczos**, **Circunvolución Gaussiana**, **Píxel más cercano** y **Bilineal**.

source: **Channel Width:** sets the color depth for rendered images; choices are **8 bit** and **16 bit** per color channel. If using the 16 bit channel width, be sure to select an output file format supporting it, for example the **TIF** format with the **64(RGBA)** option activated.
es: **Profundidad de color:** permite definir la profundidad de color de las imágenes procesadas; las opciones son **8 bits** y **16 bits** por canal de color. Al usar 16 bit, el formato de salida escogido deberá ser uno que soporte esa profundidad de color, por ejemplo el formato **TIF**, cuando la opción Bits por píxel: esté en **64 (color + alfa)**.

source: **Dedicated CPUs:** sets, in case your computer has multiple CPUs, how many processor threads will be assigned to the rendering process. Setting the value to **All** will generate a number of rendering threads equal to the number of processors, thus speeding up the rendering process. However in systems with limited RAM resources, it's suggested to use the **Half** or **Single** options if the scene to render is very complex, because the higher the dedicated CPUs, the more RAM will be required to perform the rendering, leading to potentially longer rendering times or system instability.
es: **Procesadores dedicados:**, permite cuántos núcleos de procesador deberán ser usados durante el proceso de previsualización. Cuando la opción está en **Todos** se generará una cantidad de hilos de procesamiento igual a la cantidad de núcleos procesador disponibles en el sistema, acelerando el cálculo de la previsualización. Sin embargo, si la escena a previsualizar fuera de una complejidad alta, se sugiere usar **La mitad** o **Uno solo**, debido a que cuantos más núcleos sean usados se requerirá una mayor cantidad de memoria para llevar a cabo el cálculo.

source: **Render Tile:** allows the rendering of complex scenes, by dividing each frame in a certain number of *tiles*, which are individually rendered and finally stitched together to create the final output frame: the smaller the size of the tiles, the longer the rendering will take but the less RAM will require. Setting the value to **Medium** or **Small** will allow the rendering of very high resolution outputs of very complex scenes, that otherwise may fail to be rendered; setting the value to **None** may prevent some artifacts that the tile stitching may generate. In most cases the **Large** value will do the work, because it's not slower than the **None** option, and yet is able to render complex scenes.
es: **Celdas de procesamiento:**, permite previsualizar escenas muy complejas, cuyos fotogramas serán calculados en celdas individuales, que luego serán compuestas una junto a la otra para crear la imagen completa: cuanto más pequeño sea el tamaño de las celdas, más tiempo insumirá el proceso de previsualización. Definir el tamaño de las celdas en **Medianas** o **Pequeñas** permitirá previsualizar imágenes de una gran resolución y de escenas muy complejas que, de otro modo, podrían fallar al intentar ser calculadas; al definir este valor en **No** será posible prevenir la aparición de algunos defectos de imagen, generados al componer las celdas entre ellas. En la mayoría de los casos el valor **Grandes** debería funcionar correctamente, debido a que no es más lento que la opción **No** y aún así será posible previsualizar escenas complejas.

source: Other Settings
es: Otras opciones

source: **Add Clapperboard** allows to add a Clapperboard. A clapperboard is a static image intended to display information of the scene. It will be added before the rendered frames, in order to record and convey information to subsequent phases of the pipeline.
es: **Agregar claqueta**, permite agregar una Claqueta. Una claqueta es una imagen estática, cuyo propósito es mostrar información acerca de la escena. Se agregará antes de los fotogramas procesados para transmitir información a etapas posteriores en el flujo de trabajo.

source: For this option to be enabled you must first choose any video file format from the **File Format** dropdown menu (i.e. 3GP, AVI, MOV, MP4 or WebM).
es: Para que esta opción se encuentre habilitada, debe haberse escogido antes algún formato de video en el menú **Formato de archivo** (p.ej: 3GP, AVI, MOV, MP4 o WebM).

source: **Edit Clapperboard...** button, opens a dialog for designing the clapperboard and setting its properties. For detailed information on using the Clapperboard feature, please see the :ref:`Using The Clapperboard <using_the_clapperboard>` section.
es: **Editar claqueta...**, este botón permite abrir un diálogo para diseñar la claqueta y configurar sus propiedades. Para obtener información más detallada acerca del uso de la Claqueta, por favor ver la sección :ref:`Uso de la Claqueta <using_the_clapperboard>` .

source: **Gamma:** performs a gamma correction on rendered images before writing them to a file; the value you specify can include decimal fractions.
es: **Gama:** permite realizar una corrección gama de las imágenes procesadas antes de que sean guardadas en un archivo; el valor que se especifique podrá incluir decimales.

source: **Dominant Field:** allows you to render two images per frame, then keeping only *odd* lines from one image, and *even* lines from the other to compose a final frame. This process is called *interlacing*.
es: **Campo dominante:** permite que se procesen dos imágenes por cada fotograma, manteniendo únicamente las líneas *impares* de una de ellas y las *pares* de la otra, para componer entre ambas el fotograma final. Este proceso es llamado *entrelazado*.

source: *Interlaced* images are useful when experiencing a strobe effect due to a fast camera or object movement, as all movement interpolation will be effectively doubled (having one *odd-lines image* and one *even-lines image*, instead of just one full *progresive* frame), thus becoming smoother.
es: Las imágenes *entrelazadas* resultan útiles cuando se experimente un efecto estroboscópico debido al rápido movimiento de la cámara o algún objeto; dado que la interpolación de todos los movimientos se verá efectivamente duplicada (al tener una *imagen de líneas impares* y una *imagen de líneas pares*, en vez de sólo un fotograma *progresivo*), ésta será más suave.

source: Field rendering is only relevant for scenes that are intended for video output. Options are **None** (for rendering *progresive* frames), **Even (PAL)** and **Odd (NTSC)** (for chosing which of the rendered *interlaced* fields is to be shown in first place). Usually you should choose it according to the video standard you are outputting to.
es: El procesamiento por campos será únicamente relevante en escenas que sean pensadas para una salida a video. Las opciones disponibles son: **No** (para procesar fotogramas *progresivos*), **Par (PAL)** e **Impar (NTSC)** (para elegir cuál de los campos *entrelazados* deberá ser mostrado en primer lugar). Usualmente esto debería elegirse de acuerdo al formato de video para el que se esté produciendo la animación.

source: **Frame Rate**: is the frame rate of the scene, also available in the Xsheet → **Scene Settings...** dialog (see :ref:`Setting the Frame Rate <setting_the_frame_rate>` ).
es: **Velocidad (fps):** es la velocidad de la escena, también disponible en el dialogo Planilla → **Opciones de escena...** (ver :ref:`Definición de la velocidad <setting_the_frame_rate>` ).

source: **Stretch from FPS: To:** changes the timing of the Xsheet when outputting files; in this way you can output a number of frames that is independent from the frame rate set in the scene settings.
es: **Estirar (fps):** **Desde:** y **Hasta:**, permiten cambiar la temporización de la Planilla en el momento de producir los archivos; de esta forma será posible generar una cantidad de fotogramas que sea independiente de la velocidad definida en las Opciones de escena.
