Repository: WizzerWorks/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/toonzscript.po
Languages: es

source: ToonzScript is the scripting language used in OpenToonz. Using ToonzScript allows users to create sequences of commands, thus avoiding the need to perform repetitive tasks manually. ToonzScript is based on QtScript and is built on the ECMAScript standard. A reference guide for the ECMAScript standard can be found at the following URL:
es: ToonzScript es el lenguaje de scripting usado en OpenToonz. Usar ToonzScript permite a los usuarios crear secuencias de comandos, evitando así la necesidad de realizar tareas repetitivas de forma manual. ToonzScript está basado en QtScript y utiliza el estándar ECMAScript. Es posible encontrar una guía de referencia del estándar ECMAScript en la siguiente URL:

source: `ECMAScript Reference <http://doc.qt.io/qt-5/ecmascript.html>`_
es: `Referencia de ECMAScript (en inglés) <http://doc.qt.io/qt-5/ecmascript.html>`_

source: Several well known scripting languages are based on the ECMAScript standard such as JavaScript, JScript, and ActionScript. The ToonzScript syntax is similar to that of JavaScript, for this reason, a good introduction to JavaScript can be very useful to better understand ToonzScript's basics.
es: Muchos lenguajes de scripting conocidos están basados en el estándar ECMAScript como JavaScript, JScript, y ActionScript. La sintaxis de ToonzScript es similar a la de JavaScript, por esta razón, una buena introducción a JavaScript puede resultar muy útil para una mejor comprensión de los fundamentos de ToonzScript.

source: The original ToonzScript page with some (rather old) examples is available at the following URL:
es: La página original de ToonzScript conteniendo algunos ejemplos (bastante antiguos) se encuentra disponible en la siguiente URL:

source: `ToonzScript page <http://www.toonz.com/htm/support/Script.htm>`_
es: `Página de ToonzScript (en inglés) <http://www.toonz.com/htm/support/Script.htm>`_

source: Scripts can be run using the ``File → Script → Run Script...`` command. Alternatively, commands can be typed and executed directly in the Script Console, which can be opened using the ``File → Script → Open Script Console...`` command.
es: Es posible ejecutar scripts usando el comando ``Archivo → Scripts → Ejecutar script...`` . Alternativamente, es posible ingresar y ejecutar comandos directamente en la Consola de scripts, que puede ser abierta usando el comando ``Archivo → Scripts → Abrir consola de scripts...`` .

source: When a script is running, the Script Console will open automatically to show the commands contained within the script.
es: Cuando un script se encuentra en ejecución, la Consola de scripts se abrirá de forma automática para mostrar los comandos contenidos en el mismo.

source: File management
es: Administración de archivos

source: The ToonzScript file extension is .js, scripts need to be in the ``OpenToonz stuff/library/script`` folder, to be automatically retrieved by opening the Run Script command browser.
es: La extensión de los archivos de ToonzScript es .js, los scripts deben encontrarse en la carpeta ``OpenToonz stuff/library/script`` , para poder ser recuperados automáticamente al abrir el explorador de la función Ejecutar script.

source: Using the Script Console
es: Uso de la Consola de comandos

source: The Script Console allows the user to directly enter commands, additionally, dragging & dropping external text files into the console will automatically insert the path of the file(s).
es: La Consola de comandos permite al usuario ingresar directamente comandos; además de esto también es posible arrastrar y soltar archivos de texto externos en la consola, lo cual insertará automáticamente la ruta de dichos archivos en la misma.

source: Start a series of lengthy operations from the console does not block the interface.
es: La interfaz de programa no se verá bloqueada mientras se ejecute una serie de comandos ingresados desde la consola.

source: Console use conventions
es: Convenciones de uso de la consola

source: The following conventions are implemented in the use of the Script Console:
es: Se implementan las siguientes convenciones para el uso de la Consola de scripts:

source: Only the text of the last paragraph can be edited.
es: Sólo es posible editar el texto del último párrafo.

source: The Up and Down arrow keys allow the navigation of the command history.
es: Las teclas de flechas hacia Arriba y Abajo permiten la navegación del historial de comandos.

source: The execution of time consuming commands doesn’t prevent interaction with the software interface.
es: La ejecución de comandos que demoren no bloqueará la interacción con la interfaz del programa.

source: The **ctrl+y** shortcut interrupts the execution of time consuming commands.
es: El atajo **Ctrl+Y** interrumpirá la ejecución de comandos que estén demorando.

source: When entering a path in a string, any and all backslashes must be doubled. Following this rule the path: ``C:\tmp\test.jpg`` becomes ``C:\\tmp\\test.jpg`` .
es: Al ingresar una ruta como parte de una cadena de texto, todas las barras invertidas deben ser duplicadas. Siguiendo esa regla, la ruta: ``C:\tmp\prueba.jpg`` quedaría como ``C:\\tmp\\prueba.jpg`` .

source: Even if working on a Windows family OS the slash and the backslash can be used in the same way, thus the path ``C:\tmp\test.jpg`` is equivalent to the path ``C:/tmp/test.jpg`` .
es: Aún trabajando bajo un sistema operativo de la familia Windows, la barra y la barra invertida pueden ser usadas con el mismo efecto, así la ruta ``C:\tmp\prueba.jpg`` será equivalente a la ruta ``C:/tmp/prueba.jpg`` .

source: The drag & drop of an external file into the console generates a string containing the file’s path and the backslashes are doubled automatically.
es: Al arrastrar y soltar un archivo externo sobre la consola, se generará una cadena de texto conteniendo la ruta a dicho archivo, cuyas barras invertidas serán automáticamente duplicadas.

source: While you can copy multiple lines of text from the console is allowed only one line paste.
es: Si bien es posible copiar varias líneas de texto desde la consola, sólo se permite pegar una línea de texto.

source: ToonzScript specifications
es: Especificaciones de ToonzScript

source: Built on the foundaments of ECMAScript, ToonzScript retains a degree of similarity to the JavaScript syntax but, at the same time, implements some functions and several classes specifically built to make easier the interaction with the OpenToonz software architecture. Here follows the list of the ToonzScript specifications:
es: Construido sobre las bases de ECMAScript, ToonzScript mantiene un cierto grado de similitud con la sintaxis de JavaScript, sin embargo al mismo tiempo, implementa algunas funciones y varias clases específicamente creadas para hacer más sencilla la interacción con la arquitectura de software de OpenToonz. A continuación se ofrece una lista de las especificaciones de ToonzScript:

source: Commands
es: Comandos

source: **print(arg1, arg2, ...)**: writes a message on console.
es: **print(arg1, arg2, ...)**: escribe un mensaje en la consola.

source: The print command doesn’t return the ``undefined`` value.
es: El comando print no devuelve el valor ``undefined`` .

source: Example::
es: Ejemplo::

source: **run(filename)**: runs the script saved in filename.
es: **run(nombredearchivo)**: ejecuta el script guardado en nombredearchivo.

source: The relative path are referred to the folder "<opentoonz library>/scripts/"
es: Las rutas relativas se refieren a la carpeta "<opentoonz library>/scripts/"

source: Examples::
es: Ejemplos::

source: **view(image)**: allows to view an image.
es: **view(imagen)**: permite ver una imagen.

source: The view command can be legally used in the following context: ``view(new Image(filename))``
es: Es posible usar legalmente el comando view en el siguiente contexto: ``view(new Image(nombredearchivo))``

source: **view(level)**: allows to view a level.
es: **view(nivel)**: permite ver un nivel.

source: The variable ``ToonzVersion`` can be used to check the current version of OpenToonz.
es: La variable ``ToonzVersion`` puede ser usada para comprobar la versión actual de OpenToonz.

source: Classes
es: Clases

source: For each class, the related constructor, methods and attibutes are listed.
es: Para cada clase se listan, el constructor correspondiente, sus métodos y atributos.

source: contains the path of an object.
es: contiene la ruta a un objeto.

source: new **FilePath**\ (path)
es: new **FilePath**\ (ruta)

source: **Methods:**
es: **Métodos:**

source: path2 = path.\ **withExtension**\ (e)
es: ruta2 = path.\ **withExtension**\ (e)

source: path2 = path.\ **withName**\ (name)
es: ruta2 = path.\ **withName**\ (nombre)

source: path2 = path.\ **withParentDirectory**\ (d)
es: ruta2 = path.\ **withParentDirectory**\ (d)

source: path2 = path.\ **concat**\ (f) - where f can be a FilePath or a string
es: ruta2 = path.\ **concat**\ (f) - donde f puede ser un FilePath o una cadena

source: files = path.\ **files**\ () - if path is a folder then this method returns the files inside the folder.
es: archivos = path.\ **files**\ () - si archivos es una carpeta, entonces este método devuelve los archivos dentro de esa carpeta.

source: **Attributes:**
es: **Atributos:**

source: path.\ **extension** - read and write attribute
es: path.\ **extension** - atributo de lectura y escritura

source: path.\ **name** - read and write attribute
es: path.\ **name** - atributo de lectura y escritura

source: path.\ **parentDirectory** - read and write attribute
es: path.\ **parentDirectory** - atributo de lectura y escritura

source: path.\ **lastModified** - read only attribute
es: path.\ **lastModified** - atributo de sólo lectura

source: path.\ **exists** - read only attribute
es: path.\ **exists** - atributo de sólo lectura

source: path.\ **isDirectory** - read only attribute
es: path.\ **isDirectory** - atributo de sólo lectura

source: **Examples**::
es: **Ejemplos**::

source: contains an image, supported types are: tlv, pli or fullcolor.
es: contiene una imagen, los tipos soportados son: tlv, pli y fullcolor.

source: new **Image**\ () or new **Image**\ (filename)
es: new **Image**\ () o new **Image**\ (nombredearchivo)

source: img.\ **save**\ (filename) - the file extension has to be compatible with the kind of used level
es: img.\ **save**\ (nombredearchivo) - la extensión del archivo tiene que ser compatible con el tipo de nivel usado

source: img.\ **load**\ (filename)
es: img.\ **load**\ (nombredearchivo)

source: img.\ **width** - has value 0 if the image is a pli
es: img.\ **width** - tendrá valor 0 si la imagen es de tipo pli

source: img.\ **height** - has value 0 if the image is a pli
es: img.\ **height** - tendrá valor 0 si la imagen es de tipo pli

source: img.\ **dpi** - has value 0 if the image is a pli
es: img.\ **dpi** - tendrá valor 0 si la imagen es de tipo pli

source: img.\ **type** - accepted values (“Empty”, “Raster”, “ToonzRaster”, “Vector”)
es: img.\ **type** - valores aceptados (“Empty”, “Raster”, “ToonzRaster”, “Vector”)

source: contains a level, the supported types are: tlv, pli or fullcolor.
es: contiene un nivel, los tipos soportados son: tlv, pli y fullcolor.

source: new **Level**\ () or new **Level**\ (filename)
es: new **Level**\ () o new **Level**\ (nombredearchivo)

source: level.\ **load**\ (filename)
es: level.\ **load**\ (nombredearchivo)

source: level.\ **save**\ (filename) - the file extension has to be compatible with the kind of usedlevel
es: level.\ **save**\ (nombredearchivo) - la extensión del archivo tiene que ser compatible con el tipo de nivel usado

source: level.\ **getFrameIds**\ () - lists the names of all the frames
es: level.\ **getFrameIds**\ () - lista los nombres de todos los fotogramas

source: level.\ **getFrame**\ (frameId) - retrive the image of the specified frame
es: level.\ **getFrame**\ (IDfotograma) - recupera la imagen del fotograma especificado

source: level.\ **getFrameByIndex**\ (index) - gets the frame specified by the index value (first value of index is 0)
es: level.\ **getFrameByIndex**\ (índice) - obtiene el fotograma especificado por el valor índice (el primer valor de índice es 0)

source: level.\ **setFrame**\ (frameId, image) - sets a frame (if the level is not empty its content and the type of image has to be compatible)
es: level.\ **setFrame**\ (IDfotograma, imagen) - define un fotograma (si el nivel no se encuentra vacío, su contenido y el tipo de imagen deben ser compatibles)

source: level.\ **name** - is a read and write attribute
es: level.\ **name** - atributo de lectura y escritura

source: level.\ **path** - is a read and write attribute
es: level.\ **path** - atributo de lectura y escritura

source: level.\ **frameCount** - is a read only value
es: level.\ **frameCount** - atributo de sólo lectura

source: level.\ **type** (“Empty”, ”Raster”, ”ToonzRaster”, ”Vector”) - is a read only value
es: level.\ **type** (“Empty”, ”Raster”, ”ToonzRaster”, ”Vector”) - atributo de sólo lectura

source: contains a Toonz scene.
es: contiene una escena de OpenToonz.

source: new **Scene**\ () or **new Scene**\ (filename)
es: new **Scene**\ () o **new Scene**\ (nombredearchivo)

source: scene.\ **load**\ (filename)
es: scene.\ **load**\ (nombredearchivo)

source: If the path is relative, scenes of the current project are used.
es: Si la ruta es relativa, se usarán escenas del proyecto actual.

source: scene.\ **save**\ (filename)
es: scene.\ **save**\ (nombredearchivo)

source: scene.\ **setCel**\ (row, col, cell) , scene.\ **setCell**\ (row, col, level, frameId)
es: scene.\ **setCel**\ (fila, columna, celda) , scene.\ **setCell**\ (fila, columna, nivel, IDfotograma)

source: ``cell`` is the kind of object returned by ``getCell()`` .
es: ``celda`` es la clase de objeto devuelto por ``getCell()`` .

source: The following syntax is allowed ``scene.setCell(1, 0, scene.getCell(0,0))``
es: La siguiente sintaxis es permitida ``scene.setCell(1, 0, scene.getCell(0,0))``

source: To delete a cell: ``scene.setCell(row, col, undefined)``
es: Para borrar una celda: ``scene.setCell(fila, columna, nodefinido)``

source: ``cell`` is a standard JavaScript object that includes the attributes:``level`` and ``fid`` , the following use is allowed: ``scene.setCell(row, col, {level:a, fid:1})``
es: ``celda`` es un objeto estándar de JavaScript que incluye los atributos:``nivel`` y ``idf`` , se permite el siguiente uso: ``scene.setCell(fila, columna, {nivel:a, idf:1})``

source: ``level`` can be a Level or a level name. The level has to be already in the scene.
es: ``nivel`` puede ser tanto Level como el nombre de un nivel. El nivel ya tiene que existir en la escena.

source: ``fid`` supports numeric values or string values as “2” or “2a”.
es: ``idf`` soporta valores numéricos o cadenas como “2” o “2a”.

source: cell = scene.\ **getCell**\ (row, col) - returns a JavaScript object with level and fid attributes
es: celda = scene.\ **getCell**\ (fila, columna) - devuelve un objeto de JavaScript con los atributos nivel e idf

source: scene.\ **insertColumn**\ (col)
es: scene.\ **insertColumn**\ (columna)

source: scene.\ **deleteColumn**\ (col)
es: scene.\ **deleteColumn**\ (columna)

source: scene.\ **getLevels**\ () - returns an arrray that contains all the levels belonging to the scene
es: scene.\ **getLevels**\ () - devuelve un array que contiene todos los niveles pertenecientes a la escena

source: scene.\ **getLevel**\ (name) - returns the level basing on its name. If a level using the name specified does not exists the value ``undefined`` is returned.
es: scene.\ **getLevel**\ (nombre) - devuelve un nivel basándose en su nombre. Si no existiera un nivel con el nombre especificado el valor ``undefined`` será devuelto.

source: level = scene.\ **newLevel**\ (type, name) - Adds a layer to the scene. Type can be "Raster", "ToonzRaster" or "Vector". Name must not be already 'used in the scene.
es: nivel = scene.\ **newLevel**\ (tpo, nombre) - Agrega una capa a la escena. Tipo puede ser "Raster", "ToonzRaster" o "Vector". El nombre no debe estar ya en uso en la escena.

source: level = scene.\ **loadLevel**\ (name, path) - Load a level (mode '"links") in the scene. The path must exist and be an absolute path.The name must not have been already used for another level of the scene.
es: level = scene.\ **loadLevel**\ (nombre, ruta) - Carga un nivel (en modo '"enlace") a la escena. La ruta debe existir y ser absoluta. El nombre no debe estar siendo usado por ningún otro nivel de la escena.

source: scene.\ **frameCount** - is a read only value
es: scene.\ **frameCount** - valor de sólo lectura

source: scene.\ **columnCount** - is a read only value
es: scene.\ **columnCount** - valor de sólo lectura

source: represents a geometric tansformation (composed by rotation, translation and scale). Used by ImageBuilder.
es: representa una transformación geométrica (compuesta por rotación, traslación y escala). Usada por ImageBuilder.

source: transform.\ **rotate**\ (degrees)
es: transform.\ **rotate**\ (grados)

source: Positive values correspond to a counterclockwise rotation.
es: Valores positivos corresponden a una rotación en sentido antihorario.

source: transform.\ **scale**\ (s)
es: transform.\ **scale**\ (e)

source: transform.\ **scale**\ (sx, sy)
es: transform.\ **scale**\ (ex, ey)

source: allows to modify an image (rotate, scale, crop), or to make an over between two or more images.
es: permite modificar una imagen (rotarla, escalarla, recortarla) o componer una o más imágenes sobre otras.

source: new **ImageBuilder**\ () or new **ImageBuilder**\ (xres, yres)
es: new **ImageBuilder**\ () o new **ImageBuilder**\ (resx, resy)

source: builder.\ **add**\ (img)
es: builder.\ **add**\ (imagen)

source: builder.\ **add**\ (img, transform)
es: builder.\ **add**\ (imagen, transformación)

source: The component of translation of the transform means expressed in pixels for Raster and Toonz Raster levels, and in Camera Stand units for Vector levels.
es: El componente de traslación de la transformación se encuentra expresado en píxeles para niveles de Imagen de Toonz o Imagen, y en unidades de cámara para niveles Vectorial de Toonz.

source: builder.\ **image** - returns the actual result.
es: builder.\ **image** - devuelve el resultado actual.

source: vectorize raster images using an outline algorithm.
es: vectoriza imágenes usando el algoritmo de contornos.

source: v.\ **vectorize**\ (level or image) - returns the new vectorized level (or image), supports as input: Raster or Toonz Raster images and levels.
es: v.\ **vectorize**\ (nivel o imagen) - devuelve el nuevo nivel vectorizado, soporta como entrada: niveles de Imagen de Toonz o Imagen.

source: vectorize raster images using a centerline algorithm.
es: vectoriza imágenes usando el algoritmo de líneas.

source: converts vector images into Raster or ToonzRaster images.
es: convierte imágenes vectoriales en Imágenes de Toonz o Imágenes.

source: out = r.\ **rasterize**\ (vimg) - converts to raster an image or a level
es: out = r.\ **rasterize**\ (imagenvect) - convierte en imagen un nivel vectorial

source: r.\ **colorMapped** - if its value is set to True the generated image is of ToonzRaster type
es: r.\ **colorMapped** - si su valor está definido como True la imagen generada será de tipo Imagen de Toonz

source: renders a whole scene or part of a scene, creating levels or images.
es: procesa una escena completa o una parte de ella, creando niveles o imágenes.

source: level = c.\ **renderScene**\ (scene)
es: level = c.\ **renderScene**\ (escena)

source: image = c.\ **renderFrame**\ (scene, frameIndex)
es: image = c.\ **renderFrame**\ (escena, IDfotograma)

source: frameIndex starts from 0
es: IDfotograma comienza desde 0

source: r.\ **columns** (list of indices of columns to render. e.g. r.columns = [0,3])
es: r.\ **columns** (lista de índices de las columnas a procesar. p.ej: r.columns = [0,3])

source: r.\ **frames** (list of indices of frames to render. e.g. r.frames = [0,1,2,3])
es: r.\ **frames** (lista de índices de los fotogramas a procesar. p.ej: r.frames = [0,1,2,3])

source: Code examples
es: Ejemplos de código

source: Following there are some examples of scripting code:
es: A continuación se presentan algunos ejemplos de código de scripts:

source: Outline vectorization
es: Vectorización de contornos

source: This brief script is an example of using the OutlineVectorizer on a single image. The script is commented, explaining what each section does::
es: Este breve script es un ejemplo de cómo usar OutlineVectorizer en una única imagen. El script se encuentra comentado, explicando lo que hace cada sección::

source: Rotating an image
es: Rotación de una imagen

source: This example explains how to load an image and then create an animation in a level, rotating the loaded frame::
es: Este ejemplo explica cómo cargar una imagen y luego crear una animación en un nivel, rotando dicha imagen:
