Repository: WizzerWorks/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/using_the_version_control.po
Languages: es

source: Using the Version Control System
es: Uso del Sistema de Control de Versiones

source: The version control system keeps in a central repository a constant history of revisions for every file in the production database.
es: El sistema de control de versiones mantiene, en un repositorio centralizado, una historia permanente de las revisiones de cada archivo de la base de datos de una producción.

source: The **central repository** must be located in a shared resource (that can be a computer in your local network or an internet-based repository), while the local copy of files, called **working copy**, at a specific time or revision, should be located on the computer you use.
es: El **repositorio central** debe estar ubicado en un recurso compartido (tanto en una computadora de la red local, como en una ubicación remota accesible a través de Internet), mientras que una **copia de trabajo** local de los archivos del mismo, debe estar ubicada en la computadora que se está utilizando, y representa al estado o versión del proyecto en el momento en que la copia local fue realizada.

source: When you need to work on a file, you can *get* it from the central repository to your working copy, and *edit* it; when you finish working on the file and you want to submit the changes, you can *put* it back from your working copy to the central repository.
es: Cuando se necesita trabajar en un archivo, es posible *obtenerlo* desde el repositorio central para copiarlo localmente y poder *editarlo*; al finalizar el trabajo, el archivo deberá ser *enviado* nuevamente al repositorio central.

source: The file you *put* will be saved as the last revision of the file, while the previous revisions will be retained as file history, and all the users sharing the same central repository can *get* if from there. In case a previous version of the file is needed, it is always possible to retrieve it from the central repository.
es: El archivo que se *envía* es almacenado como la última versión del mismo, preservando sus versiones anteriores como historial; cualquier usuario con acceso a ese mismo repositorio central puede *obtener* la última versión del archivo cuando sea necesario. En caso de ser necesario obtener una versión anterior del archivo, siempre será posible hacerlo accediendo al historial del mismo en el repositorio central.

source: OpenToonz supports the **Subversion** version control system, which is one of the most popular version control systems, used in many high-scale open source projects.
es: OpenToonz soporta el sistema de control de versiones **Subversión**, que es uno de los sistemas más populares y es utilizado en diversos proyectos de código abierto de gran escala.

source: The *central repository* defined for your version control system behaves exactly as an OpenToonz projectroot, therefore the project management under the version control system is the same, only referencing to the central repository instead of the projectroot (see :ref:`Managing Projects <managing_projects>` ).
es: El *repositorio central* definido en el sistema de control de versiones se comportará exactamente igual que cualquier otra carpeta principal de proyectos de OpenToonz, por lo tanto la administración de proyectos bajo control de versiones se realiza de una forma idéntica a la de cualquier otro proyecto, con la diferencia de estar haciendo referencia a un repositorio central, en vez de a una carpeta principal de proyectos normal (ver :ref:`Administración de proyectos <managing_projects>` ).

source: Installing the Version Control System
es: Instalación del Sistema de Control de Versiones

source: The version control system works as a client/server tool: the server stores all of your files in a central repository, and a client is used to *get* files to your working copy and *put* file changes to the server.
es: El sistema de control de versiones funciona como una herramienta cliente/servidor: el servidor almacena todos los archivos en un repositorio central, utilizando un cliente para *obtener* una copia local de dichos archivos, y para posteriormente *enviar* los archivos modificados, de vuelta al repositorio central.

source: Installing the Version Control Server
es: Instalación del Sistema de Control de Versiones

source: It's possible to configure a computer in your local network as the version control server by installing **Subversion 1.6** or later, or it's possible to use an on-line service (e.g. Assembla).
es: Es posible configurar una computadora en la red local para que actúe como servidor de control de versiones, instalando allí **Subversión 1.6** o posterior, o es posible también utilizar un servicio en línea (p.ej: Assembla).

source: You can go to the `Subversion starting page <http://subversion.apache.org/>`_ for downloading it.
es: Para descargarlo se debe ir a la `página de inicio de Subversion (en inglés) <http://subversion.apache.org/>`_ .

source: Contact your system administrator to configure a version control server.
es: Contactar al administrador de sistemas para configurar el sistema de control de versiones.

source: Installing the Version Control Client on Windows
es: Instalación del Cliente de control de versiones en Windows

source: On Windows the setup of a version control client requires the download and installation of the **Subversion client 1.6** or later.
es: En Windows la configuración de un cliente de control de versiones requiere la descarga e instalación del **cliente de Subversion 1.6** o posterior.

source: You can go to the `Subversion download page <http://subversion.apache.org/packages.html#windows>`_ for downloading it. There you should look for the available binary packages and download a version control client for Windows. We suggest the use of **CollabNet Subversion Command-Line Client**.
es: Para su descarga se debe ir a `la página de descargas de Subversion (en inglés) <http://subversion.apache.org/packages.html#windows>`_ . Ahí se deben buscar los paquetes binarios disponibles y descargar un cliente de control de versiones para Windows. Se sugiere el uso del cliente **CollabNet Subversion Command-Line Client**.

source: If an older Subversion release is used some version control features might not work.
es: Si se estuviera utilizando una versión más antigua de Subversion, es posible que algunas de las funciones de control de versiones no funcionen.

source: Installing the Version Control Client on Macintosh
es: Instalación del Cliente de control de versiones en macOS

source: On Macintosh the setup of a version control client depends on the OS version.
es: En macOS la configuración de un cliente de control de versiones dependerá de la versión del sistema operativo.

source: If the OS is Snow Leopard (version 10.6) or later, the setup requires no installation as the version control client is included in the operating system.
es: Si el sistema usado es Snow Leopard (versión 10.6) o posterior, la configuración no requerirá de una instalación, ya que el cliente de control de versiones viene incluido en el sistema operativo.

source: If the OS is *older* than Snow Leopard, the setup requires the download and installation of the **Subversion client 1.6** or later.
es: Si el sistema operativo usado fuera anterior a Snow Leopard, la configuración requerirá de la instalación del **cliente de Subversion 1.6** o posterior.

source: You can go to the `Subversion download page <http://subversion.apache.org/packages.html#osx>`_ for downloading it. There you should look for the available binary packages and download a version control client for Macintosh.
es: Se deberá ir a la `página de descargas de Subversion (en inglés) <http://subversion.apache.org/packages.html#osx>`_ para realizar la descarga. Ahí se deberán buscar los paquetes binarios disponibles y descargar un cliente de control de versiones para macOS.

source: After the installation is very important to check where Subversion is installed, as this information is needed to configure the version control in OpenToonz: this information is displayed in the last page of the installation process and by default is usually ``/opt/subversion/bin`` .
es: Luego de la instalación es muy importante comprobar dónde se encuentra instalado Subversion, ya que esa información será necesaria para configurar el control de versiones en OpenToonz: esta información es mostrada en la última página del proceso de instalación, de forma predefinida suele ser ``/opt/subversion/bin`` .

source: If a Subversion release older than v1.6 is used, some version control features might not work.
es: Si se estuviera usando una versión de Subversion anterior a la 1.6, es posible que algunas de las funciones de control de versiones no funcionen.

source: Configuring the Version Control in OpenToonz
es: Configuración del control de versiones en OpenToonz

source: Once the version control server is configured and the version control client is installed it's possible to configure OpenToonz in order to use the version control.
es: Una vez que el servidor de control de versiones esté configurado y el cliente de control de versiones esté instalado, será posible configurar OpenToonz para que haga uso del control de versiones.

source: In OpenToonz the version control information is stored in the ``versioncontrol.xml`` file located in the ``OpenToonz stuff\config`` folder. By default the file has the following content:
es: En OpenToonz la información de control de veriones es almacenada en el archivo ``versioncontrol.xml`` ubicado en la carpeta ``OpenToonz stuff\config`` . De forma predefinida el archivo contiene lo siguiente:

source: By editing the file with a text editor it's possible to set the information for the *central repository* and the *working copy* location.
es: Mediante la edición del archivo usando un editor de texto es posible establecer la información para el *repositorio central* y la ubicación de la *copia de trabajo*.

source: Together with the configuration file, version control *users* must be defined by editing the ``permissions.xml`` file located in the ``OpenToonz stuff\config`` folder.
es: Conjuntamente con el archivo de configuración, deben definirse *usuarios* de control de versiones, editando el archivo ``permissions.xml`` ubicado en la carpeta ``OpenToonz stuff\config`` .

source: The ``versioncontrol.xml`` and ``permissions.xml`` file have to be well-formed, and so cannot contain an opening tag without its related closing tag, otherwise OpenToonz will not run. If you decide to edit the files, make a backup copy first in case you need to revert the file to the original version.
es: Los archivos ``versioncontrol.xml`` y ``permissions.xml`` deben estar bien formados, por lo tanto no podrán contener una etiqueta de apertura sin su correspondiente de cierre, de otro modo OpenToonz no podrá ejecutarse. Si se decide editar estos archivos, es una buena práctica realizar previamente una copia de respaldo de los mismos, en caso de necesitar volver a la versión original de los archivos.

source: **To configure the version control in OpenToonz:**
es: **Para configurar el control de versiones en OpenToonz:**

source: Open the ``versioncontrol.xml`` file located in the ``OpenToonz stuff\config`` folder with a text editor.
es: Abrir el archivo ``versioncontrol.xml`` ubicado en la carpeta ``OpenToonz stuff\config`` con un editor de texto.

source: Delete the line
es: Borrar la línea

source: and the line
es: y la línea

source: In the line
es: En la línea

source: type between the tags the name you want the repository to have in the OpenToonz browser.
es: ingresar entre las etiquetas <name> el nombre con que se desea que el repositorio aparezca en el Explorador de archivos de OpenToonz.

source: type between the tags the path to where you want the working copy to be located on the local computer (e.g. ``C:\myworkingcopy\`` for Windows or ``/myworkingcopy`` for Macintosh).
es: ingresar entre las etiquetas <localPath> la ruta de la computadora local donde se desea ubicar la copia de trabajo de los archivos (p.ej: ``C:\micopiadetrabajo\`` para Windows o ``/micopiadetrabajo`` para macOS).

source: type between the tags the URL of the central repository according to how it was defined on the version control server (e.g. ``http://10.0.0.1/mySVNrepository/`` for a repository located in the local network; ``file:///C:/mySVNrepository`` for a repository located in the local Windows computer or ``file:///mySVNrepository`` for a repository located in the local Macintosh computer; and ``https://subversion.assembla.com/svn/mySVNrepository`` for an internet-based repository).
es: ingresar entre las etiquetas <repoPath> la URL del repositorio central, de acuerdo a cómo haya sido definido en el servidor de control de versiones (p.ej: ``http://10.0.0.1/mirepositorioSVN/`` para un repositorio ubicado en la red local; ``file:///C:/mirepositorioSVN`` para uno ubicado en la computadora local Windows, ``file:///mirepositorioSVN`` para uno ubicado en la computadora local Macintosh; o ``https://subversion.assembla.com/svn/mirepositorioSVN`` para uno alojado en Internet).

source: For Macintosh only, if the OS is *older* than Snow Leopard and you installed the **Subversion client 1.6** or later, in the line
es: Sólo para macOS, si el sistema operativo fuera *anterior* a Snow Leopard y se hubiera instalado el **cliente de Subversion 1.6** o posterior, entonces en la línea

source: type between the tags the path to the folder where Subversion is installed (this information is displayed in the last page of the installation process and by default is ``/opt/subversion/bin`` ).
es: ingresar entre las etiquetas <svnPath> la ruta a la carpeta donde se instaló Subversion (esta información se muestra en la última página del proceso de instalación y de forma predefinida es ``/opt/subversion/bin`` ).

source: Save the ``versioncontrol.xml`` file.
es: Guardar el archivo ``versioncontrol.xml`` .

source: **To define the version control users:**
es: **Para definir los usuarios del sistema de control de versiones:**

source: Open the ``permissions.xml`` file located in the ``OpenToonz stuff\config`` folder with a text editor.
es: Abrir el archivo ``permissions.xml`` ubicado en la carpeta ``OpenToonz stuff\config`` con un editor de texto.

source: In the user section define a user and assign him the version control user name and password as configured on the server. For example to assign to the user JohnDoe the user johnd whose password is johndpassword, add the following user:
es: En la sección *user* definir un usuario y asignarle el nombre de usuario y contraseña que haya sido configurado de antemano en el servidor de control de versiones. Por ejemplo, para asignarle al usuario JohnDoe el usuario del servidor johnd, cuya contraseña es johndpassword, ingresar lo siguiente:

source: Save the ``permissions.xml`` file.
es: Guardar el archivo ``permissions.xml`` .

source: **To define several version control repositories:**
es: **Para definir varios repositorios de control de versiones:**

source: Add after the lines defining a repository the following lines:
es: Agregar luego de las líneas que definen un repositorio las siguientes líneas:

source: and set the related information.
es: y ingresar la información correspondiente.

source: **To define users for different repositories:**
es: **Para definir usuarios para distintos repositorios:**

source: In the user section assign to a user the version control user name and password as configured on the server of the second repository. For example to assign to the user JohnDoe the user johnd2 whose password is johndpassword2 defined for the second repository, add a ``svn name`` line so that the ``user name`` section in the ``permissions.xml`` file will look like the following:
es: En la sección *user* asignar a un usuario el nombre de usuario y contraseña tal como haya sido configurado en el servidor del segundo repositorio. Por ejemplo, para asignar al mismo usuario JohnDoe el usuario johnd2 cuya contraseña es johndpassword2 definida para el segundo repositorio, ingresar una nueva línea ``svn name`` para que la sección ``user name`` en el archivo ``permissions.xml`` luzca de la siguiente manera:

source: Initializing the Version Control in OpenToonz
es: Inicialización del control de versiones en OpenToonz

source: Before starting to use the version control system, it has to be initialized by setting an option in the **Preferences** dialog and restarting OpenToonz.
es: Antes de poder comenzar a usar el sistema de control de versiones, el mismo tiene que ser inicializado activando una opción en el diálogo de **Preferencias** y reiniciando OpenToonz.

source: At this point the repository will be displayed in the OpenToonz browser, and you will be able to start using it.
es: En este punto el repositorio se mostrará en el Explorador de archivos de OpenToonz y se podrá comenzar a usar.

source: **To initialize the version control system:**
es: **Para inicializar el sistema de control de versiones:**

source: In OpenToonz open the Preferences... → Version Control dialog section and activate the **Enable Version Control** option.
es: En OpenToonz abrir el diálogo Preferencias... → Control de versiones y activar la opción **Habilitar control de versiones**.

source: If the version control is not correctly installed or the configuration file is not correctly defined, activating the option will prompt a warning message.
es: Si el sistema de control de versiones no estuviera correctamente instalado o sus archivos de configuración correctamente definidos, al intentar activar la opción aparecerá un mensaje de advertencia.

source: Quit and restart OpenToonz.
es: Salir y reiniciar OpenToonz.

source: In the OpenToonz browser look for the repository at the end of the folder tree, named as you defined it in the configuration file; right-click it and choose **Get** from the menu that opens to establish the connection between the *central repository* and the local *working copy*.
es: En el Explorador de archivos de OpenToonz buscar el repositorio al final del árbol de carpetas, con el mismo nombre asignado en el archivo de configuración; hacer clic derecho y elegir **Obtener** en el menú para establecer la conexión entre el *repositorio central* y la *copia de trabajo* local.

source: The *central repository* and the local *working copy* are displayed in the OpenToonz browser at the end of the folder tree as one single folder. By navigating the contents of this folder it's possible to retrieve the folders and files.
es: El *repositorio central* y la *copia de trabajo* local son mostradas como una única carpeta en el Explorador de archivos de OpenToonz, en la parte inferior del árbol de carpetas.

source: One online repository defined (**svn_test**) hosting the active project (**mySVNproject**).
es: Un repositorio remoto definido (**svn_test**) alojando el proyecto activo (**mySVNproject**).

source: When a folder is selected in the folder tree *a refresh operation occurs automatically*, to check the status of the folder and its content. As this operations may require some time according to the connection speed on the local network or in the Internet, the automatic refresh operation can be disabled.
es: Cuando se selecciona una carpeta en el árbol de carpetas *ocurre una operación automática de actualización*, para comprobar el estado de la misma y de su contenido. Como esta operación puede tomar algún tiempo, dependiendo de la velocidad de conexión con la red local o Internet, esta operación automática de actualización puede ser deshabilitada.

source: If several repositories are defined, each of them will be displayed with the name previously assigned.
es: Si hubiera varios repositorios definidos, cada uno de ellos será mostrado con el nombre previamente asignado.

source: **To disable the automatic refresh for folder content:**
es: **Para deshabilitar la actualización automática del contenido de carpetas:**

source: Choose File → Preferences... → Version Control.
es: Elegir Archivo → Preferencias... → Control de versiones.

source: Deactivate the **Automatically Refresh Folder Contents** option.
es: Desactivar la opción **Actualizar automáticamente contenido de carpetas**.

source: **To manually refresh a folder content visualization:**
es: **Para actualizar manualmente el contenido de carpetas:**

source: Right-click the folder icon in the folder tree and choose **Refresh** from the menu that opens.
es: Hacer clic derecho sobre el ícono de la carpeta en el árbol de carpetas y elegir **Actualizar** en el menú.

source: Getting and Putting Folders and Files
es: Obtención y envío de carpetas y archivos

source: The basic operations in the version control system involves *getting* files from the central repository to the local working copy; and then *putting* the modified files back from the local *working copy* to the *central repository*.
es: Las operaciones básicas al usar el control de versiones son la *obtención* de archivos desde el repositorio central hacia la copia de trabajo local; y luego el *envío* de los archivos modificados de vuelta desde la *copia de trabajo* local hacia el *repositorio central*.

source: In case you are *putting* folders, in the dialog that opens you can check which files and folders contained in the selected folder have to be put in the central repository. Every time files and folders are put, it is also possible to type a *comment* to let the other users know about s of the performed modifications.
es: En caso de *enviar* carpetas, en el diálogo emergente es posible marcar cuáles archivos y carpetas contenidos en la carpeta seleccionada deberán ser enviados al repositorio central. Cada vez que se envían archivos o carpetas, es posible ingresar un *comentario* para informar a otros usuarios acerca de las modificaciones realizadas.

source: In case you are *getting* or *putting* scene files (TNZ format), in the dialog that opens it's possible to check the **Get Scene Contents** or the **Put Scene Contents** option to include with the request, or return back, the materials used in the scene as well.
es: En caso de estar *obteniendo* o *enviando* archivos de escena (en formato TNZ), es posible marcar en el diálogo emergente la opción **Obtener contenido de la escena** o **Enviar contenido de la escena** para incluir también, junto con la petición o devolución, los materiales usados en la escena.

source: The first time you *get* a folder not previously available in the *working copy* (folder with grey icon), you get the files contained in the folder, but not the sub-folders. The next time you *get* the folder (folder with a colored icon), you get the entire contents of the folder, including sub-folders and the related contents.
es: La primera vez que se *obtiene* una carpeta no disponible previamente en la *copia de trabajo* (carpeta con ícono gris), se obtendrán los archivos contenidos en dicha carpeta, pero no sus subcarpetas. La siguiente vez que se *obtenga* la carpeta (carpeta con ícono de color), se obtendrá el contenido completo de la carpeta, incluyendo el de sus subcarpetas.

source: **To get the latest version of a folder or a file from the central repository to the local working copy:**
es: **Para obtener la versión más reciente de una carpeta o archivo, desde el repositorio central hacia la copia de trabajo local:**

source: Right-click the folder icon in the folder tree, or the file icon in the browser, and choose **Get** from the menu that opens.
es: Hacer clic derecho sobre el ícono de la carpeta en el árbol de carpetas, o el ícono del archivo en el Explorador y elegir **Obtener** en el menú.
