Repository: WizzerWorks/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/using_the_toonz_farm.po
Languages: es

source: In OpenToonz you can find the **Farm** room that allows you to monitor the farm processes. This room contains two main windows: the Tasks window and the Batch Servers window.
es: En OpenToonz es posible encontrar el espacio de trabajo **Farm** que permite monitorear los procesos de la granja. Este espacio de trabajo contiene dos paneles principales: Tareas y Servidores de tareas.

source: The render farm can be monitored by using both the Tasks pane, where the list of tasks can be managed and executed, and the Servers pane, where the computers executing the tasks can be managed.
es: La granja de procesamiento puede ser monitoreada usando tanto el panel Tareas, donde es posible administrar y ejecutar la lista de tareas, como el panel Servidores, donde es posible administrar las computadoras que procesan las tareas.

source: All shared disks involved in the task processing, i.e. disks where files resulting from the task execution have to be written, must be shared granting *full permissions* to any user, otherwise tasks execution will not succeed. For Windows, disks must have a Share Permission set to Full Control for Everyone; for Macintosh, the sharing settings must allow any user to read from and write to disks.
es: Todos los discos involucrados en el procesamiento de las tareas (p.ej: discos donde deban guardarse archivos producidos por el procesamiento de las tareas) deberán estar compartidos otorgando *permisos completos* a todos los usuarios, de otro modo es posible que la ejecución de las tareas no sea exitosa. En Windows, los discos deben tener Control total para Todos; en macOS las opciones de compartición deben permitir que cualquier usuario sea capaz de leer y escribir en los discos.

source: Monitoring the Server Nodes
es: Monitoreo de nodos Servidores

source: The Batch Servers pane is divided in three areas: at the top there’s an option menu to set whether the tasks execution has to be performed with the Local computer or with the Render Farm; then there is the list of server (rendering) nodes in the farm; at the bottom you can see information about the server currently selected in the list.
es: El panel Servidores de tareas está dividido en tres áreas: en al área superior hay un menú de opciones para definir si la ejecución de las tareas debe ser realizada usando la computadora **Local** o la **Granja de procesamiento**; más abajo se encuentra la lista de nodos servidores (procesadores) disponibles en la granja; en el área inferior es posible ver información acerca del servidor seleccionado en la lista.

source: The server (rendering) nodes included in the list are those defined in the ``server.txt`` configuration file (see :ref:`Defining the Server Nodes <defining_the_server_nodes>` ). If a server node is down at the controller startup, it will not be available in the farm: this means that all the server nodes *must be up before* starting up the controller node. For the same reason if you want to restart or shut down a server (rendering) node, you have to restart the controller node in order to make the changes effective.
es: Los nodos servidores (procesadores) incluidos en la lista son aquellos definidos en el archivo de configuración ``server.txt`` (ver :ref:`Definición de nodos Servidores <defining_the_server_nodes>` ). Si un nodo servidor se encontrara fuera de línea en el momento de iniciar el nodo controlador, éste no estará disponible en la granja: esto significa que todos los nodos servidores *deberán estar disponibles con anterioridad* al inicio del nodo controlador. Por la misma razón, si se deseara reiniciar o apagar uno de los nodos servidores (procesadores), será también necesario reiniciar el nodo controlador para que dichos cambios sean efectivos.

source: If the **Process with:** option menu is set to **Local**, all the tasks you run will be executed by the local computer; if it's set to **Render Farm**, the tasks will be executed by the Toonz Farm.
es: Si el menú de opciones **Procesar como:** se encuentra en **Local**, todas las tareas que se ejecuten serán procesadas por la computadora local; si en cambio se encontrara en **Granja de procesamiento**, las tareas serán ejecutadas por la granja de Toonz Farm.

source: When you select **Render Farm** you could be prompted to define the **FARMROOT** (see :ref:`Defining the Toonz Farm in Toonz <defining_the_toonz_farm_in_toonz>` ).
es: Es posible que al seleccionar **Granja de procesamiento** se solicite definir la carpeta principal **FARMROOT** (ver :ref:`Definición de la granja de Toonz Farm en OpenToonz <defining_the_toonz_farm_in_toonz>` ).

source: When a server is selected in the list, the following related information are displayed in the area at the bottom of the window:
es: Cuando se selecciona un servidor en la lista, se muestra la siguiente información relacionada con el mismo en el área inferior del panel:

source: **Name:** displays the name of the server (rendering) node.
es: **Nombre:** muestra el nombre de ese nodo servidor (procesador).

source: **IP Address:** displays its IP address.
es: **Dirección IP:** muestra su dirección IP.

source: **Port Number:** displays the port number used to exchange data with the farm.
es: **№ de puerto:** muestra el número del puerto usado para intercambiar datos con la granja.

source: **Tasks:** displays the task being executed.
es: **Tareas:** muestra la tarea que está siendo ejecutada.

source: **State:** displays if the server is **Ready**, **Busy** or **Down**.
es: **Estado:** muestra si el servidor se encuentra **Listo**, **Ocupado** o **Fuera de línea**.

source: A server node state may be down if the server port you set is blocked by a firewall system, and is not open for all the computers belonging to the Toonz Farm (see :ref:`Defining the Server Nodes <defining_the_server_nodes>` ).
es: El estado de un nodo servidor puede aparecer como **Fuera de línea** si el puerto establecido para el servidor se encontrara bloqueado por un sistema de cortafuegos, y por lo tanto no se encontrara abierto para todas las computadoras de la granja de Toonz Farm (ver :ref:`Definición de nodos Servidores <defining_the_server_nodes>` ).

source: **Number of CPU:** displays the number of CPUs available on the server.
es: **Cantidad de CPU:** muestra la cantidad de núcleos de procesador disponibles en ese servidor.

source: **Physical Memory:** displays the amount of physical memory available on the server.
es: **Memoria física:** muestra la cantidad de memoria física disponible en ese servidor.

source: **To use the Local computer to execute tasks:**
es: **Para usar la computadora Local para ejecutar tareas:**

source: Set the **Process with:** option menu to **Local**.
es: Definir el menú de opciones **Procesar con:** en **Local**.

source: **To use the Toonz Farm to execute tasks:**
es: **Para usar Toonz Farm para ejecutar tareas:**

source: Set the **Process with:** option menu to **Render Farm**.
es: Definir el menú de opciones **Procesar con:** en **Granja de procesamiento**.

source: Checking the Toonz Farm Processing
es: Comprobación del procesamiento con Toonz Farm

source: When the Toonz Farm is used, any problem that may be experienced during the processing is recorded in LOG files, that can be opened and used to diagnose problems.
es: Al usar la granja de Toonz Farm, cualquier problema que pudiera experimentarse durante el procesamiento será registrado en archivos LOG; los mismos pueden ser abiertos y utilizados para diagnosticar un problema.

source: The LOG files are saved in the ``OpenToonz stuff\toonzfarm`` folder of the computer experiencing the problem; each LOG refers to the processing performed by that computer only.
es: Los archivos LOG se almacenan en la carpeta ``OpenToonz stuff\toonzfarm`` de la computadora que experimentó el problema; cada archivo LOG se refiere únicamente al procesamiento realizado por esa computadora.

source: The LOG files that may be generated by the Toonz Farm processing are the following:
es: Los archivos LOG que pueden ser generados por Toonz Farm son los siguientes:

source: **server.log** logs all the operations concerning the server computer activity.
es: **server.log** registra todas las operaciones relativas a la actividad de la computadora actuando como servidor.

source: **controller.log** logs all the operations concerning the controller computer activity.
es: **controller.log** registra todas las operaciones relativas a la actividad de la computadora actuando como controlador.

source: **tcomposer.log** logs all the operations concerning the render activity performed by the server computers.
es: **tcomposer.log** registra todas las operaciones relativas a procesamiento de las computadoras que actúan como servidores.

source: **tcleanup.log** logs all the operations concerning the cleanup activity performed by the server computers.
es: **tcleanup.log** registra todas las operaciones relativas a limpieza de las computadoras que actúan como servidores.
