Repository: WizzerWorks/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/using_the_version_control.po
Languages: es

source: In the dialog that opens if you are getting a scene file (TNZ format) activate the **Get Scene Contents** if you want to get the files used in the scene as well.
es: Si se estuviera obteniendo un archivo de escena (formato TNZ), en el diálogo emergente marcar la opción **Obtener contenido de la escena**, si se desea obtener también los archivos usados en la misma.

source: Click the **Update** button.
es: Hacer clic en el botón **Actualizar**.

source: **To put your modified version of a folder or a file from the local working copy to the central repository:**
es: **Para enviar la versión modificada de una carpeta o archivo desde la copia de trabajo local hacia el repositorio central:**

source: Right-click the folder icon in the folder tree, or the file icon in the browser, and choose **Put** from the menu that opens.
es: Hacer clic sobre el ícono de la carpeta en el árbol de carpetas o el ícono del archivo en el Explorador y elegir **Enviar** en el menú.

source: In the dialog that opens do any of the following:
es: En el dialogo emergente hacer alguna de las siguientes cosas:

source: If you are putting a folder, check which files and folders contained by the selected folder have to be put in the central repository.
es: Si se está enviando una carpeta, marcar los archivos y carpetas contenidos en la misma, que deberán ser enviados al repositorio central.

source: If you are putting a scene file (TNZ format) activate the **Put Scene Contents** if you want to put the files used in the scene as well.
es: Si se está enviando un archivo de escena (formato TNZ), activar la opción **Enviar contenido de la escena**, si se desea enviar también los archivos usados en la misma.

source: Type a comment if required and click the **Put** button.
es: Ingresar un comentario, si es oportuno, y hacer clic en el botón **Enviar**.

source: Editing Files
es: Edición de archivos

source: When using the version control system, in order to modify files you have to put them in **Edit** mode *before loading them* into OpenToonz; if not, they will be loaded as *read-only*.
es: Al usar el sistema de control de versiones, para poder modificar archivos es necesario colocarlos en modo **Edición** *antes de cargarlos* en OpenToonz; en caso contrario serán cargados en modo de *sólo lectura*.

source: The **Edit** operation "locks" the file, so only the user running the command will be able to modify it (preventing other users using the same *central repository* from unlocking it and being able to modify it). At the moment a file is about to be edited, it's possible to type in a *Comment*, to let the other users know about your editing operation.
es: La operación **Editar** "bloquea" el archivo, de forma que sólo el usuario que ejecute dicho comando sea capaz de modificarlo (previniendo así que otros usuarios que usen el mismo *repositorio central* lo desbloqueen y sean capaces de modificarlo). En el momento en que se está por colocar un archivo en modo edición, es posible ingresar un *Comentario*, para informar a otros usuarios acerca de la operación de edición que se está por realizar.

source: When editing a scene file (TNZ format), in the dialog that opens it's possible to check the **Edit Scene Contents** option, in order to be able to edit the materials used in the scene as well. If you choose to edit only the scene file, or if some material used in the scene is currently being edited by other users sharing the same central repository, the locked frames of that levels will be displayed with a forbidden icon in the Level Strip.
es: Al intentar editar un archivo de escena (formato TNZ), en el diálogo emergente es posible marcar la opción **Editar contenido de la escena**, para poder editar también el material usado en la misma. Si se elige editar sólo el archivo de escena, o si algún material usado en la misma se encontrara actualmente siendo editado por otros usuarios del mismo repositorio central, los fotogramas bloqueados se mostrarán con un ícono de prohibido, en la Cinta de nivel.

source: The **Edit Frame Range** command is available as well, to let a user edit only the *needed frames* of any Toonz Vector or Toonz Raster animation level. This way, different users can work at the same time *on different frame ranges* of the same animation level.
es: También se encuentra disponible el comando **Editar rango de fotogramas** para permitir editar de solamente los *fotogramas necesarios* de cualquier nivel de animación Vectorial de Toonz o Imagen de Toonz. De esta manera, es posible que distintos usuarios trabajen al mismo tiempo *diferentes en rangos de fotogramas* dentro del mismo nivel de animación.

source: When you want to release files from the *editing mode*, so that others can work on them, you can use the **Unlock** command.
es: Para liberar archivos del *modo edición*, de forma que otros usuarios puedan trabajar en ellos, es posible usar el comando **Desbloquear**.

source: Files are in read-only mode (or in locked mode) in case a user is *editing* them, by setting the file system read-only attribute. For this reason, manually using the OS (instead of the appropriate version control commands) to change this status, may cause serious inconsistencies in the version control system.
es: Los archivos que están siendo *editados* por otros usuarios se encuentran en modo de sólo lectura (o bloqueados), mediante el uso del atributo correspondiente del sistema de archivos. Por esta razón, cambiar manualmente esta propiedad usando el sistema operativo (en vez de los comandos apropiados del sistema de control de versiones), puede acarrear serias inconsistencias en el sistema de control de versiones.

source: **To edit an updated file:**
es: **Para editar un archivo actualizado:**

source: Right-click the file and choose **Edit** from the menu that opens.
es: Hacer clic derecho sobre el archivo y elegir **Editar** en el menú.

source: In the dialog that opens if you are editing a scene file (TNZ format) activate the **Edit Scene Contents** if you want to edit the files used in the scene as well.
es: En el diálogo emergente, si se estuviera editando un archivo de escena (formato TNZ), marcar la opción **Editar contenido de la escena** si se desea editar también los archivos usados en la misma.

source: Type a comment if required and click the **Edit** button.
es: Ingresar un comentario, si es oportuno, y hacer clic en el botón **Editar**.

source: **To edit a file that is older than the version available in the central repository:**
es: **Para editar un archivo más antiguo que la versión disponible en el repositorio central:**

source: Type a comment if required and do one of the following:
es: Ingresar un comentario, si es oportuno, y realizar alguna de las siguientes cosas:

source: Click the **Get and Edit** button to get the latest version of the files and edit them.
es: Hacer clic en el botón **Obtener y editar** para obtener la última versión de los archivos y editarlos.

source: Click the **Edit** button to edit the version of the files that is currently in your local working copy.
es: Hacer clic en el botón **Editar** para editar la versión de los archivos que se encuentra actualmente en la copia de trabajo local.

source: **To edit only the needed frames of a Toonz level file:**
es: **Para editar solamente los fotogramas necesarios del archivo de un nivel Toonz:**

source: Right-click the file and choose **Edit Frame Range** from the menu that opens.
es: Hacer clic derecho sobre el archivo y elegir **Editar rango de fotogramas** en el menú.

source: In the dialog that opens set the frame range you want to edit.
es: En el diálogo emergente definir el rango de fotogramas que se desea editar.

source: **To release a file from the editing mode:**
es: **Para liberar un archivo del modo edición:**

source: Right-click the file and choose **Unlock** from the menu that opens.
es: Hacer clic derecho sobre el archivo y elegir **Desbloquear** en el menú.

source: **To check the editing state of a locked file:**
es: **Para comprobar el estado de edición de un archivo bloqueado:**

source: Right-click the file and choose **Edit Info** from the menu that opens.
es: Hacer clic derecho sobre el archivo y elegir **Información de edición** en el menú.

source: Retrieving File Revisions
es: Recuperación de revisiones de archivos

source: One of the main advantages of using a version control system is that the *history* of the revisions for every file in the production database is always available. This means that it's possible to very easily retrieve previous versions of any file.
es: Una de las principales ventajas de usar un sistema de control de versiones es que en todo momento se encuentra disponible el *historial* de revisiones, para cada archivo de la base de datos de la producción. Esto significa que es posible recuperar de manera sencilla versiones anteriores de cualquier archivo.

source: To retrieve older file versions it's possible to use the **Get Revision** command. When used on a single file it displays a timeline with all the file versions; in the timeline you can check the different file versions with the related icons and information, and select which version to get in order to edit it.
es: Para recuperar versiones antiguas de archivos es posible usar el comando **Obtener revisión**. Al ser usado en un único archivo, muestra una línea de tiempo con todas las versiones del mismo; en dicha línea de tiempo es posible revisar las distintas versiones del archivo, usando las miniaturas e información correspondientes, y seleccionar qué versión obtener para su edición.

source: When getting a revision of a scene file (TNZ format), in the dialog that opens it's possible to check the **Get Scene Contents** option in order to get the revisions of the materials used in the scene as well.
es: Al obtener una revisión de un archivo de escena (formato TNZ), en el diálogo emergente es posible marcar la opción **Obtener contenido de la escena** para obtener también las revisiones de todo el material usado en la misma.

source: When used on a multiple files selection it opens a dialog that allows you to specify the time, day, week or date of the files version you want to retrieve.
es: Al ser usado sobre una selección de varios archivos, el comando abre un diálogo que permite especificar la hora, día, semana o fecha de la versión de los archivos que se desea recuperar.

source: **To retrieve an older revision of a file:**
es: **Para recuperar una versión anterior de un archivo:**

source: Right-click the file and choose **Get Revision** from the menu that opens.
es: Hacer clic derecho sobre el archivo y elegir **Obtener revisión** en el menú.

source: In the dialog that opens look for the file version you are interested in and select it; if you are editing a scene file (TNZ format) activate the **Edit Scene Contents** if you want to get the revision of the files used in the scene as well.
es: En el diálogo emergente buscar la versión del archivo en la que se está interesado y seleccionarla; si se está recuperando un archivo de escena (formato TNZ), es posible activar la opción **Obtener contenido de la escena** si se desea recuperar también los archivos usados en la misma.

source: Do one of the following:
es: Realizar una de las siguientes cosas:

source: Click the **Get Selected Revision** button to get the selected file version.
es: Hacer clic en el botón **Obtener revisión seleccionada** para obtener la versión del archivo seleccionada.

source: Click the **Get Last Revision** button to get the latest file version.
es: Hacer clic en el botón **Obtener la última revisión** para obtener la última versión del archivo.

source: **To retrieve an older revision of a selection of multiple files:**
es: **Para recuperar una versión anterior de una selección de varios archivos:**

source: Right-click any of the selected files and choose **Get Revision** from the menu that opens.
es: Hacer clic derecho sobre cualquiera de los archivos seleccionados y elegir **Obtener revisión** en el menú.

source: In the dialog that opens specify how much older the version of the files you want to retrieve has to be, by doing one of the following:
es: En el diálogo emergente especificar qué tan antigua tiene que ser la versión de los archivos deseada, haciendo una de las siguientes cosas:

source: Specify a *time* in hours and minutes.
es: Especificar una *hora* en horas y minutos.

source: Specify a number of *days*.
es: Especificar una cantidad de *días*.

source: Specify a number of *weeks*.
es: Especificar una cantidad de *semanas*.

source: Specify and exact *date and time*.
es: Especificar una *fecha y hora* exacta.

source: Understanding the Folder and File Icons
es: Descripción de los íconos de carpetas y archivos

source: According to the folder and file icons you can tell if the folder or the file in the working copy is updated or not to the latest version available in the central repository, and if files are edited by other users and locked.
es: Es posible saber, mirando los íconos de las carpetas y archivos de la copia de trabajo local, si los mismos se encuentran actualizados o no a la última versión del repositorio central, así como si los archivos están siendo editados por otros usuarios, etc.

source: If the File Browser displays files as a List, the information about the version control status is displayed in the column labeled *Version Control*.
es: Si el Explorador de archivos estuviera mostrando los mismos en forma de Lista, la información acerca del estado del control de versiones será mostrado en la columna etiquetada *Control de versiones*.

source: For **folders** the following icons are used:
es: Para **carpetas** se utilizan los siguientes íconos:

source: |grey_folder| A *grey* folder icon is used for folders available only in the *repository*. You can use the **Get** command to copy them to the local *working copy*.
es: |grey_folder| Un ícono *gris* de carpeta es usado para representar a las que están únicamente disponibles en el *repositorio*. Es posible usar el comando **Obtener** para copiarlas a la *copia de trabajo* local.

source: |colored_folder_with_yellow_mark| A colored folder icon with a *yellow mark* is used when the folder contents in the *working copy* is not up to date and does not match to the folder contents in the *repository*: this is the case when there are modified or new files in the *working copy* or there are modified or new files in the *repository*. You can use the **Get** command to copy them to the local *working copy*.
es: |colored_folder_with_yellow_mark| Un ícono de carpeta en color con una *marca amarilla* es usado para representar a aquellas cuyo contenido en la *copia de trabajo* no está actualizado y por lo tanto no coincide con el contenido en el *repositorio*: este es el caso cuando existen archivos modificados o nuevos en la *copia de trabajo* o en el *repositorio*. Es posible usar el comando **Obtener** para copiarlos a la *copia de trabajo*.

source: |colored_folder_with_green_mark| A colored folder icon with a *green mark* is used when the folder contents in the *working copy* is up to date and matches to the folder contents in the *repository*.
es: |colored_folder_with_green_mark| Un ícono de carpeta en color con una *marca verde* es usado para representar a aquellas cuyo contenido en la *copia de trabajo* se encuentra actualizado y coincide con el contenido en el *repositorio*.

source: |colored_folder_with_plus_mark| A colored folder with a *plus mark* is used for folders available only in the *working copy*. You can use the **Put** command to copy them to the *central repository*.
es: |colored_folder_with_plus_mark| Un ícono de carpeta en color con un *signo de más* es usado para representar a aquellas disponibles únicamente en la *copia de trabajo*. Es posible usar el comando **Enviar** para copiarlas al *repositorio central*.

source: For **files** the following icons are used:
es: Para **archivos** se utilizan los siguientes íconos:

source: A generic *grey* icon is used for files available only in the *repository*. You can use the **Get** command to copy them to the local *working copy*.
es: Un ícono *gris* genérico es usado para representar archivos que están únicamente disponibles en el *repositorio*. Es posible usar el comando **Obtener** para copiarlos a la *copia de trabajo* local.

source: |grey_mark_check| The file icon with a *grey check mark* is used when files in the *working copy* are up to date and match to the latest version available in the *repository*. The files are in *read-only mode*, and they have to be in *edit mode* in order to be modified.
es: |grey_mark_check| Un ícono de archivo con un *signo de verificación gris* es usado para representar a aquellos cuyo contenido en la *copia de trabajo* se encuentra actualizado y coincide con el contenido en el *repositorio*. Los archivos se encuentran en *modo de sólo lectura* y deberán colocarse en *modo edición* para poder ser modificados.

source: |green_mark_check| The file icon with a *green check mark* is used when files in the *working copy* are in *edit mode*.
es: |green_mark_check| Un ícono de archivo con un *signo de verificación verde* es usado para representar a aquellos que se encuentran en la *copia de trabajo* en *modo edición*.

source: |half_grey_mark_check| The file icon with a *green check mark on a grey and white background* is used when files in the *working copy* are partially in *edit mode*.
es: |half_grey_mark_check| Un ícono de archivo con un *signo de verificación verde sobre un fondo gris y blanco* es usado para representar a aquellos que se encuentran en la *copia de trabajo* y que están parcialmente en *modo edición*.

source: |red_exclamation_mark_check| The file icon with a *red exclamation mark* is used when files in the *working copy* are newer than the latest version available in the *repository*, because you modified them. You can use the **Put** command to copy them to the *central repository*.
es: |red_exclamation_mark_check| Un ícono de archivo con un *signo de admiración rojo* es usado para representar a aquellos cuya versión en la *copia de trabajo* es más nueva que la disponible en el *repositorio*, esto es porque han sido modificados localmente. Es posible usar el comando **Enviar** para copiarlos al *repositorio central*.

source: |half_grey_red_exclamation_mark_check| The file icon with a *red exclamation mark on a grey and white background* is used when files in the *working copy* are partially newer than to the latest version available in the *repository*, because you modified them. You can use the **Put** command to copy them to the *central repository*.
es: |half_grey_red_exclamation_mark_check| Un ícono de archivo con un *signo de admiración rojo sobre un fondo gris y blanco* es usado para representar a aquellos cuya versión en la *copia de trabajo* es parcialmente más nueva que la disponible en el *repositorio*, esto es porque han sido modificados localmente. Es posible usar el comando **Enviar** para copiarlos al *repositorio central*.

source: |orange_exclamation_mark_check| The file icon with an *orange exclamation mark* is used when files in the *working copy* are older than the latest version available in the *repository*, because someone modified them. You can use the **Get** command to copy them to the *local working copy*.
es: |orange_exclamation_mark_check| Un ícono de archivo con un *signo de admiración naranja* es usado para representar a aquellos cuya versión en la *copia de trabajo* es más antigua que la disponible en el *repositorio*, esto es porque han sido modificados remotamente por otro usuario. Es posible usar el comando **Obtener** para copiarlos a la *copia de trabajo* local.

source: |lock_mark| The file icon with an *lock mark* is used when files are in *edit mode* by other users. For these files it is only possible to check the information about the user editing the file.
es: |lock_mark| Un ícono de archivo con un *candado* es usado para representar a aquellos que otros usuarios han colocado en *modo edición*. Para estos archivos sólo será posible revisar la información acerca del usuario que se encuentra editando el mismo.

source: |half_grey_lock_mark| The file icon with a *lock mark on a grey and white background* is used when files are *partially in edit mode* by other users.
es: |half_grey_lock_mark| Un ícono de archivo con un *candado sobre un fondo gris y blanco* es usado para representar a aquellos que otros usuarios han colocado *parcialmente en modo edición*.

source: |blue_plus_mark| The file icon with the *plus mark* is used for files available only in the *working copy*. You can use the **Put** command to copy them to the *central repository*.
es: |blue_plus_mark| Un ícono de archivo con un *signo de más* es usado para representar a aquellos disponibles únicamente en la *copia de trabajo*. Es posible usar el comando **Enviar** para copiarlos al *repositorio central*.
