Repository: WizzerWorks/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/using_the_toonz_farm.po
Languages: es

source: Using the Toonz Farm
es: Uso de Toonz Farm

source: The Toonz Farm allows you to process OpenToonz scenes submitted as cleanup tasks or render tasks in the task list by using a series of computers connected on the same network using TCP/IP (see :ref:`Cleaning up Drawings in Batch Mode <cleaning_up_drawings_in_batch_mode>` and :ref:`Rendering Scenes in Batch Mode <rendering_scenes_in_batch_mode>` ).
es: Toonz Farm permite procesar escenas de OpenToonz enviadas como tareas de limpieza o de procesamiento a la lista de tareas usando una serie de computadoras conectadas a una misma red mediante TCP/IP (ver :ref:`Limpieza de dibujos en modo por lotes <cleaning_up_drawings_in_batch_mode>` y :ref:`Procesamiento de escenas en modo por lotes <rendering_scenes_in_batch_mode>` ).

source: When tasks are executed, they are automatically assigned to the computers belonging to the farm in order to balance the workload. When all computers are busy, remaining tasks are not assigned until a machine is ready to process them.
es: Cuando las tareas son ejecutadas, son asignadas automáticamente a las computadoras pertenecientes a la granja para balancear la carga de trabajo. Cuando todas las computadoras se encuentren ocupadas, las tareas restantes no serán asignadas hasta que una de ellas se encuentre lista para procesarlas.

source: If you have divided a render task into *chunks*, each chunk will be assigned to a different computer of the farm, thus speeding up the rendering of a single render task (see :ref:`Using Chunks when Rendering Tasks <using_chunks_when_rendering_tasks>` ).
es: Si se hubiera dividido una tarea de procesamiento en *bloques*, cada bloque será asignado a una computadora distinta de la red, agilizando así el procesamiento de la misma (ver :ref:`Uso de bloques en tareas de procesamiento <using_chunks_when_rendering_tasks>` ).

source: The Toonz Farm is composed by the following:
es: Toonz Farm está compuesto por lo siguiente:

source: **Controller node**: is the computer that dispatches the tasks to server (rendering) nodes. This computer runs the controller program, named ``tfarmcontroller.exe`` on Windows and ``tfarmcontrollerd`` on Macintosh. One controller node is needed for defining a farm.
es: **Nodo controlador**: es la computadora que envía las tareas a los nodos servidores (procesadores). Esta computadora debe tener corriendo el programa controlador, llamado ``tfarmcontroller.exe`` en Windows o ``tfarmcontrollerd`` en macOS. Es necesario contar con un nodo controlador para poder definir una granja de procesamiento.

source: The controller node can also be used as a server (rendering) node.
es: El nodo controlador también puede ser usado como nodo servidor (procesador).

source: **Server (rendering) nodes**: are the computers that execute tasks dispatched by the controller. Each of these computers runs a server program, named ``tfarmserver.exe`` on Windows and ``tfarmserverd`` on Macintosh, that is in charge of running tasks, notifying the controller when a task has been completed, etc.
es: **Nodos servidores (procesadores)**: son computadoras que procesan las tareas enviadas por el nodo controlador. Cada una de estas computadoras debe tener corriendo un programa servidor, llamado ``tfarmserver.exe`` en Windows o ``tfarmserverd`` en macOS, que se encarga de ejecutar las tareas, notificando al nodo controlador cuando una tarea haya sido completada, etc.

source: **Root folder** named FARMROOT: is a shared folder where a number of configuration files are stored. The controller node and all the rendering nodes must be able to access this shared folder (see :ref:`Configuring the Toonz Farm <configuring_the_toonz_farm>` ).
es: **Carpeta principal** llamada FARMROOT: es una carpeta compartida donde se almacena una serie de archivos de configuración. El nodo controlador y todos los nodos procesadores deben poder acceder a esta carpeta compartida (ver :ref:`Configuración de Toonz Farm <configuring_the_toonz_farm>` ).

source: **Client program**: is the program run by the user to queue new tasks and to monitor the Toonz Farm. OpenToonz itself is the client program of the Toonz Farm, and can be run on any computer on the network, not necessarily on a controller node or a sever (rendering) node.
es: **Programa cliente**: es el programa ejecutado por el usuario para agregar nuevas tareas a la lista, así como para monitorear la granja de Toonz Farm. El propio OpenToonz es el programa cliente de Toonz Farm, y puede ser ejecutado en cualquier computadora de la red (que no tiene por qué necesariamente ser un nodo servidor (procesador) o controlador).

source: In order to render the scenes successfully all the computers involved in the Toonz Farm, controller, servers and clients have to share the same projectroot folders (see :ref:`Setting the Projectroot <setting_the_projectroot>` ).
es: Para poder procesar las escenas exitosamente todas las computadoras relacionadas con Toonz Farm (controlador, servidores y clientes) deben compartir las mismas carpetas principales de proyectos (ver :ref:`Definición de la carpeta principal de proyectos <setting_the_projectroot>` ).

source: Installing the Toonz Farm on Windows
es: Instalación de Toonz Farm en Windows

source: To install the Toonz Farm, you have to install the Farm Controller component on the controller node, and the Farm Server component on the server (rendering) nodes.
es: Para instalar Toonz Farm, es necesario instalar el componente de Controlador en la computadora que funcionará como nodo controlador, y el componente de Servidor en las computadoras que servirán como nodos servidores (procesadores).

source: If you want to use a computer both as controller and as server (rendering) node, you have to install both the components.
es: Si se desea usar una misma computadora tanto como nodo controlador como servidor, será necesario instalar allí ambos componentes.

source: During the installation of any of the components you must specify the full-path of the FARMROOT folder. This path must be expressed using the UNC format, like the following:
es: Durante la instalación de cualquiera de los componentes se debe especificar la ruta completa a la carpeta principal FARMROOT. Esta ruta debe ser expresada en formato UNC, como se indica a continuación:

source: ``\\HostName\ShareName\FolderName``
es: ``\\Nombre del servidor\Nombre del recurso compartido\Nombre de la carpeta``

source: The drive where the FARMROOT folder is located has to be shared on the network, giving full control to any user by setting the right permissions.
es: El disco donde se encuentre la carpeta FARMROOT tiene que estar compartido en la red, otorgando control completo a cualquier usuario, mediante el uso de los permisos apropiados.

source: When you choose to install the Farm Controller component, the installation program will create for the controller program a Windows Service, named **Toonz Farm Controller**.
es: Cuando se elige instalar el componente del Controlador, la instalación creará un Servicio de Windows para el programa controlador, llamado **Toonz Farm Controller**.

source: When you choose to install the Farm Server component, the installation program will create for the server program a Windows Service, named **Toonz Farm Server**.
es: Al elegir instalar el componente del Servidor, el programa de instalación creará un programa Servicio de Windows, llamado **Toonz Farm Server**.

source: As the Toonz Farm requires exchanges of data between computers in the network by using TCP/IP protocol, any firewall system that may block access on computer ports has to be disabled.
es: Como Toonz Farm necesita intercambiar datos entre las computadoras de la red, usando el protocolo TCP/IP, cualquier sistema de cortafuegos que pueda bloquear el acceso a los puertos de la computadora tendrá que ser deshabilitado o permitir el libre acceso a los puertos usados por Toonz Farm.

source: Setting the Controller Node
es: Configuración del nodo Controlador

source: On the controller node the controller component is installed as a Windows service, named **Toonz Farm Controller**. By default a Windows Service runs under the security credentials of the Local System account. By default this account is not granted the right to access folders shared by remote hosts.
es: En el nodo controlador el componente controlador es instalado como un servicio de Windows, llamado **Toonz Farm Controller**. De forma predefinida un Servicio de Windows se ejecuta bajo las credenciales de seguridad de la cuenta *Sistema local*. De forma predefinida esta cuenta no cuenta con derecho a acceder carpetas compartidas por servidores remotos.

source: Since the **Toonz Farm Controller** needs to access the FARMROOT folder, typically shared by a remote host, please run this service as a user with the proper rights.
es: Como el servicio **Toonz Farm Controller** necesita acceder a la carpeta principal FARMROOT, usualmente compartida desde un servidor remoto, es necesario ejecutar este servicio desde un usuario con los permisos apropiados.

source: It is possible to start the service from a DOS shell by navigating to the folder where the binaries of OpenToonz are installed, and then using the following command line:``tfarmcontroller -console``
es: Es posible iniciar el servicio desde una línea de comandos de DOS navegando hasta la carpeta donde se encuentran instalados los binarios de OpenToonz, y allí usar el siguiente comando:``tfarmcontroller -console``

source: **To run the Toonz Farm Controller as a user with the proper rights:**
es: **Para ejecutar el Controlador de Toonz Farm como un usuario con los permisos apropiados:**

source: Choose Control Panel → Administrative Tools → Services, and right-click the **Toonz Farm Controller** service to open the Properties panel.
es: Elegir Panel de control → Sistema y seguridad → Herramientas administrativas → Servicios, y hacer clic derecho sobre el servicio **Toonz Farm Controller** para abrir su diálogo de Propiedades.

source: Select the Log On page, check the **This Account:** option.
es: Seleccionar la solapa Iniciar sesión, marcar la opción **Esta cuenta:**.

source: Choose the network where the Toonz Farm is going to work and set an account that has administrator rights on that network. Insert and confirm the related password.
es: Elegir la red donde Toonz Farm va a funcionar y una cuenta que cuente con permisos de administrador en la misma. Ingresar y confirmar la contraseña correspondiente.

source: Click the **OK** button.
es: Hacer clic en el botón **Aceptar**.

source: Setting the Server Nodes
es: Configuración de los nodos Servidores

source: On the server (rendering) nodes, the server component is installed as a Windows service, named **Toonz Farm Server**. By default a Windows Service runs under the security credentials of the Local System account. By default this account is not granted the right to access folders shared by remote hosts.
es: En los nodos servidores el componente servidor es instalado como un servicio de Windows, llamado **Toonz Farm Server**. De forma predefinida un Servicio de Windows se ejecuta bajo las credenciales de seguridad de la cuenta *Sistema local*. De forma predefinida esta cuenta no cuenta con derecho a acceder carpetas compartidas por servidores remotos.

source: Since the **Toonz Farm Server**, for rendering purposes, needs to access one or more folders shared by remote hosts, please run this service as an user with the proper rights.
es: Como el servicio **Toonz Farm Server**, para sus propósitos de procesamiento, necesita acceder a una o más carpetas compartidas desde servidores remotos, es necesario ejecutar este servicio desde un usuario con los permisos apropiados.

source: It is possible to start the service from a DOS shell by navigating to the folder where the binaries of OpenToonz are installed, and then using the following command line:``tfarmserver -console``
es: Es posible iniciar el servicio desde una línea de comandos de DOS navegando hasta la carpeta donde se encuentran instalados los binarios de OpenToonz, y allí usar el siguiente comando:``tfarmserver -console``

source: **To run the Toonz Farm Controller as an user with the proper rights:**
es: **Para ejecutar el Servidor de Toonz Farm como un usuario con los permisos apropiados:**

source: Choose Control Panel → Administrative Tools → Services, and right-click the **Toonz Farm Server** service to open the Properties panel.
es: Elegir Panel de control → Sistema y seguridad → Herramientas administrativas → Servicios, y hacer clic derecho sobre el servicio **Toonz Farm Server** para abrir su diálogo de Propiedades.

source: Installing the Toonz Farm on Macintosh
es: Instalación de Toonz Farm en macOS

source: After the installation of the toonz farm components, a FARMROOT folder has to be defined, and on all the computers belonging to the farm, both controller and servers, the full-path of the FARMROOT folder has to be specified.
es: Luego de la instalación de los componentes de Toonz Farm, es necesario definir una carpeta principal FARMROOT, y en todas las computadoras pertenecientes a la granja (tanto controlador como servidores) se debe especificar la ruta completa a la carpeta FARMROOT.

source: To define the FARMROOT folder you can take as model the ``toonzfarm`` folder stored in ``OpenToonz stuff``. You can take the ``toonzfarm`` folder from any computer where OpenToonz in installed, choose the location you prefer, and share it on the network, giving full control to any user by setting the right permissions.
es: Es posible tomar como modelo para definir la carpeta principal FARMROOT a la carpeta ``toonzfarm`` almacenada en ``OpenToonz stuff``. Es posible tomar la carpeta ``toonzfarm`` de cualquier computadora donde se encuentre instalado OpenToonz, elegir una ubicación preferida y compartirla en la red, otorgando control total a todos los usuarios, por medio de los permisos apropiados.

source: To specify the path to the FARMROOT on the computers, both controller and servers, belonging to the farm, you have to edit the ``configfarmroot.txt`` file by typing in it the full path to the FARMROOT folder.
es: Para especificar la ruta a la carpeta principal FARMROOT en las computadoras (tanto controlador como servidores) pertenecientes a la red, es necesario editar el archivo ``configfarmroot.txt`` ingresando en el mismo la ruta completa a la carpeta FARMROOT.

source: To retrieve this file open the ``Applications/OpenToonz`` folder, right-click the OpenToonz icon and choose Show Package Contents from the menu that opens; in the folder that opens browse to the ``Contents/Resources`` folder and retrieve the ``configfarmroot.txt`` file.
es: Para recuperar este archivo abrir la carpeta ``Applications/OpenToonz``, hacer clic derecho sobre el ícono de OpenToonz y elegir Mostrar Contenido del Paquete en el menú; en la carpeta que se abre navegar hasta la carpeta ``Contents/Resources`` y recuperar el archivo ``configfarmroot.txt`` .

source: As the Toonz farm requires exchanges of data between computers in the network by using TCP/IP protocol, any firewall system that may block access on computer ports has to be disabled.
es: Como Toonz Farm necesita intercambiar datos entre las computadoras de la red, usando el protocolo TCP/IP, cualquier sistema de cortafuegos que pueda bloquear el acceso a los puertos de la computadora tendrá que ser deshabilitado o permitir el libre acceso a los puertos usados por Toonz Farm.

source: Configuring the Toonz Farm
es: Configuración de Toonz Farm

source: Once the installation has been completed, you have to configure the Toonz Farm by editing some configuration files stored in the FARMROOT folder.
es: Una vez que se ha completado la instalación, es necesario configurar Toonz Farm mediante la edición de algunos archivos de configuración almacenados en la carpeta FARMROOT.

source: The FARMROOT folder must be accessible by all the nodes that compose the Toonz Farm: the controller node, the server (rendering) nodes and the computers running OpenToonz. This means that the drive where the FARMROOT folder is located has to be shared on the network, and the permissions for users have to be maximum, in order to give full control to any users.
es: La carpeta FARMROOT debe estar accesible desde todos los nodos que componen la granja de Toonz Farm: el nodo controlador, los nodos servidores (procesadores) y las computadoras que corren OpenToonz. Esto significa que el disco donde se encuentre ubicada la carpeta principal FARMROOT debe estar compartido en la red y los permisos para los usuarios deben estar al máximo, para poder darle control total a cualquiera de ellos.

source: For the same reason the computer where the FARMROOT is located has to be started before all the other computers involved in the farm.
es: Por la misma razón la computadora donde se encuentre ubicada la carpeta FARMROOT tiene que encontrarse en funcionamiento con anterioridad a las demás computadoras de la granja.

source: The FARMROOT folder contains the following:
es: La carpeta FARMROOT contiene lo siguiente:

source: the ``config`` folder containing the ``servers.txt`` , the ``controller.txt`` and the ``id.txt`` .
es: la carpeta ``config`` conteniendo los archivos ``servers.txt`` , ``controller.txt`` y ``id.txt`` .

source: the ``logs`` folder.
es: la carpeta ``logs`` .

source: The ``controller.txt`` and the ``servers.txt`` configuration files must be edited to define the controller node and the server (rendering) nodes before using the Render Farm.
es: Es necesario editar los archivos de configuración ``controller.txt`` y ``servers.txt`` para definir el nodo controlador y los nodos servidores (procesadores) antes de poder usar la granja de procesamiento.

source: Defining the Controller Node
es: Definición del nodo Controlador

source: The controller node is defined in the ``controller.txt`` configuration file placed in the ``FARMROOT\config`` folder.
es: El nodo controlador se define en el archivo de configuración ``controller.txt`` ubicado en la carpeta ``FARMROOT\config`` .

source: The file must contain a single text line that describes the node you want to use as a controller.
es: El archivo debe contener una única línea de texto que describa el nodo que se desee usar como nodo controlador.

source: For the controller node you must specify the following:
es: Para el nodo controlador debe especificarse lo siguiente:

source: Computer name.
es: Nombre del equipo.

source: IP address.
es: Dirección IP.

source: The port number you intend to use for the controller service.
es: El número del puerto que se desee usar para el servicio del controlador.

source: Be sure that the port you set is not blocked by any firewall system, and is open for all the computers belonging to the Toonz farm.
es: Es necesario asegurarse de que el puerto establecido no se encuentre bloqueado por ningún sistema cortafuegos, y que se encuentre abierto para todas las computadoras pertenecientes a la granja de Toonz Farm.

source: Each of the above information must be separated by a single space. Here is an example of a ``controller.txt`` file:
es: Los datos arriba mencionados deben estar separados entre ellos por un único espacio. Debajo se muestra un ejemplo de archivo ``controller.txt`` :

source: In the above example, ``render1`` is the controller node, its IP address is ``10.10.0.166`` and the controller program runs on the ``10000`` port.
es: En el ejemplo de arriba, ``render1`` es el nodo controlador, su dirección IP es ``10.10.0.166`` y el programa controlador usará el puerto ``10000`` .

source: Defining the Server Nodes
es: Definición de los nodos Servidores

source: The server (rendering) nodes are defined in the ``servers.txt`` configuration file placed in the ``FARMROOT\config`` directory.
es: Los nodos servidores (procesadores) se definen en el archivo de configuración ``servers.txt`` ubicado en la carpeta ``FARMROOT\config`` .

source: The file must contain a text line for every computer you want to use as a server (rendering) node.
es: El archivo debe contener una línea de texto por cada computadora que se desee usar como nodo servidor (procesador).

source: For each sever (rendering) node you must specify the following:
es: Para cada nodo servidor debe especificarse lo siguiente:

source: The port number you intend to use for the server service.
es: El número del puerto que se desee usar para el servicio del servidor.

source: Be sure that the port you set is not blocked by any firewall system, and is open for all the computers belonging to the Toonz Farm.
es: Es necesario asegurarse de que el puerto establecido no se encuentre bloqueado por ningún sistema cortafuegos, y que se encuentre abierto para todas las computadoras pertenecientes a la granja de Toonz Farm.

source: The above information must be separated by a single space. Here is an example of a ``servers.txt`` file::
es: Los datos arriba mencionados deben estar separados entre ellos por un único espacio. Debajo se muestra un ejemplo de archivo ``servers.txt`` ::

source: In the above example, ``render1`` is a server node whose IP address is ``10.10.0.166`` and the server program runs on the ``8002`` port; ``render2`` is a server node whose IP address is ``10.10.0.195`` and the server program runs on the ``8002`` port; etc.
es: En el ejemplo de arriba, ``render1`` es un nodo servidor, su dirección IP es ``10.10.0.166`` y el programa servidor usará el puerto ``8002`` ; ``render2`` es un nodo servidor, su dirección IP es ``10.10.0.195`` y el programa servidor usará el puerto ``8002`` ; etc.

source: If you want to add or remove a server (rendering) node from the ``servers.txt`` file, you have to restart the controller node in order to make the changes effective.
es: Si se desea agregar o eliminar un nodo servidor (procesador) del archivo ``servers.txt`` , será necesario reiniciar el nodo controlador para hacer efectivos los cambios.

source: Defining the Toonz Farm in OpenToonz
es: Definición de la granja de Toonz Farm en OpenToonz

source: OpenToonz is the Toonz Farm client program: it allows you to submit new tasks and monitor the status of the farm.
es: OpenToonz es el programa cliente de Toonz Farm: permite enviar nuevas tareas y monitorear el estado de la granja.

source: If the computer where you run OpenToonz is a controller or a server (rendering) node for the Toonz Farm, no further settings are required.
es: Si la computadora donde se ejecuta OpenToonz ya es un nodo controlador o servidor (procesador) de Toonz Farm, no será necesario realizar ninguna tarea adicional de configuración.

source: If the computer is neither a controller nor a server (rendering) node for the Toonz Farm, the FARMROOT has to be defined.
es: Si la computadora donde se ejecuta OpenToonz no fuera un nodo controlador o servidor (procesador) de Toonz Farm, será necesario definir la carpeta principal FARMROOT.

source: **To define the FARMROOT in OpenToonz:**
es: **Para definir la carpeta FARMROOT en OpenToonz:**

source: Run OpenToonz and go to the **Farm** room.
es: Ejecutar OpenToonz e ir al espacio de trabajo **Farm**.

source: In the Batch Servers pane, set the **Process with:** option menu to **Render Farm**.
es: En el panel Servidores de tareas, en el menú de opciones **Procesar con:** elegir **Granja de procesamiento**.

source: In the dialog that opens specify the full path to the **FARMROOT** folder.
es: En el diálogo que se abre especificar la ruta completa a la carpeta principal **FARMROOT**.
