Repository: WizzerWorks/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/whats_new.po
Languages: es

source: What's New in OpenToonz
es: Novedades

source: In this section you can find a list of Highlights in the latest release of OpenToonz; these may include New Features, Bug Fixes or Enhancements to already existent features. Here, you can also find links to past versions' Release Notes, to keep track of OpenToonz development history throughout time.
es: En esta sección se podrá encontrar una lista de las novedades Destacadas de la última versión de OpenToonz; éstas podrán incluir Nuevas Características, Correcciones de Errores o Mejoras a funciones ya existentes. También podrán encontrarse aquí enlaces a las Notas de cada versión, para poder llevar la cuenta de la historia de desarrollo de OpenToonz a lo largo del tiempo.

source: Highlights
es: Destacadas

source: |new| UI: All New **Icon set**.
es: |new_es| Interfaz: Nuevo **conjunto de Íconos** completamente renovado.

source: |new| UI: Updated **Default Room set**.
es: |new_es| Interfaz: **Conjunto de Espacios de trabajo** actualizado.

source: |new| Eraser Tool: **Segment** selection type, for quickly cutting stroke intersections.
es: |new_es| Herramienta Borrador: Tipo de selección **Segmento**, para cortar rápidamente segmentos de trazos.

source: |new| Xsheet/Timeline: **Paste as a Copy** command, for pasting an independent copy of a drawing.
es: |new_es| Planilla/Línea de tiempo: Comando **Pegar como copia**, para pegar una copia independiente de un dibujo.

source: |new| Geometry Tool: **MultiArc** shape.
es: |new_es| Herramienta Geometría: Forma **Arco múltiple**.

source: |new| Brushes: **Aotz** Raster Brush Set (MyPaint): Sketch, Ink, Fill, Clouds, Water, Grass, Leaves, Fur, Eraser, etc.
es: |new_es| Pinceles: Conjunto de pinceles **Aotz* (MyPaint): Sketch, Ink, Fill, Clouds, Water, Grass, Leaves, Fur, Eraser, etc.

source: |new| Effects: **Bloom Iwa**.
es: |new_es| Efectos: **Bloom (Resplandor) Iwa**.

source: |new| Effects: **Fractal Noise Iwa**.
es: |new_es| Efectos: **Fractal Noise (Ruido fractal) Iwa**.

source: |new| Effects: **Glare Iwa**.
es: |new_es| Efectos: **Glare (Relumbrar) Iwa**.

source: |new| Effects: New **Particles** effect preset: **Flock**
es: |new_es| Efectos: Nuevo ajuste predefinido del efecto **Particles (Partículas)**: **Flock (Bandada)**

source: |new| Expressions: **Expression Reference Manager**, for keeping track of objects name changes (experimental).
es: |new_es| Expresiones: **Administrador de referencias en expresiones**, para seguir el rastro de cambios en el nombre de objetos (experimental).

source: |new| Expressions: **Periodic Random** function.
es: |new_es| Expresiones: Función **Aleatoria periódica** random_p() y random_ps().

source: |new| Shortcuts: **Individual Geometric Tool Shapes shortcuts** for compatibility with Adobe Animate keyboard shortcuts.
es: |new_es| Atajos: **Atajos individuales para Formas de la herramienta Geometría** para mejor compatibilidad con atajos de teclado de Adobe Animate.

source: |new| Translation: Initial support for **Norwegian Bokmal**.
es: |new_es| Traducciones: Soporte inicial para **Noruego Bokmal**.

source: |new| Translation: **Weblate** widget.
es: |new_es| Traducciones: Widget de **Weblate**.

source: |new| Plugins: Updated **Dwango plugins** (separate download)
es: |new_es| Plugins: Se actualizaron los **plugins de Dwango** (descarga separada)

source: |new| Operating Systems: **FreeBSD** support.
es: |new_es| Sistemas operativos: Soporte para **FreeBSD**.

source: |enhancement| Animate Tool: Ease regulations for the use of the Animate Tool.
es: |enhancement_es| Herramienta Animar: Se relajaron las regulaciones para el uso de la herramienta Animar.

source: |enhancement| Selection Tool: **Improved** target area for **Transform selection**.
es: |enhancement_es| Herramienta Seleccionar: **Mejoras** en el área objetivo para **Transformar una selección**.

source: |enhancement| Undo: **Reset Undo when Saving Levels** Preference Option.
es: |enhancement_es| Deshacer: Opción **Limpiar historial de Deshacer al guardar niveles** en Preferencias.

source: |enhancement| UI: New **Horizontal Mode for Level Strip** editor.
es: |enhancement_es| Interfaz: Nuevo **modo Horizontal en la Cinta de nivel**.

source: |enhancement| UI: Added a **New Style button** in the styles area of the Style Editor (optional).
es: |enhancement_es| Interfaz: Se agregó un **botón de Nuevo estilo** en el área de estilos en el Editor de estilos (opcional).

source: |enhancement| UI: New **Top/Bottom Toolbar** option in Palette Editor.
es: |enhancement_es| Interfaz: Nueva opción para el posicionamiento **Superior/Inferior de la Barra de botones** en el editor de Paleta.

source: |enhancement| UI: New **Color Keys** in Global Palette.
es: |enhancement_es| Interfaz: Nuevos **Claves de Color** en Paleta Global.

source: |enhancement| UI: Updated **Output Settings** dialogue.
es: |enhancement_es| Interfaz: Se actualizó el diálogo **Opciones de salida**.

source: |enhancement| UI / Preferences: **Live update for 3DLUTs** in Preferences.
es: |enhancement_es| Interfaz / Preferencias: **Actualización inmediata al cambiar de 3DLUT** en las Preferencias.

source: |enhancement| UI / Preferences: New **Style Sheet customizations** in Preferences.
es: |enhancement_es| Interfaz / Preferencias: Nueva posibilidad de **personalizar Style Sheets** en las Preferencias.

source: |enhancement| UI / Preferences: New **Switch Tool Temporarily Keypress Length** option
es: |enhancement_es| Interfaz / Preferencias: Nueva opción **Duración de presión para cambio temporal de herramienta** en Preferencias.

source: |enhancement| Cutter Tool: Now it **Snaps at intersections**.
es: |enhancement_es| Herramienta Cortar: Ahora se **Adhiere a las intersecciones** de trazos.

source: |enhancement| Control Point Editor Tool: Added a **Snap** option.
es: |enhancement_es| Herramienta Editar puntos de control: Se agregó una opción de **Adherencia**.

source: |enhancement| Control Point Editor Tool: Added a **Freehand mode**.
es: |enhancement_es| Herramienta Editar puntos de control: Se agregó un **modo Lazo**.

source: |enhancement| Color Separation: **Save/Reload Color Separation** Parameters.
es: |enhancement_es| Separación de color: Ahora es posible **Guardar/Cargar opciones** de separación de color.

source: |enhancement| Conversion: Added **Align Boundary Strokes Direction** option in **Convert To Vector** feature.
es: |enhancement_es| Conversión: Se agregó la opción **Alinear dirección de trazos exteriores** a la función **Convertir en vectorial**.

source: |enhancement| Effects: Added a **Search Bar** in **New FX** browser window.
es: |enhancement_es| Efectos: Se agregó una **Barra de búsqueda** en la ventana del **Explorador de efectos**.

source: |enhancement| Effects: Added **Linear color space** option in **Add Ino** effect.
es: |enhancement_es| Efectos: Se agregó la opción **espacio de color lineal (Linear)** al efecto **Add (Adicionar) Ino**.

source: |enhancement| Effects: Added **Logarithmic** option in **Spiral** effect.
es: |enhancement_es| Efectos: Se agregó la opción **Logarithmic (Logarítmico)** al efecto **Spiral (Espiral)**.

source: |enhancement| Eraser Tool: Added **Frame Range** mode when using the new **Segment** selection type.
es: |enhancement_es| Herramienta Borrador: Se agregó el modo **Rango de fotogramas** al usar el nuevo tipo de selección **Segmento**.

source: |enhancement| Expressions: Now it's possible to **Copy an expression object address** directly from the UI.
es: |enhancement_es| Expresiones: Ahora es posible **Copiar la dirección de un objeto para usar en una expresión** directamente desde la interfaz.

source: |enhancement| I/O: **Premultiply on Loading PNG** images.
es: |enhancement_es| E/S: Ahora las **imágenes PNG son premultiplicadas** al ser cargadas.

source: |fix| I/O: Fix incorrect XML in .tnz scene files.
es: |fix_es| E/S: Generación escenas con un XML incorrecto al guardar archivos .tnz.

source: |fix| Keyframing: Fix Copy/Paste keyframe causing bad data.
es: |fix_es| Keyframing: Al copiar y pegar claves se generaba corrupción de datos.

source: |fix| Scene Cast: Fix Update on Pasting.
es: |fix_es| Componentes de la escena: Corregida la actualización luego de pegar datos.

source: |fix| Brushes: Fix custom Vector Brush styles.
es: |fix_es| Pinceles: Corrección en los Pinceles Vectoriales personalizados.

source: |fix| Tape Tool: Fix **Vector Tape Tool** on Joining Points at the same position.
es: |fix_es| Herramienta Cinta: Corrección al **Unir puntos vectoriales** que ocupan la misma ubicación.

source: |fix| Geometric Tool: Fix first point offset.
es: |fix_es| Herramienta Geometría: Corregido el desplazamiento observado al marcar el primer punto de la forma.

source: |fix| Type Tool: Fix first point offset.
es: |fix_es| Herramienta Texto: Corregido el desplazamiento observado al marcar el primer punto.

source: |fix| Plastic Tool: Fix in OpenGL Line Smoothing
es: |fix_es| Herramienta Plástico: Corrección en el suavizado de líneas OpenGL.

source: |fix| Xsheet: Fix crash when Drawing on an absent level.
es: |fix_es| Planilla: Cuelgue al Dibujar en un nivel inexistente.

source: |fix| Color Model: Fix color model pick mode.
es: |fix_es| Modelo de color: Correcciones en el modo de escoger colores.

source: |fix| Monitors/Screens: Fix for Full Screen on Multiple Monitors. (Windows)
es: |fix_es| Monitores/Pantallas: Corregido el modo a Pantalla Completa en configuraciones de Múltiples Monitores. (Windows)

source: |fix| Monitors/Screens: Fix icon rendering for HDPI screens.
es: |fix_es| Monitores/Pantallas: Corregida la visualización de los íconos en pantallas de alta densidad (HDPI).

source: |fix| Monitors/Screens: Fix for Duplicate Window Title. (Mac)
es: |fix_es| Monitores/Pantallas: Título de la ventana duplicado. (Mac)

source: |fix| Audio: Fix crash on Recording audio. (Mac, Windows)
es: |fix_es| Audio: Corregido el cuelgue al Grabar audio. (Mac, Windows)

source: |fix| Rendering: Fix Batch Rendering. (Mac)
es: |fix_es| Procesamiento: Corregido el procesamiento por lotes. (Mac)

source: ...and much more!
es: ...y mucho más!

source: Please see the `v1.5 Release Notes <https://github.com/opentoonz/opentoonz/releases/tag/v1.5.0>`_ hosted in GitHub, for the full list of new features, enhancements and bug fixes.
es: Por favor ver las `Notas de la versión 1.5 (en inglés) <https://github.com/opentoonz/opentoonz/releases/tag/v1.5.0>`_ alojadas en GitHub, para obtener la lista completa de nuevas características, mejoras y correcciones de errores.

source: Previous Versions of OpenToonz
es: Versiones anteriores de OpenToonz

source: Here you can find links to previous versions' full Release Notes, hosted in GitHub:
es: Aquí es posible encontrar enlaces a las Notas de las versiones anteriores (en inglés), alojadas en GitHub:

source: `v1.4 Release Notes <https://github.com/opentoonz/opentoonz/releases/tag/v1.4.0>`_
es: `Notas de la versión 1.4 <https://github.com/opentoonz/opentoonz/releases/tag/v1.4.0>`_

source: `v1.3 Release Notes <https://github.com/opentoonz/opentoonz/releases/tag/v1.3.0>`_
es: `Notas de la versión 1.3 <https://github.com/opentoonz/opentoonz/releases/tag/v1.3.0>`_

source: `v1.2.1 Release Notes <https://github.com/opentoonz/opentoonz/releases/tag/v1.2.1>`_
es: `Notas de la versión 1.2.1 <https://github.com/opentoonz/opentoonz/releases/tag/v1.2.1>`_

source: `v1.2 Release Notes <https://github.com/opentoonz/opentoonz/releases/tag/v1.2.0>`_
es: `Notas de la versión 1.2 <https://github.com/opentoonz/opentoonz/releases/tag/v1.2.0>`_

source: `v1.1.34 Release Notes <https://github.com/opentoonz/opentoonz/releases/tag/v1.143>`_
es: `Notas de la versión 1.1.3 <https://github.com/opentoonz/opentoonz/releases/tag/v1.1.3>`_

source: `v1.1.2 Release Notes <https://github.com/opentoonz/opentoonz/releases/tag/v1.1.2>`_
es: `Notas de la versión 1.1.2 <https://github.com/opentoonz/opentoonz/releases/tag/v1.1.2>`_

source: `v1.1 Release Notes <https://github.com/opentoonz/opentoonz/releases/tag/v1.1.0>`_
es: `Notas de la versión 1.1 <https://github.com/opentoonz/opentoonz/releases/tag/v1.1.0>`_

source: `v1.0.3 Release Notes <https://github.com/opentoonz/opentoonz/releases/tag/v1.0.3>`_
es: `Notas de la versión 1.0.3 <https://github.com/opentoonz/opentoonz/releases/tag/v1.0.3>`_

source: `v1.0.2 Release Notes <https://github.com/opentoonz/opentoonz/releases/tag/v1.0.2>`_
es: `Notas de la versión 1.0.2 <https://github.com/opentoonz/opentoonz/releases/tag/v1.0.2>`_

source: `v1.0 Release Notes <https://github.com/opentoonz/opentoonz/releases/tag/v1.0>`_
es: `Notas de la versión 1.0 <https://github.com/opentoonz/opentoonz/releases/tag/v1.0>`_
